{
  "common": {
    "head": {
      "title": "{{FileFormatUp}} را با استفاده از کتابخانه {{ProgLang}} مقایسه کنید.",
      "description": "{{ProdFullName}} نرم افزاری را برای تولید گزارش های بررسی اختلاف دقیق برای {{Runtime}} برنامه ارائه می دهد."
    },
    "header": {
      "title": "مقایسه فایل های {{FileFormatUp}} شما در {{Runtime}}",
      "description": "کتابخانه مقایسه اسناد مبتنی بر {{Runtime}} فرصتی برای جمع آوری و نمایش داده ها در مورد هر گونه تمایز در {{FileFormatUp}} فایل فراهم می کند. بهره وری راه حل های خود را در وظایف مقایسه فایل با {{ProdShortName}} افزایش دهید.",
      "subtitle": "راه حل برای مقایسه فایل ها",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "ویژگی های {{ProdFullName}} را کشف کنید",
      "content": "{{ProdFullName}} یک API است که به مقایسه تصاویر و اسناد در همان قالب کمک می کند. این می تواند تفاوت در پاراگراف ها، کلمات، کاراکترها، اشکال و سبک های متن را بین اسناد مقایسه شده پیدا کند. شما می توانید این تغییرات را ترکیب کرده و آنها را به عنوان یک سند نهایی ذخیره کنید. به خوبی با PDF s، Word سند، Excel ورق، PowerPoint اسلاید، Visio نمودار، Outlook ایمیل، HTML، نقشه ها و انواع مختلف تصویر کار می کند - همه بدون نیاز به ابزار اضافی."
    },
    "steps": {
      "title": "نحوه انجام مقایسه فایل {{FileFormatUp}} با استفاده از {{Runtime}}.",
      "content": {
        "title": "امکان استفاده از {{FileFormatUp}} فایل ها با استفاده از [{{ProdShortName}}]({{ProductUrl}}) برای دریافت گزارش در مورد تفاوت در بسیاری از فایل های {{FileFormatUp}}",
        "step_1": "نصب {{ProdFullName}} با استفاده از [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "نمونه سازی Comparer و ارائه مسیر به اولین فایل ها در قالب {{FileFormatUp}}",
        "step_3": "افزودن یک فایل {{FileFormatUp}} دیگر به Comparer",
        "step_4": "یک گزارش واضح تهیه کنید که به طور دقیق تفاوت ها را توصیف می کند"
      },
      "code": {
        "comments": {
          "comment_1": "چندین فایل را بررسی کنید تا ببینید چطور مشابه یا متفاوت هستند",
          "comment_2": "یک شیء Comparer ایجاد کنید و اولین فایل را به عنوان ورودی به آن بدهید",
          "comment_3": "افزودن فایل های بیشتر",
          "comment_4": "گزارش نهایی را دریافت کنید"
        }
      }
    },
    "formats": {
      "title": "مقایسه انواع سند محبوب از طریق {{ProgLang}}",
      "description": "{{Runtime}} API ما به شما امکان می دهد اسناد را در قالب های مختلف مقایسه کنید. با پردازش آنها با استفاده از ابزار ما، تغییرات اسناد را بدون زحمت پیگیری کنید."
    }
  },
  "pdf": {
    "head": {
      "title": "کتابخانه {{ProgLang}} برای بررسی تفاوت ها در PDF s.",
      "description": "نرم افزار {{ProdShortName}} {{Runtime}} گزارش های جامعی را با جزئیات تفاوت ها در PDF اسناد تولید می کند."
    },
    "header": {
      "title": "PDF مقایسه اسناد برای {{EnvName}}",
      "description": "از API مقایسه اسناد ما در {{Runtime}} برای تشخیص و نمایش تفاوت در PDF s در برنامه های کاربردی {{ProgLang}} استفاده کنید. از دریافت سریع و بدون زحمت گزارش های دقیق بهره مند شوید."
    },
    "about": {
      "title": "بررسی ویژگی های کتابخانه {{ProdFullName}}",
      "content": "گزارش های دقیق در مورد هرگونه تفاوت در PDF اسناد را در .NET برنامه های خود دریافت کنید. از {{ProdFullName}} با اضافه کردن چند خط کد بدون هیچ نرم افزار اضافی یا هر کتابخانه خارجی دیگر استفاده کنید. هر گونه تغییر در پاراگراف ها، کلمات، کاراکترها، اشکال و سبک های متن در فایل های PDF خود را کنترل کنید. ادغام تغییرات از بسیاری از نسخه های سند به نتیجه PDF نیز در دسترس است. اسناد را به سرعت و بدون تلاش اضافی پردازش کنید."
    },
    "steps": {
      "title": "دریافت گزارش در مورد تمایز PDF در {{ProgLang}}",
      "content": {
        "title": "ردیابی تغییرات اسناد PDF با گزارش های تشکیل شده با [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "از [{{PackageStoreName}}]({{PackageUrl}}) برای نصب {{ProdShortName}} برای {{EnvName}} استفاده کنید",
        "step_2": "سازنده Comparer را با PDF مسیر فایل فراخوانی کنید",
        "step_3": "یک PDF دیگر ارائه دهید تا آن را با اولین مقایسه کنید",
        "step_4": "یک گزارش نهایی در مورد تفاوت فایل ها را بازیابی کنید"
      },
      "code": {
        "comments": {
          "comment_1": "دریافت گزارش در مورد تغییرات در PDF فایل",
          "comment_2": "نمونه Comparer را با یک فایل اول بسازید",
          "comment_3": "اضافه کردن فایل یا فایل های دیگر",
          "comment_4": "ذخیره گزارش در مسیر مشخص شده"
        }
      }
    },
    "formats": {
      "title": "مقایسه فرمت های محبوب فایل مانند PDF با استفاده از {{ProgLang}}",
      "description": "فایل های PDF شما را می توان با {{Runtime}} API ما به سرعت مقایسه کرد. با گزارش های دقیق، تغییر سند را بدون زحمت کنترل کنید."
    }
  },
  "docx": {
    "head": {
      "title": "{{Runtime}} API امکان مقایسه DOCX اسناد را فراهم می کند.",
      "description": "MS Word DOCX تفاوت فایل ها ممکن است توسط {{ProdShortName}} {{Runtime}} API بررسی شود که گزارش های مفیدی را توصیف تغییرات اسناد تولید می کند."
    },
    "header": {
      "title": "مقایسه DOCX فایل ها با {{EnvName}}",
      "description": "از API پردازش سند در {{Runtime}} برای شناسایی و آشکار کردن هرگونه تغییر در MS Word DOCX فایل توسط {{EnvName}} برنامه ها استفاده کنید. از تولید گزارش های سریع و بدون زحمت استفاده کنید."
    },
    "about": {
      "title": "ویژگی های API {{ProdFullName}} را باز کنید",
      "content": "گزارش‌های مفصلی که داده‌های غنی دربارهٔ تغییرات در نسخه‌های مختلف DOCX اسناد را به ارمغان می‌آورند، توسط {{ProdShortName}} ارائه می‌شوند. از {{EnvName}} همراه با API ما با اضافه کردن چند خط کد و بدون کتابخانه های دیگر استفاده کنید. تغییرات در صفحات، متن، سبک های متن یا اشکال در MS Word سند را تجزیه و تحلیل کنید. فقط داده های درست را انتخاب کرده و سند نهایی DOCX را با ادغام بنویسید. با نرم افزار ما در راه حل های پردازش اسناد خود پیشرفت کنید."
    },
    "steps": {
      "title": "گزارش را با DOCX تمایز اسناد در {{ProgLang}} تهیه کنید",
      "content": {
        "title": "[{{ProdShortName}}]({{ProductUrl}}) و {{EnvName}} به ما اجازه می دهد تا DOCX اسناد را مقایسه کنیم",
        "step_1": "از [{{PackageStoreName}}]({{PackageUrl}}) برای نصب {{ProdShortName}} برای {{EnvName}} استفاده کنید",
        "step_2": "فراخوانی سازنده Comparer به DOCX مسیر نیاز دارد",
        "step_3": "سایر فایل های DOCX باید ارائه شوند",
        "step_4": "از نتایج لذت ببرید"
      },
      "code": {
        "comments": {
          "comment_1": "داده های توصیف DOCX تغییرات را بدست آورید",
          "comment_2": "ارائه نمونه Comparer با فایل MS Word",
          "comment_3": "افزودن فایل های بیشتر",
          "comment_4": "ذخیره نتیجه به دیسک محلی"
        }
      }
    },
    "formats": {
      "title": "از {{ProgLang}} برای مقایسه DOCX اسناد استفاده کنید",
      "description": "هر فایل MS Word DOCX ممکن است با {{ProdFullName}} مقایسه شود. اطلاعات ارزشمندی را در مورد تغییرات در اسناد خود بگذارید."
    }
  },
  "png": {
    "head": {
      "title": "{{ProgLang}} API برای مقایسه PNG تصاویر.",
      "description": "کتابخانه {{ProdFullName}} نشان دهنده گزارش های دقیق در مورد تمایز در تصاویر در قالب PNG است."
    },
    "header": {
      "title": "PNG مقایسه تصاویر {{Runtime}} برنامه های کاربردی از طریق Java",
      "description": "از استفاده از {{Runtime}} API برای ردیابی تغییرات در PNG فایل در {{ProgLang}} برنامه ها استفاده کنید. دریافت گزارش های دقیق بدون زحمت و سریع."
    },
    "about": {
      "title": "{{ProdFullName}} امکانات API را باز کنید",
      "content": "گزارش های کامل در مورد هرگونه تغییر در نسخه های مختلف PNG اسناد توسط {{ProgLang}} برنامه های خود تهیه کنید. بدون نیاز به نرم افزار شخص ثالث. در مورد هرگونه تغییر در نسخه های تصویر PNG خود مطلع باشید."
    },
    "steps": {
      "title": "ایجاد PNG گزارش تمایز تصاویر در {{ProgLang}}",
      "content": {
        "title": "ردیابی تغییرات اسناد PNG با استفاده از گزارش های ارائه شده توسط [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "بسته {{ProdShortName}} را از طریق [{{PackageStoreName}}]({{PackageUrl}}) نصب کنید",
        "step_2": "از سازنده کلاس Comparer با مسیر PNG استفاده کنید",
        "step_3": "چند PNG ثانیه را به مقایسه اضافه کنید",
        "step_4": "دریافت گزارشی حاوی اطلاعات مربوط به تفاوت ها"
      },
      "code": {
        "comments": {
          "comment_1": "فرآیند تهیه گزارش تمایز PNG",
          "comment_2": "نمونه جدیدی از Comparer باید ارائه شود",
          "comment_3": "سایر فایل ها یا فایل های PNG نیز",
          "comment_4": "نتیجه را در همان فرمت دریافت کنید"
        }
      }
    },
    "formats": {
      "title": "تصاویر را در فرمت های محبوب مانند PNG با استفاده از {{ProgLang}} مطابقت دهید",
      "description": "از {{ProdFullName}} برای کسب اطلاعات در مورد تفاوت های PNG تصاویر استفاده کنید. گزارش های دقیق به شما کمک می کند تا از هر گونه تغییر در داده های مهم مطلع شوید."
    }
  },
  "jpeg": {
    "head": {
      "title": "{{Runtime}} کتابخانه برای مقایسه تصاویر JPEG خودکار.",
      "description": "برای کسب اطلاعات در مورد تمایز در JPEG تصاویر، ویژگی های API {{ProdFullName}} را بررسی کنید."
    },
    "header": {
      "title": "JPEG را برای تفاوت ها بررسی کنید و گزارش ها را از طریق {{EnvName}} دریافت کنید",
      "description": "راه حل قدرتمند {{Runtime}} برای مقایسه تغییرات در JPEG تصاویر در {{ProgLang}} برنامه. گزارش های دقیق مزایای قابل توجهی برای راه حل های تجاری شما به ارمغان می آورد."
    },
    "about": {
      "title": "قابلیت های {{ProdFullName}} را کشف کنید",
      "content": "با استفاده از نرم افزار {{ProdFullName}} از هرگونه تغییر در فایل های تصویر JPEG مطلع باشید. داده های غنی را در گزارش های ما تجزیه و تحلیل کنید تا فایل های JPEG خود را با استفاده از {{ProgLang}} برنامه ها پردازش کنید. بدون بسته های اضافی راه حل های کسب و کار خود را با اضافه کردن چند خط کد تقویت کنید."
    },
    "steps": {
      "title": "جمع آوری JPEG داده های تغییرات از طریق {{ProgLang}}",
      "content": {
        "title": "از ویژگی های [{{ProdShortName}}]({{ProductUrl}}) برای کنترل تغییرات در JPEG تصاویر استفاده کنید",
        "step_1": "دریافت {{ProdShortName}} از [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "اضافه کردن شیء مقایسه کننده با مسیر فایل JPEG",
        "step_3": "حداقل دو فایل JPEG باید تجزیه و تحلیل شوند",
        "step_4": "نتیجه را در قالب JPEG دریافت کنید"
      },
      "code": {
        "comments": {
          "comment_1": "پردازش JPEG فایل برای دریافت گزارش تمایز",
          "comment_2": "شیء جدید کلاس Comparer",
          "comment_3": "سایر فایل های JPEG",
          "comment_4": "گزارش با اطلاعات مربوط به JPEG تفاوت"
        }
      }
    },
    "formats": {
      "title": "مقایسه JPEG تصاویر با فرمت محبوب از طریق {{ProgLang}}",
      "description": "نرم افزار مبتنی بر {{ProdFullName}} اطلاعات ارزشمندی در مورد تفاوت بین JPEG تصاویر ایجاد می کند. گزارش های راحت امکان کنترل هرگونه تغییر در فایل های تجاری را فراهم می کند."
    }
  },
  "jpg": {
    "head": {
      "title": "بررسی خودکار اختلاف برای JPG تصویر توسط کتابخانه {{Runtime}}.",
      "description": "از نرم افزار {{ProdFullName}} برای دسترسی به اطلاعات دقیق تمایز در JPG تصاویر استفاده کنید."
    },
    "header": {
      "title": "دریافت JPG گزارش تغییر در {{EnvName}} برنامه",
      "description": "از قابلیت های {{Runtime}} برای مقایسه JPG تغییرات تصویر در {{ProgLang}} برنامه استفاده کنید. گزارش های دقیق مزایای قابل توجهی را برای راه حل های تجاری ارائه می دهند."
    },
    "about": {
      "title": "قابلیت های API {{ProdFullName}} را کشف کنید",
      "content": "با نرم افزار {{ProdFullName}} از تغییرات در فایل های تصویر JPG مطلع باشید. داده های غنی را در گزارش های ما تجزیه و تحلیل کنید تا JPG فایل را در {{ProgLang}} برنامه بدون بسته های اضافی پردازش کنید. راه حل های کسب و کار را فقط با چند خط کد ارتقا دهید."
    },
    "steps": {
      "title": "جمع آوری JPG داده های تغییر با استفاده از {{ProgLang}}",
      "content": {
        "title": "از ویژگی های [{{ProdShortName}}]({{ProductUrl}}) برای مدیریت JPG تغییرات تصویر استفاده کنید",
        "step_1": "دریافت {{ProdShortName}} از [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "ادغام شی مقایسه کننده با مسیر فایل JPG",
        "step_3": "حداقل دو فایل JPG را تجزیه و تحلیل کنید",
        "step_4": "بازیابی نتایج در قالب JPG"
      },
      "code": {
        "comments": {
          "comment_1": "پردازش JPG فایل برای تولید گزارش تمایز",
          "comment_2": "نمونه سازی شیء جدید کلاس Comparer",
          "comment_3": "اضافه کردن فایل های JPG دیگر برای مقایسه",
          "comment_4": "گزارش حاوی اطلاعات مربوط به JPG تفاوت ایجاد کنید"
        }
      }
    },
    "formats": {
      "title": "مقایسه تصاویر با فرمت محبوب JPG با استفاده از {{ProgLang}}",
      "description": "کتابخانه مبتنی بر {{ProdFullName}} بینش ارزشمندی در مورد تفاوت بین JPG تصاویر ارائه می دهد. گزارش های مناسب نظارت بر تغییرات در پرونده های تجاری را تسهیل می کند."
    }
  },
  "xlsx": {
    "head": {
      "title": "محتوای صفحات گسترده XLSX را با {{Runtime}} API مقایسه کنید.",
      "description": "تفاوت های صفحات گسترده MS Excel را می توان با {{Runtime}} API بررسی کرد، که گزارش های آموزنده ای را با جزئیات انواع مختلف تمایز تولید می کند."
    },
    "header": {
      "title": "مقایسه صفحات گسترده XLSX با استفاده از {{EnvName}}",
      "description": "از کتابخانه پردازش سند در {{Runtime}} برای شناسایی و افشای تغییرات در MS Excel XLSX فایل در {{EnvName}} برنامه استفاده کنید. از تولید سریع و بدون زحمت گزارش بهره مند شوید."
    },
    "about": {
      "title": "مزایای {{ProdShortName}} را کشف کنید",
      "content": "به گزارش های دقیق حاوی داده های غنی در مورد تغییرات در نسخه های مختلف XLSX اسناد ارائه شده توسط {{ProdShortName}} دسترسی پیدا کنید. {{EnvName}} برنامه را با API ما فقط با استفاده از چند خط کد، بدون تلاش اضافی ادغام کنید. تغییرات در صفحات، متن، سبک های متن یا اشکال در MS Excel سند را تجزیه و تحلیل کنید. داده های مناسب را انتخاب کنید و آنها را در یک سند نهایی XLSX ادغام کنید. پروژه های تجاری خود را با راه حل های ما پیشرفت کنید."
    },
    "steps": {
      "title": "گزارش را با XLSX تمایز اسناد در {{ProgLang}} تهیه کنید",
      "content": {
        "title": "از [{{ProdShortName}}]({{ProductUrl}}) و {{EnvName}} برای مقایسه سند XLSX استفاده کنید",
        "step_1": "{{ProdShortName}} را برای {{EnvName}} از [{{PackageStoreName}}]({{PackageUrl}}) نصب کنید",
        "step_2": "هنگام فراخوانی سازنده Comparer، مسیر XLSX را ارائه دهید",
        "step_3": "شامل فایل های اضافی XLSX",
        "step_4": "از نتایج تولید شده لذت ببرید"
      },
      "code": {
        "comments": {
          "comment_1": "بازیابی داده های توصیف تغییرات در XLSX اسناد",
          "comment_2": "مقایسه را با یک فایل MS Excel نمونهسازی کنید",
          "comment_3": "اضافه کردن فایل های بیشتر برای مقایسه",
          "comment_4": "نتیجه را به دیسک محلی ذخیره کنید"
        }
      }
    },
    "formats": {
      "title": "از {{ProgLang}} برای مقایسه صفحات گسترده XLSX استفاده کنید",
      "description": "هر صفحه گسترده MS Excel XLSX را به راحتی با استفاده از {{ProdFullName}} مقایسه کنید. بینش ارزشمندی در مورد تغییرات در داده های کسب و کار خود بدست آورید."
    }
  },
  "pptx": {
    "head": {
      "title": "تفاوت های PPTX را با {{EnvName}} بررسی کنید.",
      "description": "PPTX را می توان با راه حل {{ProdShortName}} {{EnvName}} تجزیه و تحلیل کرد، که گزارش های واقعی را توصیف می کند که تمایز محتوا را توصیف می کند."
    },
    "header": {
      "title": "مقایسه برای PPTX ارائه با {{EnvName}}",
      "description": "از API پردازش سند در {{Runtime}} برای شناسایی و برجسته کردن تغییرات در فایل های MS PowerPoint PPTX با استفاده از برنامه های مبتنی بر {{EnvName}} استفاده کنید. فرآیندهای کسب و کار خود را با تجزیه و تحلیل سریع و بدون زحمت داده ها بهبود ببخشید."
    },
    "about": {
      "title": "ویژگی های {{ProdFullName}} را کشف کنید",
      "content": "از داده های دقیق از گزارش {{ProdShortName}} ما بر اساس اطلاعات مربوط به تغییرات در بسیاری از نسخه های PPTX فایل استفاده کنید. راه حل ما را برای {{EnvName}} برنامه فقط با چند خط کد، بدون تلاش اضافی درگیر کنید. داده های مربوط به صفحات، متن، سبک ها یا اشکال را در MS PowerPoint ارائه تجزیه و تحلیل کنید. تغییرات مناسب را در یک ارائه نتیجه PPTX ادغام کنید. از راه حل ما برای پروژه های تجاری خود استفاده کنید."
    },
    "steps": {
      "title": "از PPTX گزارش تمایز اسناد با {{ProgLang}} استفاده کنید",
      "content": {
        "title": "[{{ProdShortName}}]({{ProductUrl}}) برای مقایسه PPTX ارائه ها",
        "step_1": "دریافت {{ProdShortName}} از [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "فراخوانی سازنده Comparer",
        "step_3": "افزودن PPTX ارائه اضافی",
        "step_4": "نتیجه را دریافت کنید"
      },
      "code": {
        "comments": {
          "comment_1": "دریافت داده های مربوط به تغییرات در PPTX ارائه",
          "comment_2": "مقایسه کننده را با مسیر به فایل PPTX ارائه دهید",
          "comment_3": "اضافه کردن ارائه یا ارائه های دیگر",
          "comment_4": "نتیجه را در ذخیره سازی محلی ذخیره کنید"
        }
      }
    },
    "formats": {
      "title": "مقایسه PPTX ارائه را با استفاده از {{ProgLang}} انجام دهید",
      "description": "هر اسناد را در قالب های محبوب از جمله MS PowerPoint PPTX ارائه با {{ProdFullName}} مقایسه کنید. داده های کسب و کار خود را با دریافت گزارش در مورد تمایز در PPTX ارائه غنی کنید."
    }
  }
}