{
  "common": {
    "head": {
      "title": "เปรียบเทียบ {{FileFormatUp}} โดยใช้ไลบรารี {{ProgLang}}",
      "description": "{{ProdFullName}} นำเสนอซอฟต์แวร์เพื่อสร้างรายงานการตรวจสอบความแตกต่างโดยละเอียดสำหรับแอปพลิเคชัน {{Runtime}}"
    },
    "header": {
      "title": "เปรียบเทียบไฟล์ {{FileFormatUp}} ของคุณใน {{Runtime}}",
      "description": "ไลบรารีการเปรียบเทียบเอกสารที่อิงจาก {{Runtime}} ให้โอกาสในการรวบรวมและแสดงข้อมูลเกี่ยวกับความแตกต่างใด ๆ ในไฟล์ {{FileFormatUp}}เพิ่มประสิทธิภาพการทำงานของโซลูชันของคุณในงานเปรียบเทียบไฟล์ด้วย {{ProdShortName}}",
      "subtitle": "โซลูชันสำหรับการเปรียบเทียบไฟล์",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "สำรวจคุณสมบัติของ {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็น API ที่ช่วยในการเปรียบเทียบรูปภาพและเอกสารในรูปแบบเดียวกันสามารถค้นหาความแตกต่างในย่อหน้าคำตัวอักษรรูปร่างและรูปแบบข้อความระหว่างเอกสารที่เปรียบเทียบคุณสามารถรวมการเปลี่ยนแปลงเหล่านี้และบันทึกเป็นเอกสารสุดท้ายใช้งานได้ดีกับ PDF เอกสาร Word แผ่นงาน Excel สไลด์ PowerPoint ไดอะแกรม Visio อีเมล Outlook HTML ภาพวาด และประเภทภาพต่างๆ ทั้งหมดนี้โดยไม่ต้องใช้เครื่องมือเพิ่มเติม"
    },
    "steps": {
      "title": "วิธีการเปรียบเทียบไฟล์ {{FileFormatUp}} โดยใช้ {{Runtime}}",
      "content": {
        "title": "เป็นไปได้ที่จะใช้ไฟล์ {{FileFormatUp}} โดยใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อรับรายงานเกี่ยวกับความแตกต่างในไฟล์ {{FileFormatUp}} จำนวนมาก",
        "step_1": "ติดตั้ง {{ProdFullName}} โดยใช้ [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์ตัวเปรียบเทียบและให้เส้นทางไปยังไฟล์แรกในรูปแบบ {{FileFormatUp}}",
        "step_3": "เพิ่มไฟล์ {{FileFormatUp}} อีกไฟล์หนึ่งไปยังตัวเปรียบเทียบ",
        "step_4": "รับรายงานที่ชัดเจนซึ่งอธิบายความแตกต่างอย่างแม่นยำ"
      },
      "code": {
        "comments": {
          "comment_1": "ตรวจสอบไฟล์หลายไฟล์เพื่อดูว่าไฟล์มีความคล้ายคลึงกันหรือแตกต่างกันอย่างไร",
          "comment_2": "สร้างวัตถุ Comparer และให้ไฟล์แรกเป็นอินพุต",
          "comment_3": "เพิ่มไฟล์เพิ่มเติม",
          "comment_4": "ดึงรายงานขั้นสุดท้าย"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบประเภทเอกสารยอดนิยมผ่าน {{ProgLang}}",
      "description": "API {{Runtime}} ของเราช่วยให้คุณสามารถเปรียบเทียบเอกสารในรูปแบบต่างๆติดตามการเปลี่ยนแปลงเอกสารได้อย่างง่ายดายโดยการประมวลผลโดยใช้เครื่องมือของเรา"
    }
  },
  "pdf": {
    "head": {
      "title": "ไลบรารี {{ProgLang}} เพื่อตรวจสอบความแตกต่างใน PDF s",
      "description": "ซอฟต์แวร์ {{ProdShortName}} {{Runtime}} สร้างรายงานที่ครอบคลุมโดยรายละเอียดความแตกต่างในเอกสาร PDF"
    },
    "header": {
      "title": "PDF เปรียบเทียบเอกสาร สำหรับ {{EnvName}}",
      "description": "ใช้ API เปรียบเทียบเอกสารของเราใน {{Runtime}} เพื่อตรวจจับและแสดงความแตกต่างใน PDF s ภายในแอปพลิเคชันที่ขับเคลื่อนด้วย {{ProgLang}}รับประโยชน์จากการรับรายงานโดยละเอียดอย่างรวดเร็วและง่ายดาย"
    },
    "about": {
      "title": "สำรวจฟีเจอร์ไลบรารี {{ProdFullName}}",
      "content": "รับรายงานโดยละเอียดเกี่ยวกับความแตกต่างภายในเอกสาร PDF ที่แอปพลิเคชัน .NET ของคุณใช้ {{ProdFullName}} โดยการเพิ่มโค้ดสองบรรทัดโดยไม่ต้องใช้ซอฟต์แวร์เพิ่มเติมหรือไลบรารีภายนอกอื่น ๆควบคุมการเปลี่ยนแปลงใด ๆ ในย่อหน้า คำ อักขระ รูปร่าง และรูปแบบข้อความภายในไฟล์ PDF ของคุณการผสานการเปลี่ยนแปลงจากเอกสารหลายเวอร์ชันเป็นผลลัพธ์ PDF ก็พร้อมใช้งานเช่นกันประมวลผลเอกสารอย่างรวดเร็วและไม่ต้องใช้ความพยายามพิเศษ"
    },
    "steps": {
      "title": "รับรายงานความแตกต่างของ PDF ใน {{ProgLang}}",
      "content": {
        "title": "ติดตามการเปลี่ยนแปลงของเอกสาร PDF ตามรายงานที่ประกอบด้วย [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "ใช้ [{{PackageStoreName}}]({{PackageUrl}}) เพื่อติดตั้ง {{ProdShortName}} สำหรับ {{EnvName}}",
        "step_2": "โทรหาคอนสตรัคเตอร์ Comparer ด้วยเส้นทางไฟล์ PDF",
        "step_3": "ให้อีก PDF เพื่อเปรียบเทียบกับอันแรก",
        "step_4": "ดึงรายงานสุดท้ายเกี่ยวกับความแตกต่างของไฟล์"
      },
      "code": {
        "comments": {
          "comment_1": "รับรายงานเกี่ยวกับการเปลี่ยนแปลงในไฟล์ PDF",
          "comment_2": "สร้างอินสแตนซ์ Comparer ด้วยไฟล์แรก",
          "comment_3": "เพิ่มไฟล์หรือไฟล์อื่น ๆ",
          "comment_4": "บันทึกรายงานไปยังเส้นทางที่ระบุ"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบรูปแบบไฟล์ยอดนิยม เช่น PDF โดยใช้ {{ProgLang}}",
      "description": "ไฟล์ PDF ของคุณสามารถเปรียบเทียบโดย API {{Runtime}} ของเราได้อย่างรวดเร็วควบคุมการเปลี่ยนแปลงเอกสารได้อย่างง่ายดายด้วยรายงานโดยละเอียด"
    }
  },
  "docx": {
    "head": {
      "title": "{{Runtime}} API ช่วยให้สามารถเปรียบเทียบเอกสาร DOCX",
      "description": "MS Word DOCX ความแตกต่างของไฟล์ อาจถูกตรวจสอบโดย {{ProdShortName}} {{Runtime}} API ที่สร้างรายงานที่มีประโยชน์ซึ่งอธิบายการเปลี่ยนแปลงเอกสาร"
    },
    "header": {
      "title": "DOCX เปรียบเทียบไฟล์ กับ {{EnvName}}",
      "description": "ใช้ API การประมวลผลเอกสารใน {{Runtime}} เพื่อตรวจจับและเปิดเผยการเปลี่ยนแปลงใด ๆ ในไฟล์ MS Word DOCX โดยแอปพลิเคชัน {{EnvName}}ใช้ประโยชน์จากการสร้างรายงานที่รวดเร็วและง่ายดาย"
    },
    "about": {
      "title": "เปิดคุณสมบัติ API {{ProdFullName}}",
      "content": "รายงานโดยละเอียดที่นำข้อมูลมากมายเกี่ยวกับการเปลี่ยนแปลงในเอกสาร DOCX เวอร์ชันต่างๆ จัดทำโดย {{ProdShortName}}ใช้ {{EnvName}} พร้อมกับ API ของเราโดยการเพิ่มโค้ดสองบรรทัดและไม่มีไลบรารีอื่นวิเคราะห์การเปลี่ยนแปลงในหน้า ข้อความ รูปแบบข้อความ หรือรูปร่างในเอกสาร MS Wordเลือกเฉพาะข้อมูลที่ถูกต้องและเขียนเอกสาร DOCX สุดท้ายโดยการผสานรวมก้าวหน้าในโซลูชันการประมวลผลเอกสารของคุณด้วยซอฟต์แวร์ของเรา"
    },
    "steps": {
      "title": "จัดทำรายงานด้วยความแตกต่างของเอกสาร DOCX ใน {{ProgLang}}",
      "content": {
        "title": "[{{ProdShortName}}]({{ProductUrl}}) และ {{EnvName}} ช่วยให้เราสามารถเปรียบเทียบเอกสาร DOCX",
        "step_1": "ใช้ [{{PackageStoreName}}]({{PackageUrl}}) เพื่อติดตั้ง {{ProdShortName}} สำหรับ {{EnvName}}",
        "step_2": "การเรียกตัวสร้าง Comparer ต้องการเส้นทาง DOCX",
        "step_3": "ต้องจัดเตรียมไฟล์ DOCX อื่น ๆ",
        "step_4": "เพลิดเพลินกับผลลัพธ์"
      },
      "code": {
        "comments": {
          "comment_1": "รับข้อมูลที่อธิบายการเปลี่ยนแปลง DOCX",
          "comment_2": "จัดเตรียมอินสแตนซ์ Comparer กับไฟล์ MS Word",
          "comment_3": "เพิ่มไฟล์เพิ่มเติม",
          "comment_4": "เก็บผลลัพธ์ไปยังดิสก์ท้องถิ่น"
        }
      }
    },
    "formats": {
      "title": "ใช้ {{ProgLang}} สำหรับการเปรียบเทียบเอกสาร DOCX",
      "description": "ไฟล์ MS Word DOCX ใดก็ได้สามารถเปรียบเทียบกับ {{ProdFullName}}ใช้ข้อมูลที่มีค่าเกี่ยวกับการเปลี่ยนแปลงในเอกสารของคุณ"
    }
  },
  "png": {
    "head": {
      "title": "{{ProgLang}} API สำหรับการเปรียบเทียบ PNG ภาพ",
      "description": "ไลบรารี {{ProdFullName}} แสดงรายงานโดยละเอียดเกี่ยวกับความแตกต่างในรูปภาพในรูปแบบ PNG"
    },
    "header": {
      "title": "PNG เปรียบเทียบภาพ {{Runtime}} แอปพลิเคชันผ่าน Java",
      "description": "ใช้ประโยชน์จากการใช้ {{Runtime}} API เพื่อติดตามการเปลี่ยนแปลงที่ไฟล์ PNG ที่แอปพลิเคชัน {{ProgLang}}รับรายงานโดยละเอียดได้อย่างง่ายดายและรวดเร็ว"
    },
    "about": {
      "title": "เปิดความเป็นไปได้ API {{ProdFullName}}",
      "content": "จัดทำรายงานฉบับเต็มเกี่ยวกับการเปลี่ยนแปลงใด ๆ ในเอกสาร PNG เวอร์ชันต่างๆ โดยแอปพลิเคชัน {{ProgLang}} ของคุณไม่จำเป็นต้องใช้ซอฟต์แวร์ของบุคคลที่สามรับทราบข้อมูลอย่างดีเกี่ยวกับการเปลี่ยนแปลงใด ๆ ในเวอร์ชันของภาพ PNG ของคุณ"
    },
    "steps": {
      "title": "เขียนรายงานความแตกต่างของรูปภาพ PNG ใน {{ProgLang}}",
      "content": {
        "title": "ติดตามการเปลี่ยนแปลงเอกสาร PNG โดยใช้รายงานที่จัดทำโดย [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "ติดตั้งแพคเกจ {{ProdShortName}} ผ่าน [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "ใช้ตัวสร้างคลาส Comparer ที่มีเส้นทางไปยัง PNG",
        "step_3": "เพิ่ม PNG s เพื่อเปรียบเทียบ",
        "step_4": "รับรายงานที่มีข้อมูลเกี่ยวกับความแตกต่าง"
      },
      "code": {
        "comments": {
          "comment_1": "กระบวนการจัดทำรายงานความแตกต่าง PNG",
          "comment_2": "ต้องจัดเตรียมอินสแตนซ์ใหม่ของ Comparer",
          "comment_3": "ไฟล์หรือไฟล์อื่นๆ PNG ด้วย",
          "comment_4": "รับผลลัพธ์ในรูปแบบเดียวกัน"
        }
      }
    },
    "formats": {
      "title": "จับคู่รูปภาพในรูปแบบยอดนิยม เช่น PNG โดยใช้ {{ProgLang}}",
      "description": "ใช้ {{ProdFullName}} เพื่อรับข้อมูลเกี่ยวกับความแตกต่างของรูปภาพ PNGรายงานโดยละเอียดช่วยให้คุณได้รับแจ้งเกี่ยวกับการเปลี่ยนแปลงใด ๆ ในข้อมูลสำคัญ"
    }
  },
  "jpeg": {
    "head": {
      "title": "ไลบรารี {{Runtime}} เพื่อทำการเปรียบเทียบภาพ JPEG โดยอัตโนมัติ",
      "description": "สำรวจคุณสมบัติ API {{ProdFullName}} เพื่อรับข้อมูลเกี่ยวกับความแตกต่างใน JPEG รูปภาพ"
    },
    "header": {
      "title": "ตรวจสอบ JPEG เพื่อดูความแตกต่าง และรับรายงานผ่าน {{EnvName}}",
      "description": "โซลูชัน {{Runtime}} อันทรงพลังในการเปรียบเทียบการเปลี่ยนแปลงที่ JPEG ภาพภายในแอปพลิเคชัน {{ProgLang}}รายงานโดยละเอียดนำมาซึ่งข้อได้เปรียบที่สำคัญต่อโซลูชันทางธุรกิจของคุณ"
    },
    "about": {
      "title": "ค้นพบความสามารถของ {{ProdFullName}}",
      "content": "รับทราบข้อมูลอย่างดีเกี่ยวกับการเปลี่ยนแปลงใด ๆ ในไฟล์รูปภาพ JPEG โดยใช้ซอฟต์แวร์ {{ProdFullName}}วิเคราะห์ข้อมูลที่หลากหลายในรายงานของเราเพื่อประมวลผลไฟล์ JPEG ของคุณโดยใช้แอปพลิเคชัน {{ProgLang}}ไม่มีแพ็คเกจเพิ่มเติมเพิ่มพลังให้กับโซลูชันทางธุรกิจของคุณโดยการเพิ่มโค้ดสองสามบรรทัด"
    },
    "steps": {
      "title": "รวบรวมข้อมูลการปรับเปลี่ยน JPEG ผ่าน {{ProgLang}}",
      "content": {
        "title": "ใช้คุณสมบัติ [{{ProdShortName}}]({{ProductUrl}}) เพื่อควบคุมการเปลี่ยนแปลงที่ JPEG รูปภาพ",
        "step_1": "รับ {{ProdShortName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "เพิ่มวัตถุเปรียบเทียบด้วยเส้นทางไฟล์ JPEG",
        "step_3": "ต้องวิเคราะห์ไฟล์ JPEG อย่างน้อยสองไฟล์",
        "step_4": "รับผลลัพธ์ในรูปแบบ JPEG"
      },
      "code": {
        "comments": {
          "comment_1": "ประมวลผลไฟล์ JPEG เพื่อรับรายงานความแตกต่าง",
          "comment_2": "วัตถุใหม่ของคลาส Comparer",
          "comment_3": "ไฟล์อื่นๆ JPEG",
          "comment_4": "รายงานพร้อมข้อมูลเกี่ยวกับความแตกต่าง JPEG"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบรูปภาพรูปแบบยอดนิยม JPEG ผ่าน {{ProgLang}}",
      "description": "ซอฟต์แวร์ที่ใช้ {{ProdFullName}} เขียนข้อมูลที่มีค่าเกี่ยวกับความแตกต่างระหว่างรูปภาพ JPEGรายงานที่สะดวกช่วยให้สามารถควบคุมการเปลี่ยนแปลงใด ๆ ในไฟล์ธุรกิจ"
    }
  },
  "jpg": {
    "head": {
      "title": "ตรวจสอบความแตกต่างอัตโนมัติสำหรับ JPG รูปภาพโดยไลบรารี {{Runtime}}",
      "description": "ใช้ซอฟต์แวร์ {{ProdFullName}} เพื่อเข้าถึงข้อมูลความแตกต่างโดยละเอียดใน JPG ภาพ"
    },
    "header": {
      "title": "การรับรายงานการเปลี่ยนแปลง JPG ในแอปพลิเคชัน {{EnvName}}",
      "description": "ใช้ประโยชน์จากความสามารถ {{Runtime}} เพื่อเปรียบเทียบการเปลี่ยนแปลงรูปภาพ JPG ภายในแอปพลิเคชัน {{ProgLang}}รายงานโดยละเอียดให้ประโยชน์อย่างมีนัยสำคัญต่อโซลูชันทางธุรกิจ"
    },
    "about": {
      "title": "สำรวจความสามารถของ {{ProdFullName}} API",
      "content": "รับทราบข้อมูลเกี่ยวกับการเปลี่ยนแปลงในไฟล์รูปภาพ JPG ด้วยซอฟต์แวร์ {{ProdFullName}}วิเคราะห์ข้อมูลที่หลากหลายในรายงานของเราเพื่อประมวลผลไฟล์ JPG ภายในแอปพลิเคชัน {{ProgLang}} โดยไม่ต้องใช้แพ็คเกจเพิ่มเติมปรับปรุงโซลูชันทางธุรกิจด้วยโค้ดเพียงไม่กี่บรรทัด"
    },
    "steps": {
      "title": "รวบรวมข้อมูลการเปลี่ยนแปลง JPG โดยใช้ {{ProgLang}}",
      "content": {
        "title": "ใช้คุณสมบัติ [{{ProdShortName}}]({{ProductUrl}}) เพื่อจัดการการเปลี่ยนแปลงรูปภาพ JPG",
        "step_1": "รับ {{ProdShortName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "รวมวัตถุเปรียบเทียบกับเส้นทางไฟล์ JPG",
        "step_3": "วิเคราะห์ไฟล์ JPG อย่างน้อยสองไฟล์",
        "step_4": "ดึงผลลัพธ์ในรูปแบบ JPG"
      },
      "code": {
        "comments": {
          "comment_1": "ประมวลผลไฟล์ JPG เพื่อสร้างรายงานความแตกต่าง",
          "comment_2": "สร้างวัตถุใหม่ทันทีของคลาส Comparer",
          "comment_3": "รวมไฟล์ JPG อื่น ๆ สำหรับการเปรียบเทียบ",
          "comment_4": "สร้างรายงานที่มีข้อมูลเกี่ยวกับความแตกต่าง JPG"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบรูปภาพรูปแบบยอดนิยม JPG โดยใช้ {{ProgLang}}",
      "description": "ห้องสมุดที่ใช้ {{ProdFullName}} ให้ข้อมูลเชิงลึกที่มีค่าเกี่ยวกับความแตกต่างระหว่างรูปภาพ JPGรายงานที่สะดวกช่วยให้ตรวจสอบการเปลี่ยนแปลงในไฟล์ธุรกิจ"
    }
  },
  "xlsx": {
    "head": {
      "title": "เปรียบเทียบเนื้อหาสเปรดชีต XLSX โดย {{Runtime}} API",
      "description": "MS Excel ความแตกต่างของสเปรดชีตสามารถตรวจสอบได้โดย API {{Runtime}} ของเรา ซึ่งสร้างรายงานที่ให้ข้อมูลโดยมีรายละเอียดความแตกต่างประเภทต่างๆ"
    },
    "header": {
      "title": "XLSX เปรียบเทียบสเปรดชีตโดยใช้ {{EnvName}}",
      "description": "ใช้ไลบรารีการประมวลผลเอกสารใน {{Runtime}} เพื่อระบุและเปิดเผยการเปลี่ยนแปลงในไฟล์ MS Excel XLSX ภายในแอปพลิเคชัน {{EnvName}}รับประโยชน์จากการสร้างรายงานที่รวดเร็วและง่ายดาย"
    },
    "about": {
      "title": "สำรวจข้อดีของ {{ProdShortName}}",
      "content": "เข้าถึงรายงานโดยละเอียดที่มีข้อมูลมากมายเกี่ยวกับการเปลี่ยนแปลงในเอกสาร XLSX เวอร์ชันต่างๆ ที่จัดทำโดย {{ProdShortName}}รวมแอปพลิเคชัน {{EnvName}} กับ API ของเราโดยใช้โค้ดเพียงไม่กี่บรรทัดโดยไม่ต้องใช้ความพยายามเพิ่มเติมวิเคราะห์การเปลี่ยนแปลงในหน้า ข้อความ รูปแบบข้อความ หรือรูปร่างภายในเอกสาร MS Excelเลือกข้อมูลที่เหมาะสมและรวมข้อมูลลงในเอกสาร XLSX สุดท้ายพัฒนาโครงการธุรกิจของคุณด้วยโซลูชันของเรา"
    },
    "steps": {
      "title": "จัดทำรายงานด้วยความแตกต่างของเอกสาร XLSX ใน {{ProgLang}}",
      "content": {
        "title": "ใช้ [{{ProdShortName}}]({{ProductUrl}}) และ {{EnvName}} สำหรับการเปรียบเทียบเอกสาร XLSX",
        "step_1": "ติดตั้ง {{ProdShortName}} สำหรับ {{EnvName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "ระบุเส้นทาง XLSX เมื่อเรียกตัวสร้าง Comparer",
        "step_3": "รวมไฟล์ XLSX เพิ่มเติม",
        "step_4": "เพลิดเพลินกับผลลัพธ์ที่สร้าง"
      },
      "code": {
        "comments": {
          "comment_1": "ดึงข้อมูลที่อธิบายการเปลี่ยนแปลงในเอกสาร XLSX",
          "comment_2": "สร้างตัวเปรียบเทียบด้วยไฟล์ MS Excel",
          "comment_3": "เพิ่มไฟล์เพิ่มเติมสำหรับการเปรียบเทียบ",
          "comment_4": "บันทึกผลลัพธ์ลงในดิสก์ท้องถิ่น"
        }
      }
    },
    "formats": {
      "title": "ใช้ {{ProgLang}} สำหรับการเปรียบเทียบ XLSX สเปรดชีต",
      "description": "เปรียบเทียบสเปรดชีต MS Excel XLSX ได้อย่างง่ายดายโดยใช้ {{ProdFullName}}รับข้อมูลเชิงลึกที่มีคุณค่าเกี่ยวกับการเปลี่ยนแปลงภายในข้อมูลธุรกิจของคุณ"
    }
  },
  "pptx": {
    "head": {
      "title": "ตรวจสอบความแตกต่างของ PPTX โดย {{EnvName}}",
      "description": "PPTX สามารถวิเคราะห์ได้ด้วยโซลูชัน {{ProdShortName}} {{EnvName}} ซึ่งประกอบรายงานของแท้ที่อธิบายความแตกต่างของเนื้อหา"
    },
    "header": {
      "title": "เปรียบเทียบการนำเสนอ PPTX กับ {{EnvName}}",
      "description": "ใช้ API การประมวลผลเอกสารใน {{Runtime}} เพื่อระบุและเน้นการเปลี่ยนแปลงในไฟล์ MS PowerPoint PPTX โดยใช้แอปพลิเคชันที่ใช้ {{EnvName}}ปรับปรุงกระบวนการทางธุรกิจของคุณด้วยการวิเคราะห์ข้อมูลที่รวดเร็วและง่ายดาย"
    },
    "about": {
      "title": "สำรวจฟีเจอร์ {{ProdFullName}}",
      "content": "ใช้ข้อมูลโดยละเอียดจากรายงาน {{ProdShortName}} ของเราตามข้อมูลเกี่ยวกับการเปลี่ยนแปลงในไฟล์ PPTX หลายรุ่นนำโซลูชันของเราไปใช้แอปพลิเคชัน {{EnvName}} โดยใช้โค้ดเพียงไม่กี่บรรทัดโดยไม่ต้องใช้ความพยายามเป็นพิเศษวิเคราะห์ข้อมูลเกี่ยวกับหน้า ข้อความ สไตล์ หรือรูปร่างในงานนำเสนอ MS PowerPointผสานการเปลี่ยนแปลงที่เหมาะสมกับการนำเสนอ PPTX ผลลัพธ์เดียวใช้ประโยชน์จากโซลูชันของเราสำหรับโครงการธุรกิจของคุณ"
    },
    "steps": {
      "title": "ใช้รายงานความแตกต่างของเอกสาร PPTX ด้วย {{ProgLang}}",
      "content": {
        "title": "[{{ProdShortName}}]({{ProductUrl}}) สำหรับการเปรียบเทียบการนำเสนอ PPTX",
        "step_1": "รับ {{ProdShortName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "การโทรหาผู้ก่อสร้าง Comparer",
        "step_3": "เพิ่มการนำเสนอ PPTX เพิ่มเติม",
        "step_4": "รับผลลัพธ์"
      },
      "code": {
        "comments": {
          "comment_1": "รับข้อมูลเกี่ยวกับการเปลี่ยนแปลงในงานนำเสนอ PPTX",
          "comment_2": "ให้เส้นทางไปยังไฟล์ PPTX ให้กับตัวเปรียบเทียบ",
          "comment_3": "เพิ่มงานนำเสนอหรืองานนำเสนออื่น ๆ",
          "comment_4": "บันทึกผลลัพธ์ไปยังที่เก็บข้อมูลท้องถิ่น"
        }
      }
    },
    "formats": {
      "title": "ทำการเปรียบเทียบการนำเสนอ PPTX โดยใช้ {{ProgLang}}",
      "description": "เปรียบเทียบเอกสารใด ๆ ในรูปแบบยอดนิยม รวมถึงการนำเสนอ MS PowerPoint PPTX โดย {{ProdFullName}}เสริมสร้างข้อมูลธุรกิจของคุณเพื่อรับรายงานเกี่ยวกับความแตกต่างในการนำเสนอ PPTX"
    }
  }
}