{
  "common": {
    "head": {
      "title": "Utilize the Comparison API to compare {{FileFormatUp}} documents using Java.",
      "description": "{{ProdFullName}} provides an API to obtain detailed document comparison reports in various Java applications, including J2EE and J2SE."
    },
    "header": {
      "title": "{{FileFormatUp}} document comparison in Java applications",
      "description": "{{ProdShortName}} API for getting and displaying differences in {{FileFormatUp}} documents using applications based on Java, J2EE, and J2SE. Easily obtain detailed reports for a brilliant experience.",
      "subtitle": "Documents comparing framework",
      "action_title": "Free {{PackageStoreName}} download"
    },
    "about": {
      "title": "Explore the capabilities of {{ProdFullName}} API",
      "content": "{{ProdFullName}} is an intrinsic Java API crafted for comparing multiple images and documents sharing the same format. It assists in identifying variations within paragraphs, words, characters, shapes, and even text styles among the compared documents. With the capability to merge these alterations and export to a final document, it facilitates the comparison and merging of PDFs, Word documents, Excel spreadsheets, PowerPoint presentations, Visio diagrams, Outlook emails, HTML, drawings, and various image file formats—eliminating the necessity for any external libraries."
    },
    "steps": {
      "title": "How to compare several {{FileFormatUp}} documents using Java",
      "content": {
        "title": "Use [{{ProdShortName}}]({{ProductUrl}}) to compare multiple {{FileFormatUp}} files and generate a report detailing their differences",
        "step_1": "Use your preferred package manager to install {{ProdFullName}} from [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Create an instance of the Comparer class setting path to one of {{FileFormatUp}} files",
        "step_3": "Add at least one additional {{FileFormatUp}} to the Comparer instance",
        "step_4": "Receive a detailed final report outlining the exact differences"
      },
      "code": {
        "comments": {
          "comment_1": "Check files from your hard drive for differences or similarities",
          "comment_2": "Create a Comparer object by specifying the initial file",
          "comment_3": "Include additional files to comparing",
          "comment_4": "Get the report with the specified name as the result"
        }
      }
    },
    "formats": {
      "title": "Compare various documents using {{ProgLang}}",
      "description": "Our Java API allows you to compare documents of various formats. Stay updated on document changes by processing them effortlessly."
    }
  },
  "pdf": {
    "head": {
      "title": "Use the Comparison API along with Java to compare PDF documents.",
      "description": "The {{ProdShortName}} Java API creates detailed reports for PDF documents in applications that support J2EE and J2SE."
    },
    "header": {
      "title": "Comparing PDF documents using Java applications",
      "description": "The {{ProdShortName}} Java API provides detailed comparison reports for PDF documents in various kinds of applications that use J2EE or J2SE.",
      "subtitle": "An API that compares documents",
      "action_title": "Free download from {{PackageStoreName}}"
    },
    "about": {
      "title": "Find out {{ProdFullName}} API advantages",
      "content": "Get detailed reports about differences at documents of popular formats at your .NET applications. Use {{ProdFullName}} APIs by adding a couple lines of code. Developers can easily display {{FileFormatUp}}, Word Processing, Excel Spreadsheet, Presentation, Visio, Project, Outlook and many other popular document formats in HTML5, image or PDF modes. The document rendering is fast, identical to the original source file, and it does not require installing additional software or any other external libraries."
    },
    "steps": {
      "title": "Comparing multiple PDF docs via Java",
      "content": {
        "title": "Compare PDFs with [{{ProdShortName}}]({{ProductUrl}}) and get reports about documents distinctions",
        "step_1": "Download {{ProdFullName}} package from [{{PackageStoreName}}]({{PackageUrl}}) and install it",
        "step_2": "New Comparer instance must has path to one of PDF files",
        "step_3": "At least one PDF document must be provided for comparison",
        "step_4": "Result report is saved to provided path"
      },
      "code": {
        "comments": {
          "comment_1": "Getting report about changes at PDFs",
          "comment_2": "Pass first file path to Comparer constructor",
          "comment_3": "Provide another PDF doc",
          "comment_4": "Save distinctions report for future analyzing"
        }
      }
    },
    "formats": {
      "title": "Find any changes at PDF files via Java",
      "description": "Our Java API provides possibility to control PDF files versions by generating precise and detailed report in your favorite format."
    }
  }
}