{
  "common": {
    "head": {
      "title": "{{EnvName}} {{FileFormatUp}} API مقایسه - {{FileFormatUp}} فایل ها را برای تفاوت ها بررسی کنید",
      "description": "مقایسه و ادغام {{FileFormatUp}} فایل ها در برنامه های {{EnvName}}، J2EE، J2SE. خلاصه تفاوت ها را در محتوا، متن و سبک تجزیه و تحلیل کنید."
    },
    "header": {
      "title": "مقایسه {{FileFormatUp}} فایل ها در {{EnvName}}",
      "description": "مقایسه محتوا را بین بیش از دو {{FileFormatUp}} فایل در {{EnvName}} انجام دهید. لیستی از تفاوت ها را بازیابی کنید و فایل های مقایسه شده را در یک سند واحد ذخیره کنید.",
      "subtitle": "چارچوب بررسی تفاوت اسناد",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "قابلیت های کتابخانه {{ProdFullName}} را کشف کنید",
      "content": "{{ProdFullName}} یک نرم افزار ذاتی {{EnvName}} است که برای مقایسه چندین تصویر و اسناد با فرمت یکسان ساخته شده است. این به شناسایی تغییرات در پاراگراف ها، کلمات، کاراکترها، اشکال و حتی سبک های متن در بین اسناد مقایسه شده کمک می کند. با قابلیت ادغام این تغییرات و صادرات به یک سند نهایی، مقایسه و ادغام PDF s، Word سند، Excel صفحه گسترده، PowerPoint ارائه، Visio نمودار، Outlook ایمیل، HTML، نقشه ها و قالب های مختلف فایل تصویری را تسهیل می کند و ضرورت کتابخانه های خارجی را حذف می کند."
    },
    "steps": {
      "title": "نحوه مقایسه چندین {{FileFormatUp}} سند با استفاده از {{EnvName}}",
      "content": {
        "title": "از [{{ProdShortName}}]({{ProductUrl}}) برای مقایسه چندین فایل {{FileFormatUp}} استفاده کنید و گزارشی با جزئیات تفاوت آنها ایجاد کنید",
        "step_1": "از مدیر بسته مورد نظر خود برای نصب {{ProdFullName}} از [{{PackageStoreName}}]({{PackageUrl}}) استفاده کنید",
        "step_2": "یک نمونه از مسیر تنظیم کلاس Comparer به یکی از {{FileFormatUp}} فایل ایجاد کنید",
        "step_3": "حداقل یک {{FileFormatUp}} اضافی را به نمونه Comparer اضافه کنید",
        "step_4": "دریافت یک گزارش نهایی دقیق که تفاوت های دقیق را مشخص می کند"
      },
      "code": {
        "comments": {
          "comment_1": "فایل ها را از هارد دیسک خود برای تفاوت یا شباهت ها بررسی کنید",
          "comment_2": "ایجاد یک شی Comparer با مشخص کردن فایل اولیه",
          "comment_3": "اضافه کردن فایل های اضافی برای مقایسه",
          "comment_4": "گزارش را با نام مشخص شده به عنوان نتیجه دریافت کنید"
        }
      }
    },
    "formats": {
      "title": "مقایسه اسناد مختلف با استفاده از {{ProgLang}}",
      "description": "راه حل های {{EnvName}} ما به شما امکان می دهد اسناد با فرمت های مختلف را مقایسه کنید. با پردازش آنها بدون زحمت، در مورد تغییرات اسناد به روز باشید."
    }
  },
  "pdf": {
    "head": {
      "title": "از کتابخانه مقایسه {{EnvName}} برای بررسی اختلافات PDF استفاده کنید.",
      "description": "API {{ProdShortName}} {{EnvName}} گزارش های مفصلی برای PDF اسناد در برنامه هایی که از J2EE و J2SE پشتیبانی می کنند ایجاد می کند."
    },
    "header": {
      "title": "مقایسه PDF اسناد با استفاده از {{EnvName}} برنامه",
      "description": "کتابخانه {{ProdShortName}} {{EnvName}} گزارش های مقایسه مفصلی برای PDF اسناد در انواع مختلف برنامه های کاربردی که از J2EE یا J2SE استفاده می کنند ارائه می دهد."
    },
    "about": {
      "title": "مزایای {{ProdFullName}} API را بیابید",
      "content": "API اصلی {{ProdFullName}} برای تهیه گزارشات پر از داده های مفید در مورد تفاوت های داخل PDF اسناد ساخته شده است. نه تنها تفاوت در متن در پاراگراف ها یا کلمات بلکه تغییرات در اشکال و سبک های متن نیز در گزارش نهایی نشان داده می شود. ادغام این تغییرات و صادرات به یک سند نهایی نیز موجود است. در واقع، نیازی به کتابخانه های خارجی نیست. فقط چند خط کد دسترسی به قابلیت های غنی را فراهم می کند."
    },
    "steps": {
      "title": "مقایسه چندین PDF سند از طریق {{EnvName}}",
      "content": {
        "title": "PDF s را با [{{ProdShortName}}]({{ProductUrl}}) مقایسه کنید و گزارش در مورد تمایز اسناد دریافت کنید",
        "step_1": "بسته {{ProdFullName}} را از [{{PackageStoreName}}]({{PackageUrl}}) دانلود کنید و آن را نصب کنید",
        "step_2": "نمونه Comparer جدید باید مسیر یکی از PDF فایل ها داشته باشد",
        "step_3": "حداقل یک سند PDF باید برای مقایسه ارائه شود",
        "step_4": "گزارش نتیجه در مسیر ارائه شده ذخیره می شود"
      },
      "code": {
        "comments": {
          "comment_1": "دریافت گزارش در مورد تغییرات در PDF s",
          "comment_2": "اولین مسیر فایل را به سازنده Comparer منتقل کنید",
          "comment_3": "یک سند PDF دیگر ارائه دهید",
          "comment_4": "گزارش تمایز را برای تجزیه و تحلیل آینده ذخیره کنید"
        }
      }
    },
    "formats": {
      "title": "هر گونه تغییر را در PDF فایل ها از طریق {{EnvName}} پیدا کنید",
      "description": "نرم افزار {{EnvName}} ما امکان کنترل نسخه های PDF فایل را با تولید گزارش دقیق و دقیق در قالب مورد علاقه شما فراهم می کند."
    }
  },
  "docx": {
    "head": {
      "title": "راه حل برای بررسی تفاوت های اسناد DOCX.",
      "description": "فرصت های ارائه شده توسط {{ProdShortName}} API به ما امکان می دهد گزارشات حاوی اطلاعات مربوط به تمایز در DOCX اسناد را بازیابی کنیم."
    },
    "header": {
      "title": "{{EnvName}} برنامه های کاربردی برای جستجوی تمایز در DOCX اسناد",
      "description": "کتابخانه {{EnvName}} ارائه شده توسط {{ProdShortName}} هر DOCX سند را در برنامه های کاربردی پشتیبانی از Java، J2EE یا J2SE مقایسه می کند."
    },
    "about": {
      "title": "مزایای {{ProdFullName}} API را کشف کنید",
      "content": "DOCX مقایسه اسناد پشتیبانی می شود که توسط {{ProdFullName}} API پشتیبانی می شود که گزارش هایی حاوی داده های مربوط به تمایزهای مختلف را تشکیل می دهد. متن در پاراگراف ها، اشکال و سبک ها و سایر داده ها در حال تجزیه و تحلیل است. علاوه بر این، می توان یکی از DOCX تغییرات ادغام شده از فایل های اولیه ایجاد کرد. نیازی به کتابخانه های خارجی نیست. پروژههای {{EnvName}} خود را با اضافه کردن چند خط کد بهبود ببخشید."
    },
    "steps": {
      "title": "از {{EnvName}} برای مقایسه چندین DOCX فایل استفاده کنید",
      "content": {
        "title": "از [{{ProdShortName}}]({{ProductUrl}}) برای مقایسه MS Word اسناد استفاده کنید",
        "step_1": "راه حل ما را از [{{PackageStoreName}}]({{PackageUrl}}) نصب کنید",
        "step_2": "مقایسه کننده باید با اولین سند DOCX به عنوان پارامتر ایجاد شود",
        "step_3": "هر مقایسه نیاز به بیش از یک DOCX سند دارد",
        "step_4": "گزارش حاصل داده های مفیدی را ارائه می دهد"
      },
      "code": {
        "comments": {
          "comment_1": "در مورد تغییرات در MS Word اسناد مطلع باشید",
          "comment_2": "عبور از مسیر DOCX به مقایسه",
          "comment_3": "افزودن یک سند DOCX دیگر",
          "comment_4": "دریافت گزارش جامع برای تجزیه و تحلیل آینده"
        }
      }
    },
    "formats": {
      "title": "کنترل هرگونه تغییر در فایل های DOCX با استفاده از {{EnvName}}",
      "description": "{{ProdShortName}} {{EnvName}} API به کاربران اجازه می دهد تا نسخه DOCX اسناد را از طریق گزارش های دقیق و دقیق که به راحتی پردازش می شوند کنترل کنند."
    }
  },
  "png": {
    "head": {
      "title": "گزارش های اختلاف برای PNG عکس را با استفاده از {{EnvName}} دریافت کنید.",
      "description": "API {{ProdFullName}} گزارش های مقایسه مفید برای PNG اسناد در برنامه هایی که از J2EE و J2SE پشتیبانی می کنند تولید می کند."
    },
    "header": {
      "title": "مقایسه PNG تصاویر با استفاده از {{EnvName}}",
      "description": "برنامه های Java، J2EE یا J2SE خود را با {{ProdShortName}} API تقویت کنید. اطلاعات دقیق در مورد هرگونه تغییر در PNG تصاویر خود را بازیابی کنید."
    },
    "about": {
      "title": "از ویژگی های {{ProdFullName}} API مطلع شوید",
      "content": "{{ProdShortName}} به عنوان یک API بومی {{EnvName}} مناسب برای تهیه گزارش های دقیق بر اساس تغییرات بین نسخه های مختلف تصاویر ارائه شده در قالب PNG توسعه یافته است. نه تنها فرمت PNG پشتیبانی می شود. بسیاری از ویژگی های مفید ارائه شده توسط API ما."
    },
    "steps": {
      "title": "از {{ProgLang}} برای مقایسه فایل های PNG استفاده کنید",
      "content": {
        "title": "PNG فایل ها را با [{{ProdShortName}}]({{ProductUrl}}) مقایسه کنید و گزارش مربوطه را در مورد تغییرات آنها بازیابی کنید",
        "step_1": "بسته {{ProdFullName}} را نصب کنید که آن را از [{{PackageStoreName}}]({{PackageUrl}}) دانلود کنید",
        "step_2": "ارائه نمونه Comparer و مسیر عبور به PNG",
        "step_3": "افزودن PNG فایل برای مقایسه بیشتر",
        "step_4": "ذخیره گزارش به دیسک محلی"
      },
      "code": {
        "comments": {
          "comment_1": "دریافت گزارش با اطلاعات مربوط به تمایز بین PNG",
          "comment_2": "شیء Comparer را با مسیر فایل اصلی دریافت کنید",
          "comment_3": "افزودن PNG تصاویر برای مقایسه",
          "comment_4": "ذخیره گزارش در مکان مورد نظر"
        }
      }
    },
    "formats": {
      "title": "تمایزها را در نسخه های مختلف PNG تصاویر از طریق {{ProgLang}} پیدا کنید",
      "description": "{{ProdFullName}} API تغییرات درون PNG تصاویر را ردیابی می کند و گزارش های نمایشی را برای تجزیه و تحلیل بیشتر تهیه می کند."
    }
  },
  "jpeg": {
    "head": {
      "title": "JPEG s را با گزارش های مقایسه از طریق {{ProgLang}} تجزیه و تحلیل کنید.",
      "description": "API قدرتمند {{ProdFullName}} برای تولید گزارش های تمایز مفید برای JPEG تصاویر توسعه یافته است. J2EE و J2SE پشتیبانی می شوند."
    },
    "header": {
      "title": "JPEG تصاویر را با کتابخانه {{EnvName}} ما مقایسه کنید",
      "description": "برنامه های Java، J2EE یا J2SE با پشتیبانی از {{ProdShortName}} API امکان بازیابی گزارش های دقیق در مورد تمایز در JPEG تصاویر را بدون زحمت می دهند."
    },
    "about": {
      "title": "نگاهی به {{ProdFullName}} API بیندازید",
      "content": "API بومی {{EnvName}} به نام {{ProdShortName}} گزارش های مفصلی در مورد تغییرات بین نسخه های تصاویر ذخیره شده در قالب JPEG تهیه می کند. بسیاری از فرمت های تصویر محبوب نیز پشتیبانی می شوند. بسیاری از فرمت های تصویر توسط API ما پشتیبانی می شوند."
    },
    "steps": {
      "title": "از {{ProgLang}} برای مقایسه JPEG تصاویر استفاده کنید",
      "content": {
        "title": "اطلاعات مفید در مورد JPEG تفاوت تصاویر را از طریق [{{ProdShortName}}]({{ProductUrl}}) بازیابی کنید",
        "step_1": "بسته {{ProdFullName}} را از [{{PackageStoreName}}]({{PackageUrl}}) به پروژه خود درگیر کنید",
        "step_2": "مقایسه نمونه‌ای با مسیر به تصویر JPEG",
        "step_3": "افزودن JPEG فایل به مقایسه",
        "step_4": "دریافت گزارش حاصل"
      },
      "code": {
        "comments": {
          "comment_1": "داده های تمایز را برای JPEG ترکیب کنید",
          "comment_2": "شیء مقایسه کننده به مسیر اصلی فایل JPEG نیاز دارد",
          "comment_3": "سایر تصاویر JPEG باید اشاره شود",
          "comment_4": "فایل نتیجه شامل گزارش است"
        }
      }
    },
    "formats": {
      "title": "کنترل تغییرات در نسخه های مختلف JPEG تصاویر توسط {{ProgLang}}",
      "description": "هرگونه تغییر در JPEG تصاویر ممکن است توسط {{ProdFullName}} تشخیص داده شود. گزارش های دقیق را به فرآیندهای کسب و کار خود درج کنید."
    }
  },
  "jpg": {
    "head": {
      "title": "JPG تصاویر را با {{ProdFullName}} تجزیه و تحلیل کنید.",
      "description": "{{ProdFullName}} API گزارش های مفید برای JPG تصاویر تولید می کند. پشتیبانی از Java، J2EE و J2SE."
    },
    "header": {
      "title": "تغییرات در JPG فایل را از طریق راه حل {{EnvName}} ما تجزیه و تحلیل کنید",
      "description": "برنامه های {{EnvName}}، J2EE یا J2SE با استفاده از {{ProdShortName}} API قادر به تولید گزارش های دقیق JPG هستند."
    },
    "about": {
      "title": "کاوش در {{ProdFullName}} API",
      "content": "راه حل بومی {{EnvName}}، {{ProdShortName}}، گزارش های مفصلی در مورد JPG تغییرات ایجاد می کند. پشتیبانی از فرمت های تصویر محبوب برای مقایسه و پردازش بیشتر."
    },
    "steps": {
      "title": "مقایسه فایل های JPG با استفاده از {{ProgLang}}",
      "content": {
        "title": "بازیابی JPG داده های تفاوت با [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "قابلیت محصول خود را با افزودن {{ProdFullName}} از [{{PackageStoreName}}]({{PackageUrl}}) افزایش دهید",
        "step_2": "ایجاد نمونه Comparer با مسیر JPG",
        "step_3": "اضافه کردن تصاویر JPG دیگر به پردازش",
        "step_4": "گزارش حاصل را بدست آورید"
      },
      "code": {
        "comments": {
          "comment_1": "ایجاد داده های تمایز برای JPG",
          "comment_2": "شیء مقایسه کننده به مسیر اصلی فایل JPG نیاز دارد",
          "comment_3": "به تصاویر JPG دیگر اشاره کنید",
          "comment_4": "فایل نتیجه شامل گزارش است"
        }
      }
    },
    "formats": {
      "title": "ردیابی هرگونه تغییر در نسخه های مختلف JPG تصاویر با استفاده از {{ProgLang}}",
      "description": "تغییرات در JPG تصاویر را با {{ProdFullName}} تشخیص دهید. فرآیندهای کسب و کار را با گزارش های دقیق ارتقا دهید."
    }
  },
  "xlsx": {
    "head": {
      "title": "{{ProdFullName}} برای مقایسه XLSX.",
      "description": "{{ProdShortName}} API بازیابی گزارش هایی را با جزئیات واریانس در XLSX اسناد ارائه می دهد. سازگار با محیط های Java، J2EE و J2SE."
    },
    "header": {
      "title": "{{EnvName}} برنامه های کاربردی برای تشخیص تغییرات در صفحات گسترده XLSX",
      "description": "API {{ProdShortName}} {{EnvName}} مقایسه صفحات گسترده XLSX را در برنامه های Java، J2EE یا J2SE امکان پذیر می کند."
    },
    "about": {
      "title": "مزایای API {{ProdFullName}} را کشف کنید",
      "content": "API {{ProdFullName}} مقایسه صفحات گسترده XLSX را آسان تر می کند و گزارش هایی را در مورد تفاوت های یافت شده در متن، پاراگراف ها، اشکال، سبک ها و سایر عناصر تولید می کند. علاوه بر این، از ادغام تغییرات از چندین فایل اصلی بدون نیاز به کتابخانه های خارجی پشتیبانی می کند. پروژه های {{EnvName}} خود را با حداقل ادغام کد تقویت کنید."
    },
    "steps": {
      "title": "از {{EnvName}} برای مقایسه چندین فایل XLSX استفاده کنید",
      "content": {
        "title": "از [{{ProdShortName}}]({{ProductUrl}}) برای تجزیه و تحلیل صفحات گسترده MS Excel استفاده کنید",
        "step_1": "نصب بسته از [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "مقایسه را با صفحه گسترده اول XLSX به عنوان پارامتر نمونه سازی کنید",
        "step_3": "اضافه کردن صفحات گسترده XLSX اضافی برای مقایسه",
        "step_4": "از گزارش جامع لذت ببرید"
      },
      "code": {
        "comments": {
          "comment_1": "از تغییرات در MS Excel اسناد مطلع باشید",
          "comment_2": "مسیر XLSX را به مقایسه کننده ارائه دهید",
          "comment_3": "اضافه کردن صفحات گسترده XLSX اضافی",
          "comment_4": "دسترسی به گزارش های دقیق برای تجزیه و تحلیل آینده"
        }
      }
    },
    "formats": {
      "title": "مدیریت تغییرات در صفحات گسترده XLSX با استفاده از {{EnvName}}",
      "description": "کتابخانه {{ProdShortName}} {{EnvName}} کاربران را قادر می سازد تا نسخه های مختلف صفحات گسترده XLSX را از طریق گزارش های دقیق و دقیق که به راحتی تشکیل می شوند، نظارت کنند."
    }
  },
  "pptx": {
    "head": {
      "title": "کتابخانه به طور خاص برای مقایسه PPTX طراحی شده است.",
      "description": "{{ProdShortName}} قابلیت هایی را برای بازیابی گزارش هایی با جزئیات واریانس در PPTX ارائه فراهم می کند. Java، J2EE یا J2SE پشتیبانی می شود."
    },
    "header": {
      "title": "{{EnvName}} برنامه های تحت اختیار {{ProdShortName}} مقایسه PPTX",
      "description": "ارائه های مایکروسافت PowerPoint PPTX ممکن است با {{ProdFullName}} با استفاده از برنامه های Java، J2EE یا J2SE مقایسه شوند."
    },
    "about": {
      "title": "ویژگی های {{ProdFullName}} را کشف کنید",
      "content": "API {{ProdFullName}} گزارش های مقایسه ای در مورد تفاوت در PPTX ارائه را پیاده سازی می کند. گزارش های نتیجه نه تنها شامل تفاوت متن بلکه در اشکال، سبک ها و سایر عناصر است. ادغام بسیاری از ارائه ها در یک جلسه فقط مورد نظر. هیچ کتابخانه خارجی شخص ثالث مورد نیاز نیست. با اضافه کردن حداقل مقدار کد، {{EnvName}} پروژه را توانمند کنید."
    },
    "steps": {
      "title": "از {{EnvName}} برای مقایسه چندین فایل PPTX استفاده کنید",
      "content": {
        "title": "از [{{ProdShortName}}]({{ProductUrl}}) برای تجزیه و تحلیل MS PowerPoint ارائه استفاده کنید",
        "step_1": "نصب بسته از [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "مقایسه کننده جدید همراه با PPTX مسیر ارائه دهید",
        "step_3": "افزودن PPTX ارائه برای مقایسه",
        "step_4": "دریافت گزارش دقیق"
      },
      "code": {
        "comments": {
          "comment_1": "درباره تفاوت در ارائه MS PPTX آشنا شوید",
          "comment_2": "مسیر فایل را ارائه دهید",
          "comment_3": "اضافه کردن ارائه PPTX اضافی",
          "comment_4": "ذخیره گزارش برای تجزیه و تحلیل آینده"
        }
      }
    },
    "formats": {
      "title": "تجزیه و تحلیل PPTX فایل با استفاده از {{EnvName}}",
      "description": "نرم افزار {{ProdFullName}} امکان تشخیص تفاوت ها در MS PowerPoint PPTX ارائه ها را فراهم می کند و گزارش های دقیق و دقیق را بدون تلاش اضافی تولید می کند."
    }
  }
}