{
  "common": {
    "head": {
      "title": "{{EnvName}} {{FileFormatUp}} API เปรียบเทียบ - ตรวจสอบไฟล์ {{FileFormatUp}} เพื่อหาความแตกต่าง",
      "description": "เปรียบเทียบและรวมไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{EnvName}}, J2EE, J2SEวิเคราะห์สรุปความแตกต่างในเนื้อหาข้อความ และสไตล์"
    },
    "header": {
      "title": "เปรียบเทียบไฟล์ {{FileFormatUp}} ใน {{EnvName}}",
      "description": "ทำการเปรียบเทียบเนื้อหาระหว่างไฟล์ {{FileFormatUp}} มากกว่าสองไฟล์ใน {{EnvName}}ดึงรายการความแตกต่างและบันทึกไฟล์ที่เปรียบเทียบลงในเอกสารเดียว",
      "subtitle": "กรอบการตรวจสอบความแตกต่างของเอกสาร",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "สำรวจความสามารถของไลบรารี {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็นซอฟต์แวร์ {{EnvName}} ที่สร้างขึ้นเพื่อเปรียบเทียบภาพและเอกสารหลายรูปภาพที่ใช้รูปแบบเดียวกันช่วยในการระบุรูปแบบภายในย่อหน้าคำตัวอักษรรูปร่างและแม้แต่รูปแบบข้อความในเอกสารที่เปรียบเทียบด้วยความสามารถในการรวมการเปลี่ยนแปลงเหล่านี้และส่งออกไปยังเอกสารสุดท้าย ช่วยให้สามารถเปรียบเทียบและรวมเอกสาร PDF, Word, สเปรดชีต Excel, งานนำเสนอ PowerPoint, ไดอะแกรม Visio, อีเมล Outlook, HTML, ภาพวาด และรูปแบบไฟล์รูปภาพต่างๆ ซึ่งช่วยลดความจำเป็นสำหรับไลบรารีภายนอกใด ๆ"
    },
    "steps": {
      "title": "วิธีเปรียบเทียบเอกสาร {{FileFormatUp}} หลายฉบับโดยใช้ {{EnvName}}",
      "content": {
        "title": "ใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อเปรียบเทียบไฟล์ {{FileFormatUp}} หลายไฟล์ และสร้างรายงานโดยรายละเอียดความแตกต่าง",
        "step_1": "ใช้ตัวจัดการแพ็คเกจที่คุณต้องการเพื่อติดตั้ง {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์ของเส้นทางการตั้งค่าคลาส Comparer ไปยังไฟล์ใดไฟล์หนึ่งใน {{FileFormatUp}}",
        "step_3": "เพิ่ม {{FileFormatUp}} เพิ่มเติมอย่างน้อยหนึ่งรายการลงในอินสแตนซ์ Comparer",
        "step_4": "รับรายงานขั้นสุดท้ายโดยละเอียดโดยสรุปความแตกต่างที่แน่นอน"
      },
      "code": {
        "comments": {
          "comment_1": "ตรวจสอบไฟล์จากฮาร์ดไดรฟ์ของคุณเพื่อหาความแตกต่างหรือความคล้ายคลึงกัน",
          "comment_2": "สร้างวัตถุ Comparer โดยระบุไฟล์เริ่มต้น",
          "comment_3": "รวมไฟล์เพิ่มเติมในการเปรียบเทียบ",
          "comment_4": "รับรายงานที่มีชื่อที่ระบุเป็นผลลัพธ์"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบเอกสารต่างๆโดยใช้ {{ProgLang}}",
      "description": "โซลูชัน {{EnvName}} ของเราช่วยให้คุณสามารถเปรียบเทียบเอกสารในรูปแบบต่างๆอัปเดตเกี่ยวกับการเปลี่ยนแปลงเอกสารโดยประมวลผลได้อย่างง่ายดาย"
    }
  },
  "pdf": {
    "head": {
      "title": "ใช้ไลบรารีการเปรียบเทียบ {{EnvName}} เพื่อตรวจสอบความแตกต่าง PDF",
      "description": "{{ProdShortName}} {{EnvName}} API สร้างรายงานโดยละเอียดสำหรับเอกสาร PDF ในแอปพลิเคชันที่รองรับ J2EE และ J2SE"
    },
    "header": {
      "title": "เปรียบเทียบเอกสาร PDF โดยใช้แอปพลิเคชัน {{EnvName}}",
      "description": "ไลบรารี {{ProdShortName}} {{EnvName}} ให้รายงานการเปรียบเทียบโดยละเอียดสำหรับเอกสาร PDF ในแอปพลิเคชันประเภทต่างๆที่ใช้ J2EE หรือ J2SE"
    },
    "about": {
      "title": "ค้นหาข้อดีของ API {{ProdFullName}}",
      "content": "API ของแท้ {{ProdFullName}} ถูกออกแบบมาเพื่อจัดทำรายงานที่เต็มไปด้วยข้อมูลที่เป็นประโยชน์เกี่ยวกับความแตกต่างภายในเอกสาร PDFไม่เพียง แต่ความแตกต่างในข้อความภายในย่อหน้าหรือคำเท่านั้น แต่ยังแสดงการเปลี่ยนแปลงรูปร่างและรูปแบบข้อความในรายงานขั้นสุดท้ายการรวมการเปลี่ยนแปลงเหล่านี้และส่งออกไปยังเอกสารสุดท้ายที่มีอยู่เช่นกันในความเป็นจริงไม่จำเป็นต้องใช้ไลบรารีภายนอกรหัสเพียงไม่กี่บรรทัดเท่านั้นที่อนุญาตให้เข้าถึงฟังก์ชันการทำงานที่หลากหลาย"
    },
    "steps": {
      "title": "เปรียบเทียบเอกสาร PDF หลายฉบับผ่าน {{EnvName}}",
      "content": {
        "title": "เปรียบเทียบ PDF s กับ [{{ProdShortName}}]({{ProductUrl}}) และรับรายงานเกี่ยวกับความแตกต่างของเอกสาร",
        "step_1": "ดาวน์โหลดแพคเกจ {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}}) และติดตั้ง",
        "step_2": "อินสแตนซ์ Comparer ใหม่ต้องมีเส้นทางไปยังไฟล์ PDF",
        "step_3": "ต้องจัดเตรียมเอกสาร PDF อย่างน้อยหนึ่งฉบับเพื่อเปรียบเทียบ",
        "step_4": "รายงานผลลัพธ์จะถูกบันทึกไว้ในเส้นทางที่ให้ไว้"
      },
      "code": {
        "comments": {
          "comment_1": "รับรายงานการเปลี่ยนแปลงได้ที่ PDF s",
          "comment_2": "ส่งเส้นทางไฟล์แรกไปยังตัวสร้าง Comparer",
          "comment_3": "ให้เอกสาร PDF อื่น",
          "comment_4": "บันทึกรายงานความแตกต่างเพื่อวิเคราะห์ในอนาคต"
        }
      }
    },
    "formats": {
      "title": "ค้นหาการเปลี่ยนแปลงใด ๆ ที่ไฟล์ PDF ผ่าน {{EnvName}}",
      "description": "ซอฟต์แวร์ {{EnvName}} ของเรามีความเป็นไปได้ในการควบคุมเวอร์ชันไฟล์ PDF โดยการสร้างรายงานที่แม่นยำและมีรายละเอียดในรูปแบบที่คุณชื่นชอบ"
    }
  },
  "docx": {
    "head": {
      "title": "โซลูชันสำหรับการตรวจสอบความแตกต่างของเอกสาร DOCX",
      "description": "โอกาสที่นำเสนอโดย {{ProdShortName}} API ช่วยให้เราสามารถดึงรายงานที่มีข้อมูลเกี่ยวกับความแตกต่างในเอกสาร DOCX"
    },
    "header": {
      "title": "{{EnvName}} แอปพลิเคชันสำหรับการค้นหาความแตกต่างในเอกสาร DOCX",
      "description": "ไลบรารี {{EnvName}} ที่นำเสนอโดย {{ProdShortName}} เปรียบเทียบเอกสาร DOCX ในแอปพลิเคชันที่รองรับ Java, J2EE หรือ J2SE"
    },
    "about": {
      "title": "สำรวจข้อดีของ API {{ProdFullName}}",
      "content": "DOCX การเปรียบเทียบเอกสาร รองรับโดย {{ProdFullName}} API ที่ประกอบรายงานที่มีข้อมูลเกี่ยวกับความแตกต่างต่างๆกำลังวิเคราะห์ข้อความภายในย่อหน้ารูปร่างและรูปแบบและข้อมูลอื่น ๆนอกจากนี้ยังเป็นไปได้ที่จะสร้าง DOCX การผสานการเปลี่ยนแปลงจากไฟล์เริ่มต้นไม่จำเป็นต้องใช้ไลบรารีภายนอกใด ๆปรับปรุงโครงการ {{EnvName}} ของคุณโดยเพิ่มโค้ดสองสามบรรทัด"
    },
    "steps": {
      "title": "ใช้ {{EnvName}} ในการเปรียบเทียบ DOCX หลายไฟล์",
      "content": {
        "title": "ใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อเปรียบเทียบเอกสาร MS Word",
        "step_1": "ติดตั้งโซลูชันของเราจาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "ตัวเปรียบเทียบจะต้องสร้างด้วยเอกสาร DOCX แรกเป็นพารามิเตอร์",
        "step_3": "การเปรียบเทียบใด ๆ ต้องใช้เอกสาร DOCX มากกว่าหนึ่งรายการ",
        "step_4": "รายงานผลลัพธ์ให้ข้อมูลที่เป็นประโยชน์"
      },
      "code": {
        "comments": {
          "comment_1": "รับทราบข้อมูลอย่างดีเกี่ยวกับการเปลี่ยนแปลงในเอกสาร MS Word",
          "comment_2": "ผ่าน DOCX เส้นทางไปยังคอมพาเรอร์",
          "comment_3": "เพิ่มเอกสาร DOCX อื่น",
          "comment_4": "รับรายงานที่ครอบคลุมสำหรับการวิเคราะห์ในอนาคต"
        }
      }
    },
    "formats": {
      "title": "ควบคุมการเปลี่ยนแปลงใด ๆ ที่ไฟล์ DOCX โดยใช้ {{EnvName}}",
      "description": "{{ProdShortName}} {{EnvName}} API ช่วยให้ผู้ใช้สามารถควบคุมเวอร์ชันเอกสาร DOCX ผ่านรายงานที่แม่นยำและมีรายละเอียดซึ่งอาจประมวลผลได้อย่างง่ายดาย"
    }
  },
  "png": {
    "head": {
      "title": "รับรายงานความแตกต่างสำหรับรูปภาพ PNG โดยใช้ {{EnvName}}",
      "description": "API {{ProdFullName}} สร้างรายงานการเปรียบเทียบที่เป็นประโยชน์สำหรับเอกสาร PNG ในแอปพลิเคชันที่รองรับ J2EE และ J2SE"
    },
    "header": {
      "title": "เปรียบเทียบรูปภาพ PNG โดยใช้ {{EnvName}}",
      "description": "เพิ่มพลังให้กับแอปพลิเคชัน Java, J2EE หรือ J2SE ของคุณด้วย API {{ProdShortName}}ดึงข้อมูลรายละเอียดเกี่ยวกับการเปลี่ยนแปลงใด ๆ ที่รูปภาพ PNG ของคุณ"
    },
    "about": {
      "title": "รับทราบเกี่ยวกับคุณสมบัติ API {{ProdFullName}}",
      "content": "{{ProdShortName}} พัฒนาเป็น API {{EnvName}} ดั้งเดิมที่เหมาะสำหรับการจัดทำรายงานโดยละเอียดตามความแปรปรของภาพรุ่นต่าง ๆ ที่แสดงในรูปแบบ PNGไม่เพียงรองรับรูปแบบ PNG เท่านั้นคุณสมบัติที่มีประโยชน์มากมายที่จัดทำโดย API ของเรา"
    },
    "steps": {
      "title": "ใช้ {{ProgLang}} เพื่อเปรียบเทียบไฟล์ PNG",
      "content": {
        "title": "เปรียบเทียบไฟล์ PNG กับ [{{ProdShortName}}]({{ProductUrl}}) และดึงรายงานที่เกี่ยวข้องเกี่ยวกับการเปลี่ยนแปลง",
        "step_1": "ติดตั้งแพคเกจ {{ProdFullName}} ดาวน์โหลดจาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "ให้อินสแตนซ์ Comparer และส่งเส้นทางไปยัง PNG",
        "step_3": "เพิ่มไฟล์ PNG เพื่อเปรียบเทียบเพิ่มเติม",
        "step_4": "บันทึกรายงานไปยังดิสก์ท้องถิ่น"
      },
      "code": {
        "comments": {
          "comment_1": "รับรายงานพร้อมข้อมูลเกี่ยวกับความแตกต่างระหว่าง PNG",
          "comment_2": "รับวัตถุ Comparer ด้วยเส้นทางไฟล์หลัก",
          "comment_3": "แนบรูปภาพที่จะเปรียบเทียบ PNG",
          "comment_4": "บันทึกรายงานไปยังตำแหน่งที่ต้องการ"
        }
      }
    },
    "formats": {
      "title": "ค้นหาความแตกต่างในรูปภาพ PNG เวอร์ชันต่างๆผ่าน {{ProgLang}}",
      "description": "{{ProdFullName}} API ติดตามการเปลี่ยนแปลงภายในรูปภาพ PNG และจัดทำรายงานสาธิตเพื่อวิเคราะห์เพิ่มเติม"
    }
  },
  "jpeg": {
    "head": {
      "title": "วิเคราะห์ JPEG s ด้วยรายงานเปรียบเทียบผ่าน {{ProgLang}}",
      "description": "API {{ProdFullName}} อันทรงพลังพัฒนาขึ้นเพื่อสร้างรายงานความแตกต่างที่มีประโยชน์สำหรับรูปภาพ JPEGรองรับ J2EE และ J2SE"
    },
    "header": {
      "title": "เปรียบเทียบ JPEG รูปภาพกับไลบรารี {{EnvName}} ของเรา",
      "description": "แอปพลิเคชัน Java, J2EE หรือ J2SE ที่ขับเคลื่อนโดย {{ProdShortName}} API ช่วยให้สามารถดึงรายงานโดยละเอียดเกี่ยวกับความแตกต่างที่ JPEG รูปภาพได้อย่างง่ายดาย"
    },
    "about": {
      "title": "ดูที่ {{ProdFullName}} API",
      "content": "API {{EnvName}} ดั้งเดิมที่เรียกว่า {{ProdShortName}} จัดทำรายงานโดยละเอียดเกี่ยวกับการเปลี่ยนแปลงระหว่างเวอร์ชันของรูปภาพที่บันทึกในรูปแบบ JPEGรองรับรูปแบบภาพยอดนิยมหลายรูปแบบเช่นกันรูปแบบภาพจำนวนมากได้รับการสนับสนุนโดย API ของเรา"
    },
    "steps": {
      "title": "ใช้ {{ProgLang}} เพื่อเปรียบเทียบรูปภาพ JPEG",
      "content": {
        "title": "ดึงข้อมูลที่เป็นประโยชน์เกี่ยวกับความแตกต่างของรูปภาพ JPEG ผ่าน [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "นำแพ็คเกจ {{ProdFullName}} มาใช้ในโครงการของคุณจาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "การเปรียบเทียบอินสแตนซ์พร้อมเส้นทางไปยังภาพ JPEG",
        "step_3": "เพิ่มไฟล์ JPEG เพื่อเปรียบเทียบ",
        "step_4": "รับรายงานผลลัพธ์"
      },
      "code": {
        "comments": {
          "comment_1": "เขียนข้อมูลความแตกต่างสำหรับ JPEG",
          "comment_2": "วัตถุเปรียบเทียบต้องการเส้นทางไฟล์ JPEG หลัก",
          "comment_3": "รูปภาพอื่น ๆ JPEG ต้องชี้ให้แหลม",
          "comment_4": "ไฟล์ผลลัพธ์ประกอบด้วยรายงาน"
        }
      }
    },
    "formats": {
      "title": "ควบคุมการเปลี่ยนแปลงในรูปภาพ JPEG เวอร์ชันต่างๆโดย {{ProgLang}}",
      "description": "การเปลี่ยนแปลงใด ๆ ในรูปภาพ JPEG อาจถูกตรวจพบโดย {{ProdFullName}}นำรายงานโดยละเอียดเกี่ยวกับกระบวนการทางธุรกิจของคุณ"
    }
  },
  "jpg": {
    "head": {
      "title": "วิเคราะห์รูปภาพ JPG ด้วย {{ProdFullName}}",
      "description": "{{ProdFullName}} API สร้างรายงานที่มีประโยชน์สำหรับ JPG รูปภาพรองรับ Java, J2EE และ J2SE"
    },
    "header": {
      "title": "วิเคราะห์การเปลี่ยนแปลงในไฟล์ JPG ผ่านโซลูชัน {{EnvName}} ของเรา",
      "description": "แอป {{EnvName}}, J2EE หรือ J2SE ที่ใช้ {{ProdShortName}} API สามารถสร้างรายงาน JPG โดยละเอียด"
    },
    "about": {
      "title": "สำรวจ {{ProdFullName}} API",
      "content": "โซลูชัน {{EnvName}} ดั้งเดิม {{ProdShortName}} สร้างรายงานโดยละเอียดเกี่ยวกับการเปลี่ยนแปลง JPGรองรับรูปแบบภาพยอดนิยมสำหรับการเปรียบเทียบและการประมวลผลเพิ่มเติม"
    },
    "steps": {
      "title": "เปรียบเทียบไฟล์ JPG โดยใช้ {{ProgLang}}",
      "content": {
        "title": "ดึงข้อมูลความแตกต่าง JPG ด้วย [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "เพิ่มฟังก์ชันการทำงานของผลิตภัณฑ์ของคุณเพิ่ม {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์เปรียบเทียบด้วยเส้นทาง JPG",
        "step_3": "เพิ่มรูปภาพ JPG อื่น ๆ ในการประมวลผล",
        "step_4": "รับรายงานผลลัพธ์"
      },
      "code": {
        "comments": {
          "comment_1": "สร้างข้อมูลความแตกต่างสำหรับ JPG",
          "comment_2": "วัตถุเปรียบเทียบต้องใช้เส้นทางไฟล์ JPG หลัก",
          "comment_3": "ชี้ไปที่รูปภาพอื่น ๆ JPG",
          "comment_4": "ไฟล์ผลลัพธ์ประกอบด้วยรายงาน"
        }
      }
    },
    "formats": {
      "title": "ติดตามการเปลี่ยนแปลงใด ๆ ในรูปภาพ JPG เวอร์ชันต่างๆโดยใช้ {{ProgLang}}",
      "description": "ตรวจจับการเปลี่ยนแปลงในรูปภาพ JPG ด้วย {{ProdFullName}}ปรับปรุงกระบวนการทางธุรกิจด้วยรายงานโดยละเอียด"
    }
  },
  "xlsx": {
    "head": {
      "title": "{{ProdFullName}} สำหรับการเปรียบเทียบ XLSX",
      "description": "API {{ProdShortName}} นำเสนอการดึงรายงานโดยระบุรายละเอียดความแปรปรวนในเอกสาร XLSXเข้ากันได้กับสภาพแวดล้อม Java, J2EE และ J2SE"
    },
    "header": {
      "title": "{{EnvName}} แอปพลิเคชันสำหรับการตรวจจับการเปลี่ยนแปลงในสเปรดชีต XLSX",
      "description": "API {{ProdShortName}} {{EnvName}} ช่วยให้สามารถเปรียบเทียบสเปรดชีต XLSX ภายในแอปพลิเคชัน Java, J2EE หรือ J2SE"
    },
    "about": {
      "title": "สำรวจข้อดีของ {{ProdFullName}} API",
      "content": "API {{ProdFullName}} ช่วยให้เปรียบเทียบสเปรดชีต XLSX ได้ง่ายขึ้น สร้างรายงานเกี่ยวกับความแตกต่างที่พบในข้อความ ย่อหน้า รูปร่าง สไตล์ และองค์ประกอบอื่นๆนอกจากนี้ยังรองรับการรวมการเปลี่ยนแปลงจากไฟล์ต้นฉบับหลายไฟล์โดยไม่ต้องใช้ไลบรารีภายนอกปรับปรุงโครงการ {{EnvName}} ของคุณด้วยการรวมโค้ดที่น้อยที่สุด"
    },
    "steps": {
      "title": "ใช้ {{EnvName}} สำหรับการเปรียบเทียบไฟล์ XLSX หลายไฟล์",
      "content": {
        "title": "ใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อวิเคราะห์สเปรดชีต MS Excel",
        "step_1": "ติดตั้งแพคเกจจาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์ตัวเปรียบเทียบด้วยสเปรดชีต XLSX แรกเป็นพารามิเตอร์",
        "step_3": "รวมสเปรดชีต XLSX เพิ่มเติมสำหรับการเปรียบเทียบ",
        "step_4": "เพลิดเพลินกับรายงานที่ครอบ"
      },
      "code": {
        "comments": {
          "comment_1": "รับทราบข้อมูลเกี่ยวกับการเปลี่ยนแปลงในเอกสาร MS Excel",
          "comment_2": "ระบุเส้นทาง XLSX ไปยังตัวเปรียบเทียบ",
          "comment_3": "รวมสเปรดชีต XLSX เพิ่มเติม",
          "comment_4": "เข้าถึงรายงานโดยละเอียดสำหรับการวิเคราะห์ในอนาคต"
        }
      }
    },
    "formats": {
      "title": "จัดการการเปลี่ยนแปลงในสเปรดชีต XLSX โดยใช้ {{EnvName}}",
      "description": "ไลบรารี {{ProdShortName}} {{EnvName}} ช่วยให้ผู้ใช้สามารถตรวจสอบสเปรดชีต XLSX เวอร์ชันต่างๆ ผ่านรายงานที่ละเอียดและแม่นยำซึ่งสามารถจัดทำได้อย่างง่ายดาย"
    }
  },
  "pptx": {
    "head": {
      "title": "ห้องสมุดออกแบบมาโดยเฉพาะสำหรับการเปรียบเทียบ PPTX",
      "description": "{{ProdShortName}} มีฟังก์ชันสำหรับการดึงรายงานโดยระบุรายละเอียดความแปรปรวนในการนำเสนอ PPTX รองรับ Java, J2EE หรือ J2SE"
    },
    "header": {
      "title": "{{EnvName}} แอปพลิเคชันที่ได้รับความสามารถโดย {{ProdShortName}} เปรียบเทียบ PPTX",
      "description": "การนำเสนอของ Microsoft PowerPoint PPTX อาจเปรียบเทียบโดย {{ProdFullName}} โดยใช้แอปพลิเคชัน Java, J2EE หรือ J2SE"
    },
    "about": {
      "title": "สำรวจคุณสมบัติของ {{ProdFullName}}",
      "content": "API {{ProdFullName}} ใช้รายงานการเปรียบเทียบเกี่ยวกับความแตกต่างในการนำเสนอ PPTXรายงานผลลัพธ์ไม่เพียง แต่มีข้อความที่แตกต่างเท่านั้น แต่มีรูปร่าง สไตล์ และองค์ประกอบอื่น ๆการรวมงานนำเสนอจำนวนมากเข้ากับภาพที่ต้องการเพียงอย่างเดียวไม่จำเป็นต้องใช้ไลบรารีภายนอกของบุคคลที่สามเพิ่มพลังให้กับโครงการ {{EnvName}} โดยการเพิ่มจำนวนโค้ดที่น้อยที่สุด"
    },
    "steps": {
      "title": "ใช้ {{EnvName}} สำหรับการเปรียบเทียบไฟล์ PPTX หลายไฟล์",
      "content": {
        "title": "ใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อวิเคราะห์การนำเสนอ MS PowerPoint",
        "step_1": "ติดตั้งแพคเกจจาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "จัดเตรียมตัวเปรียบเทียบใหม่พร้อมกับเส้นทาง PPTX",
        "step_3": "เพิ่มการนำเสนอ PPTX เพื่อเปรียบเทียบ",
        "step_4": "รับรายงานโดยละเอียด"
      },
      "code": {
        "comments": {
          "comment_1": "รู้เกี่ยวกับความแตกต่างในการนำเสนอ MS PPTX",
          "comment_2": "ระบุเส้นทางไฟล์",
          "comment_3": "เพิ่มการนำเสนอ PPTX เพิ่มเติม",
          "comment_4": "บันทึกรายงานสำหรับการวิเคราะห์ในอนาคต"
        }
      }
    },
    "formats": {
      "title": "วิเคราะห์ไฟล์ PPTX โดยใช้ {{EnvName}}",
      "description": "ซอฟต์แวร์ {{ProdFullName}} ช่วยให้สามารถตรวจจับความแตกต่างที่งานนำเสนอ MS PowerPoint PPTX เพื่อสร้างรายงานที่ละเอียดและแม่นยำโดยไม่ต้องใช้ความพยายามเป็นพิเศษ"
    }
  }
}