{
  "common": {
    "head": {
      "title": "Comparez {{FileFormatUp}} avec la bibliothèque {{ProgLang}}",
      "description": "Avec {{ProdFullName}}, générez des rapports de comparaison détaillés pour les applications {{Runtime}}."
    },
    "header": {
      "title": "Comparez {{FileFormatUp}} dans {{Runtime}}",
      "description": "{{ProdShortName}} est une bibliothèque basée sur {{Runtime}} qui vous permet de comparer et d'identifier facilement les différences dans les fichiers {{FileFormatUp}}. Boostez l’efficacité de votre solution dans les tâches de comparaison de documents avec cet outil puissant.",
      "subtitle": "Solution de comparaison de fichiers",
      "action_title": "Téléchargez gratuitement depuis {{PackageStoreName}}"
    },
    "about": {
      "title": "Découvrez les fonctionnalités de {{ProdFullName}}",
      "content": "{{ProdFullName}} est une API conçue pour comparer des images et des documents au même format. Il détecte les différences de paragraphes, de mots, de caractères, de formes et de styles de texte entre les fichiers comparés. Vous pouvez fusionner ces modifications et les enregistrer dans un document final. Il prend en charge une variété de formats, notamment les PDF, les documents Word, les feuilles de calcul Excel, les présentations PowerPoint, les diagrammes Visio, les e-mails Outlook, les fichiers HTML, les dessins et plusieurs formats d'image, le tout sans nécessiter de logiciel supplémentaire."
    },
    "steps": {
      "title": "Comment comparer {{FileFormatUp}} à l'aide de {{Runtime}}",
      "content": {
        "title": "Utilisez [{{ProdShortName}}]({{ProductUrl}}) pour comparer les fichiers {{FileFormatUp}} et générer des rapports de différences détaillés.",
        "step_1": "Installez {{ProdFullName}} via [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Créez un objet Comparer et chargez le premier fichier {{FileFormatUp}}.",
        "step_3": "Ajoutez le deuxième fichier {{FileFormatUp}} au comparateur.",
        "step_4": "Générez un rapport complet décrivant toutes les différences détectées."
      },
      "code": {
        "comments": {
          "comment_1": "Comparez plusieurs fichiers pour voir les similitudes et les différences.",
          "comment_2": "Initialisez le comparateur et chargez le premier fichier.",
          "comment_3": "Ajoutez des fichiers supplémentaires à des fins de comparaison.",
          "comment_4": "Récupérez le rapport de comparaison final."
        }
      }
    },
    "formats": {
      "title": "Comparez les formats de documents populaires avec {{ProgLang}}",
      "description": "Notre API {{Runtime}} vous permet de comparer sans effort des documents dans un large éventail de formats, vous permettant ainsi de suivre facilement les modifications et les différences des documents."
    }
  },
  "pdf": {
    "head": {
      "title": "Comparez les PDF via la bibliothèque {{ProgLang}}",
      "description": "Le logiciel {{ProdShortName}} pour {{Runtime}} génère des rapports détaillés mettant en évidence les différences entre les documents PDF."
    },
    "header": {
      "title": "Comparaison PDF pour {{EnvName}}",
      "description": "Tirez parti de notre API de comparaison de documents dans {{Runtime}} pour identifier et afficher facilement les différences entre les fichiers PDF dans les applications {{ProgLang}}. Obtenez des rapports détaillés rapidement et efficacement."
    },
    "about": {
      "title": "Principales fonctionnalités de la bibliothèque {{ProdFullName}}",
      "content": "Générez des rapports détaillés sur les différences dans les documents PDF directement dans vos applications {{ProgLang}}. Avec seulement quelques lignes de code, utilisez {{ProdFullName}} sans avoir besoin de logiciels ou de bibliothèques supplémentaires. Surveillez les modifications apportées aux paragraphes, aux mots, aux caractères, aux formes et aux styles de texte dans vos PDF. Vous pouvez également fusionner les modifications de plusieurs versions de document en un seul résultat. Traitez les documents rapidement et facilement, sans tracas."
    },
    "steps": {
      "title": "Comment obtenir des rapports de différences PDF dans {{ProgLang}}",
      "content": {
        "title": "Suivez les modifications dans les documents PDF avec des rapports générés à l'aide de [{{ProdShortName}}]({{ProductUrl}}).",
        "step_1": "Installez {{ProdShortName}} pour {{EnvName}} via [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Créez une instance Comparer et fournissez le chemin d’accès au premier fichier PDF.",
        "step_3": "Ajoutez un deuxième fichier PDF pour comparaison.",
        "step_4": "Récupérez le rapport final détaillant les différences entre les fichiers."
      },
      "code": {
        "comments": {
          "comment_1": "Générez un rapport mettant en évidence les différences dans les fichiers PDF.",
          "comment_2": "Créez un objet Comparer avec le premier fichier.",
          "comment_3": "Ajoutez le deuxième fichier (ou plus) à comparer.",
          "comment_4": "Enregistrez le rapport généré dans le chemin choisi."
        }
      }
    },
    "formats": {
      "title": "Comparez les formats courants comme le PDF avec {{ProgLang}}",
      "description": "Notre API {{Runtime}} permet une comparaison rapide et efficace des fichiers PDF. Suivez facilement les modifications avec des rapports détaillés."
    }
  },
  "docx": {
    "head": {
      "title": "Comparez les documents DOCX à l'aide de l'API {{Runtime}}",
      "description": "Suivez facilement les différences dans les fichiers MS Word DOCX avec l'API {{ProdShortName}} pour {{Runtime}}. Générez des rapports détaillés pour mettre en évidence les modifications entre les documents."
    },
    "header": {
      "title": "Comparez les fichiers DOCX dans {{EnvName}}",
      "description": "Utilisez notre API de traitement de documents dans {{Runtime}} pour identifier et afficher rapidement toute modification dans les fichiers MS Word DOCX. Bénéficiez d'une génération de rapports rapide et sans tracas dans vos applications {{EnvName}}."
    },
    "about": {
      "title": "Découvrez les fonctionnalités de {{ProdFullName}}",
      "content": "{{ProdShortName}} fournit des rapports complets mettant en évidence les modifications apportées aux différentes versions des documents DOCX. Avec seulement quelques lignes de code, intégrez {{EnvName}} et notre API dans votre workflow sans avoir besoin de bibliothèques supplémentaires. Détectez les modifications apportées aux pages, au texte, aux styles de texte ou aux formes dans les documents MS Word. Vous pouvez même fusionner les modifications pour créer un document DOCX final. Améliorez vos capacités de traitement de documents grâce à notre puissante API."
    },
    "steps": {
      "title": "Générez des rapports de comparaison DOCX dans {{ProgLang}}",
      "content": {
        "title": "Utilisez [{{ProdShortName}}]({{ProductUrl}}) avec {{EnvName}} pour comparer les fichiers DOCX.",
        "step_1": "Installez {{ProdShortName}} pour {{EnvName}} via [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Créez une instance Comparer et spécifiez le chemin d'accès au premier fichier DOCX.",
        "step_3": "Ajoutez des fichiers DOCX supplémentaires à des fins de comparaison.",
        "step_4": "Consultez le rapport généré et accédez aux résultats."
      },
      "code": {
        "comments": {
          "comment_1": "Obtenez des informations détaillées sur les modifications DOCX.",
          "comment_2": "Initialisez le comparateur avec le premier fichier DOCX.",
          "comment_3": "Ajoutez plus de fichiers DOCX à des fins de comparaison.",
          "comment_4": "Enregistrez le rapport de comparaison localement."
        }
      }
    },
    "formats": {
      "title": "Comparez les documents DOCX à l'aide de {{ProgLang}}",
      "description": "Comparez facilement n'importe quel fichier MS Word DOCX avec {{ProdFullName}} et obtenez des informations précieuses sur les modifications apportées aux documents."
    }
  },
  "png": {
    "head": {
      "title": "{{ProgLang}} API pour comparer les images PNG",
      "description": "La bibliothèque {{ProdFullName}} génère des rapports détaillés mettant en évidence les différences dans les images PNG."
    },
    "header": {
      "title": "Comparez les images PNG dans les applications {{Runtime}} avec Python",
      "description": "Tirez parti de l'API {{Runtime}} pour détecter les modifications dans les fichiers PNG dans vos applications {{ProgLang}}. Obtenez des rapports complets rapidement et facilement."
    },
    "about": {
      "title": "Découvrez les capacités de l'API {{ProdFullName}}",
      "content": "Générez des rapports détaillés sur les différences entre les différentes versions d'images PNG directement dans vos applications {{ProgLang}} : aucun logiciel tiers n'est nécessaire. Restez informé de tous les changements dans vos images PNG."
    },
    "steps": {
      "title": "Comment générer des rapports de comparaison pour les images PNG dans {{ProgLang}}",
      "content": {
        "title": "Suivez les modifications dans les fichiers PNG à l'aide de [{{ProdShortName}}]({{ProductUrl}}) et générez facilement des rapports.",
        "step_1": "Installez le package {{ProdShortName}} via [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Créez un objet Comparer et fournissez le chemin d’accès au premier fichier PNG.",
        "step_3": "Ajoutez un ou plusieurs fichiers PNG à comparer.",
        "step_4": "Récupérez un rapport détaillé montrant toutes les différences."
      },
      "code": {
        "comments": {
          "comment_1": "Générez un rapport qui met en évidence les modifications apportées aux fichiers PNG.",
          "comment_2": "Instanciez le comparateur avec le premier fichier PNG.",
          "comment_3": "Ajoutez des fichiers PNG supplémentaires à des fins de comparaison.",
          "comment_4": "Enregistrez ou affichez le rapport avec toutes les différences identifiées."
        }
      }
    },
    "formats": {
      "title": "Comparez des images dans des formats populaires comme PNG",
      "description": "Utilisez {{ProdFullName}} pour identifier les différences entre les images PNG et générer des rapports détaillés pour suivre les changements importants."
    }
  },
  "jpeg": {
    "head": {
      "title": "Bibliothèque {{Runtime}} pour automatiser la comparaison d'images JPEG",
      "description": "Découvrez les capacités de l'API {{ProdFullName}} pour détecter et signaler les différences dans les images JPEG."
    },
    "header": {
      "title": "Comparez les images JPEG et générez des rapports avec {{EnvName}}",
      "description": "Une solution {{Runtime}} robuste pour suivre les modifications des images JPEG dans vos applications {{ProgLang}}. Des rapports détaillés fournissent des informations précieuses pour votre entreprise."
    },
    "about": {
      "title": "Explorez les fonctionnalités de {{ProdFullName}}",
      "content": "Obtenez des rapports détaillés sur les modifications apportées aux images JPEG à l'aide de l'API {{ProdFullName}}. Analysez facilement les données de vos applications {{ProgLang}} sans avoir besoin de bibliothèques supplémentaires. Améliorez les flux de travail de votre entreprise en ajoutant seulement quelques lignes de code."
    },
    "steps": {
      "title": "Comment analyser les modifications d'image JPEG avec {{ProgLang}}",
      "content": {
        "title": "Utilisez [{{ProdShortName}}]({{ProductUrl}}) pour détecter et gérer les différences dans les images JPEG.",
        "step_1": "Installez {{ProdShortName}} à partir de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Créez un objet comparateur et fournissez le chemin d’accès au fichier JPEG.",
        "step_3": "Ajoutez au moins un fichier JPEG supplémentaire à des fins de comparaison.",
        "step_4": "Générez le rapport de comparaison et enregistrez-le au format JPEG."
      },
      "code": {
        "comments": {
          "comment_1": "Traitez les images JPEG pour générer un rapport de différence.",
          "comment_2": "Instanciez un objet Comparer avec le premier fichier JPEG.",
          "comment_3": "Ajoutez des fichiers JPEG supplémentaires pour analyse.",
          "comment_4": "Obtenez un rapport détaillant les différences entre les images."
        }
      }
    },
    "formats": {
      "title": "Comparez les images JPEG à l'aide de {{ProgLang}}",
      "description": "L'API {{ProdFullName}} fournit des rapports détaillés sur les différences entre les fichiers JPEG. Ces rapports vous aident à suivre facilement les modifications apportées aux images commerciales importantes."
    }
  },
  "jpg": {
    "head": {
      "title": "Comparaison automatisée des images JPG avec la bibliothèque {{Runtime}}",
      "description": "Utilisez l'API {{ProdFullName}} pour identifier et signaler facilement les différences dans les images JPG."
    },
    "header": {
      "title": "Générer des rapports de différence JPG dans les applications {{EnvName}}",
      "description": "Profitez de {{Runtime}} pour comparer les modifications d'images JPG dans vos applications {{ProgLang}}. Des rapports détaillés fournissent des informations précieuses pour vos solutions commerciales."
    },
    "about": {
      "title": "Découvrez la puissance de l'API {{ProdFullName}}",
      "content": "Restez informé des modifications apportées aux images JPG avec {{ProdFullName}}. Analysez les données détaillées de vos applications {{ProgLang}} sans avoir besoin d'outils supplémentaires. Avec un minimum de code, améliorez vos solutions métier et automatisez les comparaisons d'images."
    },
    "steps": {
      "title": "Comment analyser les modifications JPG avec {{ProgLang}}",
      "content": {
        "title": "Tirez parti de [{{ProdShortName}}]({{ProductUrl}}) pour gérer les différences entre les images JPG.",
        "step_1": "Installez {{ProdShortName}} à partir de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Créez un objet comparateur et fournissez le chemin d’accès au fichier JPG.",
        "step_3": "Ajoutez au moins un fichier JPG supplémentaire à des fins de comparaison.",
        "step_4": "Générez un rapport avec des détails sur les différences."
      },
      "code": {
        "comments": {
          "comment_1": "Générez un rapport comparant les fichiers JPG.",
          "comment_2": "Instanciez un nouvel objet Comparer avec le premier fichier JPG.",
          "comment_3": "Ajoutez des fichiers JPG supplémentaires à des fins de comparaison.",
          "comment_4": "Créez un rapport avec des informations détaillées sur les différences entre les images JPG."
        }
      }
    },
    "formats": {
      "title": "Comparez les images JPG avec {{ProgLang}}",
      "description": "À l'aide de la bibliothèque {{ProdFullName}}, identifiez rapidement les différences entre les images JPG. Des rapports détaillés permettent de suivre les modifications apportées aux fichiers commerciaux importants."
    }
  },
  "xlsx": {
    "head": {
      "title": "Comparez le contenu de la feuille de calcul XLSX avec l'API {{Runtime}}",
      "description": "Vérifiez facilement les différences dans les feuilles de calcul MS Excel à l'aide de notre API {{Runtime}}, qui génère des rapports détaillés mettant en évidence toutes les distinctions."
    },
    "header": {
      "title": "Comparaison de feuilles de calcul XLSX dans les applications {{EnvName}}",
      "description": "Utilisez la bibliothèque de traitement de documents {{Runtime}} pour détecter et mettre en évidence les modifications apportées aux fichiers MS Excel XLSX dans les applications {{EnvName}}. Générez des rapports rapidement et facilement."
    },
    "about": {
      "title": "Découvrez les avantages de {{ProdShortName}}",
      "content": "Générez des rapports complets qui fournissent des données détaillées sur les modifications apportées aux différentes versions des fichiers XLSX à l'aide de {{ProdShortName}}. Avec seulement quelques lignes de code, vous pouvez intégrer l'API de manière transparente dans vos applications {{EnvName}}, sans avoir besoin d'outils supplémentaires. Analysez les différences dans les feuilles, le texte, les styles ou les formes dans les fichiers MS Excel et fusionnez les modifications dans un document XLSX final. Améliorez les flux de travail de votre entreprise grâce à nos solutions puissantes."
    },
    "steps": {
      "title": "Comment comparer des fichiers XLSX dans {{ProgLang}}",
      "content": {
        "title": "Utiliser [{{ProdShortName}}]({{ProductUrl}}) et {{EnvName}} pour comparer les documents XLSX",
        "step_1": "Installez {{ProdShortName}} pour {{EnvName}} à partir de [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Instanciez l'objet Comparer et fournissez le chemin d'accès au premier fichier XLSX",
        "step_3": "Ajouter des fichiers XLSX supplémentaires à des fins de comparaison",
        "step_4": "Générer et examiner les résultats de la comparaison"
      },
      "code": {
        "comments": {
          "comment_1": "Récupérer un rapport détaillant les modifications apportées aux fichiers XLSX",
          "comment_2": "Créez un nouvel objet Comparer avec le premier fichier XLSX",
          "comment_3": "Ajoutez d'autres fichiers XLSX à comparer",
          "comment_4": "Enregistrez le rapport généré localement"
        }
      }
    },
    "formats": {
      "title": "Comparez les feuilles de calcul XLSX avec {{ProgLang}}",
      "description": "Comparez facilement les feuilles de calcul MS Excel XLSX à l'aide de l'API {{ProdFullName}}. Obtenez des informations approfondies sur les modifications apportées aux données de votre entreprise grâce à nos rapports détaillés."
    }
  },
  "pptx": {
    "head": {
      "title": "Comparez les fichiers PPTX avec {{EnvName}}",
      "description": "Analysez les présentations PPTX avec {{ProdShortName}} à l'aide de {{EnvName}} et générez des rapports précis mettant en évidence les différences de contenu."
    },
    "header": {
      "title": "Comparaison de présentation PPTX dans {{EnvName}}",
      "description": "Tirez parti de l'API de traitement de documents dans {{Runtime}} pour détecter et présenter les modifications dans les présentations MS PowerPoint PPTX dans les applications {{EnvName}}. Rationalisez les flux de travail de votre entreprise grâce à une analyse rapide et facile."
    },
    "about": {
      "title": "Découvrez les fonctionnalités de {{ProdFullName}}",
      "content": "Générez des rapports détaillés sur les modifications apportées aux différentes versions des fichiers PPTX avec {{ProdShortName}}. Intégrez facilement la solution dans vos applications {{EnvName}} avec seulement quelques lignes de code. Analysez les différences dans les diapositives, le texte, le formatage ou les formes dans les présentations MS PowerPoint. Vous pouvez également fusionner les modifications dans un fichier PPTX final. Valorisez vos projets d’entreprise avec cette solution puissante."
    },
    "steps": {
      "title": "Générez des rapports sur les différences de fichiers PPTX dans {{ProgLang}}",
      "content": {
        "title": "Utilisez [{{ProdShortName}}]({{ProductUrl}}) pour comparer les présentations PPTX",
        "step_1": "Installez {{ProdShortName}} à partir de [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Créez un objet Comparer pour le premier fichier PPTX",
        "step_3": "Ajouter des fichiers PPTX supplémentaires à des fins de comparaison",
        "step_4": "Récupérer et examiner le rapport de comparaison"
      },
      "code": {
        "comments": {
          "comment_1": "Récupérer des données sur les modifications du fichier PPTX",
          "comment_2": "Initialisez le comparateur avec le premier fichier PPTX",
          "comment_3": "Inclure d'autres fichiers PPTX",
          "comment_4": "Enregistrez le résultat de la comparaison localement"
        }
      }
    },
    "formats": {
      "title": "Comparez les présentations PPTX à l'aide de {{ProgLang}}",
      "description": "Comparez facilement les présentations MS PowerPoint PPTX à l'aide de {{ProdFullName}}. Générez des rapports détaillés qui fournissent des informations sur les changements intervenus dans vos présentations professionnelles."
    }
  }
}