{
  "common": {
    "head": {
      "title": "Comparez efficacement {{FileFormatUp}} à l'aide de la bibliothèque {{ProgLang}}",
      "description": "Avec {{ProdFullName}}, générez des rapports de comparaison approfondis adaptés aux applications {{Runtime}}."
    },
    "header": {
      "title": "Analyser les différences {{FileFormatUp}} dans {{Runtime}}",
      "description": "{{ProdShortName}} est une bibliothèque conçue pour {{Runtime}} qui simplifie le processus de comparaison et de mise en évidence des écarts dans les fichiers {{FileFormatUp}}. Améliorez vos capacités de gestion de documents avec cette solution innovante.",
      "subtitle": "Outil avancé de comparaison de fichiers",
      "action_title": "Obtenez votre téléchargement gratuit sur {{PackageStoreName}}"
    },
    "about": {
      "title": "Explorez les capacités de {{ProdFullName}}",
      "content": "{{ProdFullName}} sert d'API spécialement conçue pour comparer des documents et des images dans différents formats. Il identifie les changements de mots, de paragraphes, de caractères, de formes et d'éléments de style entre les documents. Vous pouvez facilement fusionner ces modifications et les enregistrer en tant que document final consolidé. Il prend en charge une large gamme de formats, notamment les PDF, les documents Word, les feuilles Excel, les présentations PowerPoint, Visio, les fichiers HTML, les images et bien plus encore, le tout réalisé sans outils tiers."
    },
    "steps": {
      "title": "Comment comparer efficacement {{FileFormatUp}} à l'aide de {{Runtime}}",
      "content": {
        "title": "Utilisez [{{ProdShortName}}]({{ProductUrl}}) pour effectuer des comparaisons détaillées sur les fichiers {{FileFormatUp}}.",
        "step_1": "Commencez par installer {{ProdFullName}} via [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Instanciez un objet Comparer avec le fichier {{FileFormatUp}} initial.",
        "step_3": "Intégrez le deuxième fichier {{FileFormatUp}} dans le comparateur.",
        "step_4": "Compiler un rapport détaillé délimitant toutes les divergences identifiées."
      },
      "code": {
        "comments": {
          "comment_1": "Comparez plusieurs fichiers pour voir les similitudes et les différences.",
          "comment_2": "Initialisez le comparateur et chargez le premier fichier.",
          "comment_3": "Ajoutez des fichiers supplémentaires à des fins de comparaison.",
          "comment_4": "Récupérez le rapport de comparaison final."
        }
      }
    },
    "formats": {
      "title": "Comparez facilement différents formats de fichiers à l'aide de {{ProgLang}}",
      "description": "Notre API {{Runtime}} permet une comparaison sans effort de divers formats de documents, facilitant ainsi le suivi des modifications apportées aux documents."
    }
  },
  "pdf": {
    "head": {
      "title": "Rationalisez les comparaisons de PDF avec la bibliothèque {{ProgLang}}",
      "description": "Le logiciel {{ProdShortName}} pour {{Runtime}} crée des rapports détaillés qui mettent en évidence les variations dans les documents PDF."
    },
    "header": {
      "title": "Comparaison PDF simplifiée pour {{EnvName}}",
      "description": "Utilisez notre API de comparaison de PDF dans {{Runtime}} pour identifier et présenter efficacement et facilement les écarts dans les fichiers PDF. Accédez rapidement à des rapports détaillés sans complexité inutile."
    },
    "about": {
      "title": "Dévoilement des fonctionnalités clés de la bibliothèque {{ProdFullName}}",
      "content": "Produisez des rapports complets identifiant les différences trouvées dans les documents PDF directement à partir de vos applications {{ProgLang}}. Avec un minimum de code, exploitez {{ProdFullName}} sans avoir besoin de logiciel supplémentaire. Suivez les modifications dans les paragraphes, les mots, les formats, les formes et les styles de vos PDF. De plus, combinez les révisions de plusieurs versions en un résultat unifié. Traitez les PDF rapidement et sans effort."
    },
    "steps": {
      "title": "Générez des rapports de différences PDF avec {{ProgLang}}",
      "content": {
        "title": "Surveillez les modifications apportées aux documents PDF à l'aide des rapports produits par [{{ProdShortName}}]({{ProductUrl}}).",
        "step_1": "Installez {{ProdShortName}} pour {{EnvName}} à l'aide de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Créez une instance de Comparer et saisissez le chemin du premier fichier PDF.",
        "step_3": "Introduisez un deuxième fichier PDF destiné à la comparaison.",
        "step_4": "Extrayez le rapport final qui explique les variations entre les fichiers."
      },
      "code": {
        "comments": {
          "comment_1": "Créez un rapport détaillé pour présenter les variations dans les fichiers PDF.",
          "comment_2": "Créez un objet Comparer avec le chemin d'accès au premier document PDF.",
          "comment_3": "Incorporez le deuxième fichier ou plus pour une comparaison efficace.",
          "comment_4": "Conservez le rapport généré dans votre répertoire spécifié."
        }
      }
    },
    "formats": {
      "title": "Comparez les types de fichiers courants comme le PDF avec {{ProgLang}}",
      "description": "Notre API {{Runtime}} vous permet de comparer rapidement et précisément les fichiers PDF. Surveillez facilement les modifications grâce à des rapports de comparaison détaillés."
    }
  },
  "docx": {
    "head": {
      "title": "Comparez sans effort les fichiers DOCX à l'aide de l'API {{Runtime}}",
      "description": "Suivez et analysez les différences dans les documents MS Word DOCX avec l'API {{ProdShortName}} pour {{Runtime}}, produisant ainsi des rapports complets décrivant les modifications."
    },
    "header": {
      "title": "Comparaison DOCX pour {{EnvName}}",
      "description": "Utilisez notre API de traitement de documents dans {{Runtime}} pour identifier et résumer rapidement les modifications apportées aux fichiers MS Word DOCX. Bénéficiez d’une génération transparente de rapports au sein de vos applications."
    },
    "about": {
      "title": "Explorez les fonctionnalités de {{ProdFullName}}",
      "content": "{{ProdShortName}} fournit des informations détaillées sur les modifications apportées aux différentes versions des documents DOCX. Avec quelques lignes de code, vous pouvez intégrer {{EnvName}} et notre API dans votre flux de travail, aucune bibliothèque supplémentaire n'est nécessaire. Déterminez les modifications apportées au contenu, aux styles de texte et aux mises en page dans les documents Word. Vous pouvez même consolider les variantes pour créer un fichier DOCX mis à jour. Améliorez vos processus de gestion de documents grâce à notre API robuste."
    },
    "steps": {
      "title": "Créez des rapports de comparaison DOCX avec {{ProgLang}}",
      "content": {
        "title": "Tirez parti de [{{ProdShortName}}]({{ProductUrl}}) ainsi que de {{EnvName}} pour évaluer les différences entre les fichiers DOCX.",
        "step_1": "Obtenez {{ProdShortName}} pour {{EnvName}} via [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Configurez une instance Comparer et dirigez le chemin vers le fichier DOCX initial.",
        "step_3": "Ajoutez d’autres fichiers DOCX si nécessaire pour une analyse comparative.",
        "step_4": "Évaluez le rapport généré et examinez vos résultats."
      },
      "code": {
        "comments": {
          "comment_1": "Obtenez des informations détaillées sur les modifications apportées aux fichiers DOCX.",
          "comment_2": "Initialisez le comparateur en utilisant le premier fichier DOCX pour référence.",
          "comment_3": "Incluez des fichiers DOCX supplémentaires pour une comparaison approfondie.",
          "comment_4": "Archivez le rapport de comparaison si nécessaire."
        }
      }
    },
    "formats": {
      "title": "Comparez tous les documents DOCX avec {{ProgLang}}",
      "description": "Utilisez {{ProdFullName}} pour analyser n'importe quel fichier MS Word DOCX et acquérir des connaissances précieuses sur les révisions de documents."
    }
  },
  "png": {
    "head": {
      "title": "Comparez les images PNG à l'aide de l'API {{ProgLang}}",
      "description": "La bibliothèque {{ProdFullName}} produit des rapports détaillés qui révèlent les différences entre les fichiers image PNG."
    },
    "header": {
      "title": "Analyser les images PNG dans {{Runtime}}",
      "description": "Profitez de l'API {{Runtime}} pour découvrir les écarts dans les fichiers PNG de manière transparente au sein de vos applications {{ProgLang}}. Recevez des rapports complets sans effort."
    },
    "about": {
      "title": "Explorez les fonctionnalités de l'API {{ProdFullName}}",
      "content": "Générez des rapports détaillés détaillant les écarts entre les versions d'images PNG directement dans vos applications {{ProgLang}}, sans recourir à des logiciels supplémentaires. Restez informé de tous les changements impliquant vos images PNG."
    },
    "steps": {
      "title": "Générez des rapports de comparaison pour les images PNG avec {{ProgLang}}",
      "content": {
        "title": "Surveillez les modifications dans les fichiers PNG à l'aide de [{{ProdShortName}}]({{ProductUrl}}) et créez facilement des rapports.",
        "step_1": "Obtenez le package {{ProdShortName}} via [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Instanciez un comparateur et saisissez le chemin de la première image PNG.",
        "step_3": "Incluez un ou plusieurs fichiers PNG pour une étude comparative.",
        "step_4": "Accédez à un rapport complet détaillant toutes les anomalies visuelles."
      },
      "code": {
        "comments": {
          "comment_1": "Créez un rapport qui documente les modifications entre les images PNG.",
          "comment_2": "Initialisez le comparateur avec le premier fichier PNG à démarrer.",
          "comment_3": "Intégrez des fichiers PNG supplémentaires pour une comparaison approfondie.",
          "comment_4": "Stockez ou affichez le rapport reflétant tous les changements identifiés."
        }
      }
    },
    "formats": {
      "title": "Comparez les images dans des formats comme PNG",
      "description": "Utilisez {{ProdFullName}} pour identifier les différences entre les images PNG et générer des rapports détaillés pour suivre les changements importants."
    }
  },
  "jpeg": {
    "head": {
      "title": "Automatisez les comparaisons JPEG avec la bibliothèque {{Runtime}}",
      "description": "L'API {{ProdFullName}} vous permet de détecter et de documenter sans effort les différences dans les images JPEG."
    },
    "header": {
      "title": "Comparez facilement les images JPEG avec {{EnvName}}",
      "description": "Utilisez les capacités de {{Runtime}} pour surveiller les modifications des images JPEG intégrées dans vos applications {{ProgLang}}. Générez des rapports informatifs qui améliorent la prise de décision."
    },
    "about": {
      "title": "Débloquez les capacités de {{ProdFullName}}",
      "content": "Utilisez l'API {{ProdFullName}} pour analyser les modifications apportées aux images JPEG avec précision. Extrayez facilement des informations à l'aide de votre environnement {{ProgLang}}, en rationalisant les processus métier avec un minimum d'effort."
    },
    "steps": {
      "title": "Étapes pour comparer les images JPEG dans {{ProgLang}}",
      "content": {
        "title": "Utilisez [{{ProdShortName}}]({{ProductUrl}}) pour discerner et gérer les écarts JPEG.",
        "step_1": "Installez {{ProdShortName}} via [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Lancez une instance de comparaison avec le chemin d’accès à votre fichier JPEG.",
        "step_3": "Incorporez un autre fichier JPEG pour évaluation.",
        "step_4": "Créez un rapport complet décrivant les comparaisons au format JPEG."
      },
      "code": {
        "comments": {
          "comment_1": "Générez un rapport détaillé mettant en évidence les différences JPEG.",
          "comment_2": "Créez une instance Comparer initialisée avec la première image JPEG.",
          "comment_3": "Incluez toutes les images JPEG supplémentaires pour évaluation.",
          "comment_4": "Rédiger un rapport qui articule les différentes différences observées."
        }
      }
    },
    "formats": {
      "title": "Comparaisons JPEG efficaces à l'aide de {{ProgLang}}",
      "description": "L'API {{ProdFullName}} vous permet de générer des rapports détaillés décrivant les écarts dans les fichiers JPEG, facilitant ainsi la surveillance des changements critiques dans les images professionnelles."
    }
  },
  "jpg": {
    "head": {
      "title": "Comparaison dynamique des images JPG avec la bibliothèque {{Runtime}}",
      "description": "Utilisez l'API {{ProdFullName}} pour identifier et cataloguer facilement les différences dans les images JPG."
    },
    "header": {
      "title": "Générez des informations à partir des différences JPG dans {{EnvName}}",
      "description": "Maximisez le potentiel de {{Runtime}} pour discerner les changements dans les images JPG au sein de vos solutions {{ProgLang}}. Des rapports complets fournissent des informations vitales pour vos opérations stratégiques."
    },
    "about": {
      "title": "Explorez les capacités de l'API {{ProdFullName}}",
      "content": "Restez informé des modifications apportées aux images JPG en utilisant {{ProdFullName}}. Analysez des rapports complets dans vos applications {{ProgLang}}, améliorant ainsi l'efficacité du flux de travail sans nécessiter de codage approfondi."
    },
    "steps": {
      "title": "Analyse comparative des fichiers JPG dans {{ProgLang}}",
      "content": {
        "title": "Utilisez [{{ProdShortName}}]({{ProductUrl}}) pour évaluer les comparaisons d'images JPG.",
        "step_1": "Installez {{ProdShortName}} à partir de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Créez un objet Comparer avec le chemin d'accès à votre premier fichier JPG.",
        "step_3": "Ajoutez des fichiers JPG supplémentaires pour une analyse approfondie.",
        "step_4": "Compiler un rapport détaillant les différences comparatives."
      },
      "code": {
        "comments": {
          "comment_1": "Générez un rapport sur les différences entre les images JPG.",
          "comment_2": "Initialisez Comparer avec l’image JPG principale.",
          "comment_3": "Incorporez d’autres fichiers JPG pour une évaluation approfondie.",
          "comment_4": "Documentez les différences détaillées dans un rapport."
        }
      }
    },
    "formats": {
      "title": "Comparaisons JPG simplifiées avec {{ProgLang}}",
      "description": "Tirez parti de la bibliothèque {{ProdFullName}} pour différencier rapidement les images JPG. Des rapports complets permettent un suivi efficace des changements dans les actifs essentiels de l'entreprise."
    }
  },
  "xlsx": {
    "head": {
      "title": "Analyser les différences de contenu XLSX à l'aide de l'API {{Runtime}}",
      "description": "Évaluez sans effort les distinctions dans les feuilles de calcul Excel à l'aide de l'API {{Runtime}}, qui fournit des rapports détaillés sur toutes les différences trouvées."
    },
    "header": {
      "title": "Analyse de feuille de calcul XLSX dans {{EnvName}}",
      "description": "Intégrez la bibliothèque de traitement de documents {{Runtime}} pour identifier et mettre en évidence les modifications dans les feuilles de calcul XLSX intégrées aux solutions logicielles {{EnvName}}."
    },
    "about": {
      "title": "Découvrez les avantages de {{ProdShortName}}",
      "content": "Générez des rapports détaillés qui encapsulent les modifications sur plusieurs versions XLSX à l'aide de {{ProdShortName}}. Intégrez sans effort l'API dans vos applications {{EnvName}} avec un minimum d'efforts de codage, en analysant les différences dans les feuilles, les textes et bien plus encore. Améliorez les flux de travail de votre entreprise grâce à nos solutions avancées."
    },
    "steps": {
      "title": "Comparez efficacement les fichiers XLSX dans {{ProgLang}}",
      "content": {
        "title": "Tirez parti de [{{ProdShortName}}]({{ProductUrl}}) et {{EnvName}} pour des comparaisons XLSX robustes",
        "step_1": "Obtenez {{ProdShortName}} pour {{EnvName}} auprès de [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Créez un objet Comparer et saisissez le chemin du document XLSX initial.",
        "step_3": "Ajoutez plus de fichiers XLSX pour des comparaisons complètes.",
        "step_4": "Préparez, examinez et documentez les résultats de vos comparaisons."
      },
      "code": {
        "comments": {
          "comment_1": "Extrayez des rapports qui interprètent les modifications trouvées dans les documents XLSX.",
          "comment_2": "Établissez une nouvelle instance de Comparer avec le fichier XLSX initial.",
          "comment_3": "Incluez des fichiers XLSX supplémentaires à des fins de comparaison.",
          "comment_4": "Enregistrez en toute sécurité les rapports résultants localement."
        }
      }
    },
    "formats": {
      "title": "Comparez efficacement les fichiers XLSX avec {{ProgLang}}",
      "description": "Mettez facilement en évidence les différences clés dans les documents MS Excel XLSX à l'aide de l'API {{ProdFullName}}, fournissant ainsi des informations précieuses sur les données de votre organisation."
    }
  },
  "pptx": {
    "head": {
      "title": "Évaluez les différences PPTX à l'aide de {{EnvName}} avec {{ProdFullName}}",
      "description": "Examinez facilement les modifications apportées aux présentations PPTX, en générant des rapports précis reflétant les variations de contenu."
    },
    "header": {
      "title": "Comparaison efficace des présentations PPTX dans {{EnvName}}",
      "description": "Utilisez les capacités de traitement de documents de {{Runtime}} pour identifier et signaler les variations dans les présentations PPTX dans vos applications {{EnvName}}, optimisant ainsi votre flux de travail."
    },
    "about": {
      "title": "Découvrez les fonctionnalités clés de {{ProdFullName}}",
      "content": "Créez des rapports complets détaillant les modifications apportées aux différentes versions de PPTX avec {{ProdShortName}}. Implémentez cette solution de manière transparente dans vos applications {{EnvName}} et analysez les différences dans les diapositives, les textes et les formats. Fusionnez les variantes dans des fichiers PPTX consolidés pour améliorer vos efforts commerciaux."
    },
    "steps": {
      "title": "Documenter les différences PPTX dans {{ProgLang}}",
      "content": {
        "title": "Appliquez [{{ProdShortName}}]({{ProductUrl}}) pour comparer les présentations PPTX",
        "step_1": "Acquérir {{ProdShortName}} via [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Construisez une instance Comparer pour la première présentation PPTX.",
        "step_3": "Ajoutez d'autres fichiers PPTX pour des comparaisons complètes.",
        "step_4": "Compilez les résultats et examinez le rapport généré."
      },
      "code": {
        "comments": {
          "comment_1": "Recueillez des données sur les changements trouvés dans les présentations PPTX.",
          "comment_2": "Initialisez Comparer avec la première entrée du fichier PPTX.",
          "comment_3": "Incorporez d’autres fichiers PPTX pour une comparaison robuste.",
          "comment_4": "Documentez les résultats générés en toute sécurité."
        }
      }
    },
    "formats": {
      "title": "Facilitez la comparaison PPTX à l’aide de {{ProgLang}}",
      "description": "Gérez et comparez facilement les présentations MS PowerPoint PPTX avec {{ProdFullName}} pour générer des rapports perspicaces reflétant les changements dans les présentations commerciales essentielles."
    }
  }
}