{
  "common": {
    "head": {
      "title": "Confronta in modo efficiente {{FileFormatUp}} utilizzando la libreria {{ProgLang}}",
      "description": "Con {{ProdFullName}}, genera report comparativi approfonditi su misura per le applicazioni {{Runtime}}."
    },
    "header": {
      "title": "Analizza le differenze di {{FileFormatUp}} in {{Runtime}}",
      "description": "{{ProdShortName}} è una libreria progettata per {{Runtime}} che semplifica il processo di confronto ed evidenziazione delle discrepanze nei file {{FileFormatUp}}. Migliora le tue capacità di gestione dei documenti con questa soluzione innovativa.",
      "subtitle": "Strumento avanzato di confronto dei file",
      "action_title": "Ottieni il tuo download gratuito da {{PackageStoreName}}"
    },
    "about": {
      "title": "Esplora le funzionalità di {{ProdFullName}}",
      "content": "{{ProdFullName}} funge da API creata appositamente per confrontare documenti e immagini in vari formati. Identifica le modifiche a parole, paragrafi, caratteri, forme ed elementi di stile tra i documenti. Puoi comodamente unire queste modifiche e salvarle come documento finale consolidato. Supporta un'ampia gamma di formati, inclusi PDF, documenti Word, fogli Excel, presentazioni PowerPoint, Visio, file HTML, immagini e molto altro, il tutto ottenuto senza strumenti di terze parti."
    },
    "steps": {
      "title": "Come confrontare in modo efficiente {{FileFormatUp}} utilizzando {{Runtime}}",
      "content": {
        "title": "Utilizza [{{ProdShortName}}]({{ProductUrl}}) per eseguire confronti dettagliati sui file {{FileFormatUp}}.",
        "step_1": "Inizia installando {{ProdFullName}} tramite [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Crea un'istanza di un oggetto Comparer con il file {{FileFormatUp}} iniziale.",
        "step_3": "Integra il secondo file {{FileFormatUp}} nel comparatore.",
        "step_4": "Compilare un rapporto dettagliato che delinea tutte le discrepanze identificate."
      },
      "code": {
        "comments": {
          "comment_1": "Confronta più file per vedere somiglianze e differenze.",
          "comment_2": "Inizializza il comparatore e carica il primo file.",
          "comment_3": "Aggiungi altri file per il confronto.",
          "comment_4": "Recupera il rapporto di confronto finale."
        }
      }
    },
    "formats": {
      "title": "Confronta facilmente vari formati di file utilizzando {{ProgLang}}",
      "description": "La nostra API {{Runtime}} consente il confronto semplice di diversi formati di documenti, semplificando il monitoraggio delle modifiche nei documenti."
    }
  },
  "pdf": {
    "head": {
      "title": "Semplifica i confronti tra PDF con la libreria {{ProgLang}}",
      "description": "Il software {{ProdShortName}} per {{Runtime}} crea report approfonditi che evidenziano le variazioni nei documenti PDF."
    },
    "header": {
      "title": "Confronto PDF reso semplice per {{EnvName}}",
      "description": "Utilizza la nostra API di confronto PDF all'interno di {{Runtime}} per individuare in modo efficace e presentare facilmente le discrepanze nei file PDF. Ottieni un accesso rapido a report dettagliati senza inutili complessità."
    },
    "about": {
      "title": "Presentazione delle funzionalità principali della libreria {{ProdFullName}}",
      "content": "Produci report completi che identificano le differenze riscontrate nei documenti PDF direttamente dalle tue applicazioni {{ProgLang}}. Con un codice minimo, sfrutta {{ProdFullName}} senza bisogno di software aggiuntivo. Tieni traccia delle modifiche apportate a paragrafi, parole, formati, forme e stili nei tuoi PDF. Inoltre, combina le revisioni di più versioni in un risultato unificato. Elabora i PDF in modo rapido e semplice."
    },
    "steps": {
      "title": "Genera report sulle differenze PDF con {{ProgLang}}",
      "content": {
        "title": "Monitora le modifiche nei documenti PDF utilizzando i report prodotti da [{{ProdShortName}}]({{ProductUrl}}).",
        "step_1": "Installa {{ProdShortName}} per {{EnvName}} utilizzando [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Crea un'istanza di confronto e inserisci il percorso per il primo file PDF.",
        "step_3": "Introdurre un secondo file PDF destinato al confronto.",
        "step_4": "Estrarre il rapporto finale che chiarisce le variazioni tra i file."
      },
      "code": {
        "comments": {
          "comment_1": "Crea un rapporto dettagliato per mostrare le variazioni nei file PDF.",
          "comment_2": "Crea un oggetto Comparer con il percorso del primo documento PDF.",
          "comment_3": "Incorpora il secondo file o più per un confronto efficace.",
          "comment_4": "Mantieni il report generato nella directory specificata."
        }
      }
    },
    "formats": {
      "title": "Confronta tipi di file comuni come PDF con {{ProgLang}}",
      "description": "La nostra API {{Runtime}} ti consente di confrontare i file PDF in modo rapido e accurato. Monitora facilmente le modifiche attraverso report di confronto dettagliati."
    }
  },
  "docx": {
    "head": {
      "title": "Confronta facilmente i file DOCX utilizzando l'API {{Runtime}}",
      "description": "Tieni traccia e analizza le differenze nei documenti MS Word DOCX con l'API {{ProdShortName}} per {{Runtime}}, producendo report completi che delineano le modifiche."
    },
    "header": {
      "title": "Confronto DOCX per {{EnvName}}",
      "description": "Utilizza la nostra API di elaborazione dei documenti in {{Runtime}} per identificare e riepilogare rapidamente le modifiche nei file MS Word DOCX. Goditi la generazione di report senza soluzione di continuità all'interno delle tue applicazioni."
    },
    "about": {
      "title": "Esplora le funzionalità di {{ProdFullName}}",
      "content": "{{ProdShortName}} fornisce approfondimenti approfonditi sulle modifiche nelle diverse versioni dei documenti DOCX. Con poche righe di codice, puoi integrare {{EnvName}} e la nostra API nel tuo flusso di lavoro, senza bisogno di librerie aggiuntive. Determina le modifiche al contenuto, agli stili di testo e ai layout nei documenti di Word. Puoi anche consolidare le variazioni per creare un file DOCX aggiornato. Migliora i tuoi processi di gestione dei documenti con la nostra solida API."
    },
    "steps": {
      "title": "Crea report di confronto DOCX con {{ProgLang}}",
      "content": {
        "title": "Sfrutta [{{ProdShortName}}]({{ProductUrl}}) insieme a {{EnvName}} per valutare le differenze tra i file DOCX.",
        "step_1": "Ottieni {{ProdShortName}} per {{EnvName}} tramite [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Configura un'istanza di Comparer e indirizza il percorso al file DOCX iniziale.",
        "step_3": "Aggiungi ulteriori file DOCX secondo necessità per l'analisi comparativa.",
        "step_4": "Valuta il report generato e rivedi i risultati."
      },
      "code": {
        "comments": {
          "comment_1": "Ottieni informazioni dettagliate sulle modifiche apportate ai file DOCX.",
          "comment_2": "Inizializza il comparatore utilizzando il primo file DOCX come riferimento.",
          "comment_3": "Includi file DOCX aggiuntivi per un confronto approfondito.",
          "comment_4": "Archiviare il rapporto di confronto secondo necessità."
        }
      }
    },
    "formats": {
      "title": "Confronta qualsiasi documento DOCX con {{ProgLang}}",
      "description": "Utilizza {{ProdFullName}} per analizzare qualsiasi file MS Word DOCX, acquisendo preziose conoscenze sulle revisioni dei documenti."
    }
  },
  "png": {
    "head": {
      "title": "Confronta le immagini PNG utilizzando l'API {{ProgLang}}",
      "description": "La libreria {{ProdFullName}} produce report dettagliati che rivelano le differenze tra i file di immagine PNG."
    },
    "header": {
      "title": "Analizza le immagini PNG in {{Runtime}}",
      "description": "Sfrutta l'API {{Runtime}} per scoprire facilmente le discrepanze nei file PNG all'interno delle tue applicazioni {{ProgLang}}. Ricevi report completi senza sforzo."
    },
    "about": {
      "title": "Esplora le funzionalità dell'API {{ProdFullName}}",
      "content": "Genera report approfonditi che dettagliano le discrepanze tra le versioni delle immagini PNG direttamente nelle tue applicazioni {{ProgLang}}, senza fare affidamento su software aggiuntivo. Rimani aggiornato su tutte le modifiche che coinvolgono le tue immagini PNG."
    },
    "steps": {
      "title": "Genera report di confronto per immagini PNG con {{ProgLang}}",
      "content": {
        "title": "Monitora le modifiche nei file PNG utilizzando [{{ProdShortName}}]({{ProductUrl}}) e crea facilmente report.",
        "step_1": "Ottieni il pacchetto {{ProdShortName}} tramite [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Crea un'istanza di un comparatore e inserisci il percorso per la prima immagine PNG.",
        "step_3": "Includi uno o più file PNG per uno studio comparativo.",
        "step_4": "Accedi a un report completo che dettaglia tutte le discrepanze visive."
      },
      "code": {
        "comments": {
          "comment_1": "Crea un report che documenti le modifiche tra le immagini PNG.",
          "comment_2": "Inizializza il Comparer con il primo file PNG da avviare.",
          "comment_3": "Integra file PNG aggiuntivi per un confronto approfondito.",
          "comment_4": "Archiviare o visualizzare il report che riflette tutte le modifiche identificate."
        }
      }
    },
    "formats": {
      "title": "Confronta immagini in formati come PNG",
      "description": "Utilizza {{ProdFullName}} per individuare le differenze tra le immagini PNG, generando report dettagliati per tenere traccia delle modifiche significative."
    }
  },
  "jpeg": {
    "head": {
      "title": "Automatizza i confronti JPEG con la libreria {{Runtime}}",
      "description": "L'API {{ProdFullName}} ti consente di rilevare e documentare facilmente le differenze nelle immagini JPEG."
    },
    "header": {
      "title": "Confronta facilmente le immagini JPEG con {{EnvName}}",
      "description": "Utilizza le funzionalità di {{Runtime}} per monitorare le alterazioni nelle immagini JPEG integrate nelle tue applicazioni {{ProgLang}}. Genera report informativi che migliorano il processo decisionale."
    },
    "about": {
      "title": "Sblocca le funzionalità di {{ProdFullName}}",
      "content": "Utilizza l'API {{ProdFullName}} per analizzare con precisione le modifiche nelle immagini JPEG. Estrai comodamente informazioni approfondite utilizzando il tuo ambiente {{ProgLang}}, semplificando i processi aziendali con il minimo sforzo."
    },
    "steps": {
      "title": "Passaggi per confrontare le immagini JPEG in {{ProgLang}}",
      "content": {
        "title": "Utilizza [{{ProdShortName}}]({{ProductUrl}}) per individuare e gestire le discrepanze JPEG.",
        "step_1": "Installa {{ProdShortName}} tramite [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Avvia un'istanza di confronto con il percorso del tuo file JPEG.",
        "step_3": "Incorporare un altro file JPEG per la valutazione.",
        "step_4": "Crea un rapporto completo che descriva i confronti in formato JPEG."
      },
      "code": {
        "comments": {
          "comment_1": "Genera un rapporto dettagliato che evidenzia le differenze JPEG.",
          "comment_2": "Crea un'istanza di Comparer inizializzata con la prima immagine JPEG.",
          "comment_3": "Includere eventuali immagini JPEG aggiuntive per la valutazione.",
          "comment_4": "Compilare un rapporto che articoli le varie differenze osservate."
        }
      }
    },
    "formats": {
      "title": "Confronti JPEG efficienti utilizzando {{ProgLang}}",
      "description": "L'API {{ProdFullName}} ti consente di generare report dettagliati che delineano le variazioni nei file JPEG, semplificando il monitoraggio dei cambiamenti critici nelle immagini aziendali."
    }
  },
  "jpg": {
    "head": {
      "title": "Confronto dinamico di immagini JPG con la libreria {{Runtime}}",
      "description": "Utilizza l'API {{ProdFullName}} per individuare e catalogare facilmente le differenze nelle immagini JPG."
    },
    "header": {
      "title": "Genera approfondimenti dalle differenze JPG in {{EnvName}}",
      "description": "Massimizza il potenziale di {{Runtime}} per individuare i cambiamenti nelle immagini JPG all'interno delle tue soluzioni {{ProgLang}}. Rapporti completi forniscono informazioni vitali per le vostre operazioni strategiche."
    },
    "about": {
      "title": "Esplora le funzionalità dell'API {{ProdFullName}}",
      "content": "Tieniti informato sulle modifiche alle immagini JPG utilizzando {{ProdFullName}}. Analizza report completi all'interno delle tue applicazioni {{ProgLang}}, migliorando l'efficienza del flusso di lavoro senza richiedere una codifica estesa."
    },
    "steps": {
      "title": "Analisi comparativa dei file JPG in {{ProgLang}}",
      "content": {
        "title": "Utilizza [{{ProdShortName}}]({{ProductUrl}}) per valutare i confronti delle immagini JPG.",
        "step_1": "Installa {{ProdShortName}} da [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Crea un oggetto Comparer con il percorso del tuo primo file JPG.",
        "step_3": "Aggiungi ulteriori file JPG per un'analisi approfondita.",
        "step_4": "Compilare un rapporto che dettaglia le differenze comparative."
      },
      "code": {
        "comments": {
          "comment_1": "Condurre una generazione di report per le differenze delle immagini JPG.",
          "comment_2": "Inizializza Comparer con l'immagine JPG primaria.",
          "comment_3": "Incorpora altri file JPG per una valutazione approfondita.",
          "comment_4": "Documentare le differenze dettagliate in un report."
        }
      }
    },
    "formats": {
      "title": "Confronti JPG semplificati con {{ProgLang}}",
      "description": "Sfrutta la libreria {{ProdFullName}} per distinguere rapidamente le immagini JPG. Report completi consentono un monitoraggio efficiente dei cambiamenti nelle risorse aziendali essenziali."
    }
  },
  "xlsx": {
    "head": {
      "title": "Analizza le differenze nei contenuti XLSX utilizzando l'API {{Runtime}}",
      "description": "Valuta facilmente le distinzioni nei fogli di calcolo Excel utilizzando l'API {{Runtime}}, che fornisce report approfonditi su tutte le differenze rilevate."
    },
    "header": {
      "title": "Analisi del foglio di calcolo XLSX all'interno di {{EnvName}}",
      "description": "Incorpora la libreria di elaborazione dei documenti {{Runtime}} per identificare ed evidenziare le modifiche nei fogli di calcolo XLSX integrati nelle soluzioni software {{EnvName}}."
    },
    "about": {
      "title": "Prova i vantaggi di {{ProdShortName}}",
      "content": "Genera report approfonditi che incapsulano le modifiche su più versioni XLSX utilizzando {{ProdShortName}}. Incorpora facilmente l'API nelle tue applicazioni {{EnvName}} con sforzi di codifica minimi, analizzando le differenze in fogli, testi e altro ancora. Migliora i flussi di lavoro aziendali con le nostre soluzioni avanzate."
    },
    "steps": {
      "title": "Confronta i file XLSX in modo efficiente in {{ProgLang}}",
      "content": {
        "title": "Sfrutta [{{ProdShortName}}]({{ProductUrl}}) e {{EnvName}} per confronti XLSX affidabili",
        "step_1": "Ottieni {{ProdShortName}} per {{EnvName}} da [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Crea un oggetto Comparer e inserisci il percorso per il documento XLSX iniziale.",
        "step_3": "Aggiungi altri file XLSX per confronti completi.",
        "step_4": "Preparare, rivedere e documentare i risultati dei confronti."
      },
      "code": {
        "comments": {
          "comment_1": "Estrai report che interpretano le modifiche trovate nei documenti XLSX.",
          "comment_2": "Stabilisci una nuova istanza di Comparer con il file XLSX iniziale.",
          "comment_3": "Includere file XLSX supplementari per scopi comparativi.",
          "comment_4": "Salva in modo sicuro i report risultanti localmente."
        }
      }
    },
    "formats": {
      "title": "Confronta i file XLSX in modo efficiente con {{ProgLang}}",
      "description": "Evidenzia facilmente le differenze chiave nei documenti MS Excel XLSX utilizzando l'API {{ProdFullName}}, fornendo informazioni preziose sui dati della tua organizzazione."
    }
  },
  "pptx": {
    "head": {
      "title": "Valuta le differenze PPTX utilizzando {{EnvName}} con {{ProdFullName}}",
      "description": "Esamina con facilità le modifiche nelle presentazioni PPTX, generando report precisi che riflettono le variazioni dei contenuti."
    },
    "header": {
      "title": "Confronto efficiente delle presentazioni PPTX in {{EnvName}}",
      "description": "Utilizza le funzionalità di elaborazione dei documenti di {{Runtime}} per identificare e segnalare variazioni all'interno delle presentazioni PPTX nelle tue applicazioni {{EnvName}}, ottimizzando il tuo flusso di lavoro."
    },
    "about": {
      "title": "Scopri le funzionalità chiave di {{ProdFullName}}",
      "content": "Crea report completi che dettagliano le modifiche nelle varie versioni PPTX con {{ProdShortName}}. Implementa senza problemi questa soluzione nelle tue applicazioni {{EnvName}} e analizza le differenze in diapositive, testi e formati. Unisci le varianti in file PPTX consolidati per migliorare i tuoi sforzi aziendali."
    },
    "steps": {
      "title": "Documentare le differenze PPTX in {{ProgLang}}",
      "content": {
        "title": "Applica [{{ProdShortName}}]({{ProductUrl}}) per confrontare le presentazioni PPTX",
        "step_1": "Acquisisci {{ProdShortName}} tramite [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Costruisci un'istanza di Comparer per la prima presentazione PPTX.",
        "step_3": "Aggiungi ulteriori file PPTX per confronti completi.",
        "step_4": "Compilare i risultati ed esaminare il report generato."
      },
      "code": {
        "comments": {
          "comment_1": "Raccogli dati sulle modifiche rilevate nelle presentazioni PPTX.",
          "comment_2": "Inizializza Comparer con il primo input di file PPTX.",
          "comment_3": "Incorpora altri file PPTX per un confronto affidabile.",
          "comment_4": "Documentare i risultati generati in modo sicuro."
        }
      }
    },
    "formats": {
      "title": "Facilita il confronto PPTX utilizzando {{ProgLang}}",
      "description": "Gestisci e confronta facilmente le presentazioni MS PowerPoint PPTX con {{ProdFullName}} per generare report approfonditi che riflettono i cambiamenti all'interno delle presentazioni aziendali cruciali."
    }
  }
}