{
  "common": {
    "head": {
      "title": "Compare {{FileFormatUp}} com eficiência usando a biblioteca {{ProgLang}}",
      "description": "Com {{ProdFullName}}, gere relatórios de comparação detalhados personalizados para aplicativos {{Runtime}}."
    },
    "header": {
      "title": "Analise diferenças de {{FileFormatUp}} em {{Runtime}}",
      "description": "{{ProdShortName}} é uma biblioteca projetada para {{Runtime}} que simplifica o processo de comparação e destaque de discrepâncias em arquivos {{FileFormatUp}}. Melhore as suas capacidades de tratamento de documentos com esta solução inovadora.",
      "subtitle": "Ferramenta avançada de comparação de arquivos",
      "action_title": "Obtenha seu download gratuito em {{PackageStoreName}}"
    },
    "about": {
      "title": "Explore os recursos de {{ProdFullName}}",
      "content": "{{ProdFullName}} serve como uma API construída especificamente para comparar documentos e imagens em vários formatos. Ele identifica alterações em palavras, parágrafos, caracteres, formas e elementos de estilo entre os documentos. Você pode mesclar essas modificações de maneira conveniente e salvá-las como um documento final consolidado. Ele suporta uma ampla variedade de formatos, incluindo PDFs, documentos do Word, planilhas do Excel, apresentações do PowerPoint, Visio, arquivos HTML, imagens e muito mais – tudo isso sem ferramentas de terceiros."
    },
    "steps": {
      "title": "Como comparar {{FileFormatUp}} com eficiência usando {{Runtime}}",
      "content": {
        "title": "Utilize [{{ProdShortName}}]({{ProductUrl}}) para realizar comparações detalhadas em arquivos {{FileFormatUp}}.",
        "step_1": "Comece instalando {{ProdFullName}} por meio de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Instancie um objeto Comparer com o arquivo {{FileFormatUp}} inicial.",
        "step_3": "Integre o segundo arquivo {{FileFormatUp}} ao Comparador.",
        "step_4": "Compile um relatório detalhado delineando todas as discrepâncias identificadas."
      },
      "code": {
        "comments": {
          "comment_1": "Compare vários arquivos para ver semelhanças e diferenças.",
          "comment_2": "Inicialize o Comparador e carregue o primeiro arquivo.",
          "comment_3": "Adicione arquivos adicionais para comparação.",
          "comment_4": "Recuperar o relatório de comparação final."
        }
      }
    },
    "formats": {
      "title": "Compare perfeitamente vários formatos de arquivo usando {{ProgLang}}",
      "description": "Nossa API {{Runtime}} permite a comparação fácil de diversos formatos de documentos, simplificando o rastreamento de alterações nos documentos."
    }
  },
  "pdf": {
    "head": {
      "title": "Simplifique comparações de PDF com a biblioteca {{ProgLang}}",
      "description": "O software {{ProdShortName}} para {{Runtime}} cria relatórios completos que destacam variações em documentos PDF."
    },
    "header": {
      "title": "Comparação de PDF facilitada para {{EnvName}}",
      "description": "Utilize nossa API de comparação de PDF no {{Runtime}} para identificar e apresentar discrepâncias em arquivos PDF com eficiência e facilidade. Obtenha acesso rápido a relatórios detalhados sem complexidade desnecessária."
    },
    "about": {
      "title": "Revelando os principais recursos da biblioteca {{ProdFullName}}",
      "content": "Produza relatórios abrangentes identificando diferenças encontradas em documentos PDF diretamente de seus aplicativos {{ProgLang}}. Com o mínimo de código, aproveite o {{ProdFullName}} sem precisar de software adicional. Acompanhe alterações em parágrafos, palavras, formatos, formas e estilos em seus PDFs. Além disso, combine revisões de diversas versões em um resultado unificado. Processe PDFs com rapidez e facilidade."
    },
    "steps": {
      "title": "Gere relatórios de diferenças em PDF com {{ProgLang}}",
      "content": {
        "title": "Monitore alterações em documentos PDF usando relatórios produzidos por [{{ProdShortName}}]({{ProductUrl}}).",
        "step_1": "Instale {{ProdShortName}} para {{EnvName}} usando [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Crie uma instância do Comparer e insira o caminho para o primeiro arquivo PDF.",
        "step_3": "Apresente um segundo arquivo PDF destinado à comparação.",
        "step_4": "Extraia o relatório final que elucida as variações entre os arquivos."
      },
      "code": {
        "comments": {
          "comment_1": "Crie um relatório detalhado para mostrar variações em arquivos PDF.",
          "comment_2": "Crie um objeto Comparer com o caminho para o primeiro documento PDF.",
          "comment_3": "Incorpore o segundo arquivo ou mais para uma comparação eficaz.",
          "comment_4": "Persista o relatório gerado no diretório especificado."
        }
      }
    },
    "formats": {
      "title": "Compare tipos de arquivos comuns como PDF com {{ProgLang}}",
      "description": "Nossa API {{Runtime}} permite comparar arquivos PDF com rapidez e precisão. Monitore facilmente as alterações por meio de relatórios de comparação detalhados."
    }
  },
  "docx": {
    "head": {
      "title": "Compare facilmente arquivos DOCX usando a API {{Runtime}}",
      "description": "Rastreie e analise diferenças em documentos MS Word DOCX com a API {{ProdShortName}} para {{Runtime}}, produzindo relatórios abrangentes que descrevem as alterações."
    },
    "header": {
      "title": "Comparação DOCX para {{EnvName}}",
      "description": "Utilize nossa API de processamento de documentos em {{Runtime}} para identificar e resumir rapidamente alterações em arquivos DOCX do MS Word. Aproveite a geração contínua de relatórios em seus aplicativos."
    },
    "about": {
      "title": "Explore os recursos de {{ProdFullName}}",
      "content": "{{ProdShortName}} oferece insights abrangentes sobre alterações em diferentes versões de documentos DOCX. Com algumas linhas de código, você pode integrar {{EnvName}} e nossa API ao seu fluxo de trabalho, sem a necessidade de bibliotecas extras. Determine alterações no conteúdo, estilos de texto e layouts em documentos do Word. Você pode até consolidar variações para criar um arquivo DOCX atualizado. Eleve seus processos de gerenciamento de documentos com nossa API robusta."
    },
    "steps": {
      "title": "Crie relatórios de comparação DOCX com {{ProgLang}}",
      "content": {
        "title": "Aproveite [{{ProdShortName}}]({{ProductUrl}}) junto com {{EnvName}} para avaliar as diferenças dos arquivos DOCX.",
        "step_1": "Obtenha {{ProdShortName}} para {{EnvName}} por meio de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Configure uma instância do Comparer e direcione o caminho para o arquivo DOCX inicial.",
        "step_3": "Adicione mais arquivos DOCX conforme necessário para análise comparativa.",
        "step_4": "Avalie o relatório gerado e revise suas descobertas."
      },
      "code": {
        "comments": {
          "comment_1": "Obtenha informações detalhadas sobre as alterações feitas nos arquivos DOCX.",
          "comment_2": "Inicialize o Comparador usando o primeiro arquivo DOCX para referência.",
          "comment_3": "Inclua arquivos DOCX adicionais para comparação completa.",
          "comment_4": "Arquive o relatório de comparação conforme necessário."
        }
      }
    },
    "formats": {
      "title": "Compare qualquer documento DOCX com {{ProgLang}}",
      "description": "Utilize {{ProdFullName}} para analisar qualquer arquivo DOCX do MS Word, obtendo conhecimento valioso sobre revisões de documentos."
    }
  },
  "png": {
    "head": {
      "title": "Compare imagens PNG usando a API {{ProgLang}}",
      "description": "A biblioteca {{ProdFullName}} produz relatórios detalhados que revelam diferenças entre arquivos de imagem PNG."
    },
    "header": {
      "title": "Analise imagens PNG em {{Runtime}}",
      "description": "Aproveite a API {{Runtime}} para descobrir discrepâncias em arquivos PNG perfeitamente em seus aplicativos {{ProgLang}}. Receba relatórios abrangentes sem esforço."
    },
    "about": {
      "title": "Explore os recursos da API {{ProdFullName}}",
      "content": "Gere relatórios completos detalhando discrepâncias entre versões de imagens PNG diretamente em seus aplicativos {{ProgLang}}, sem depender de software adicional. Fique atualizado sobre todas as mudanças envolvendo suas imagens PNG."
    },
    "steps": {
      "title": "Gere relatórios de comparação para imagens PNG com {{ProgLang}}",
      "content": {
        "title": "Monitore alterações em arquivos PNG usando [{{ProdShortName}}]({{ProductUrl}}) e crie relatórios sem esforço.",
        "step_1": "Obtenha o pacote {{ProdShortName}} por meio de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Instancie um Comparador e insira o caminho para a primeira imagem PNG.",
        "step_3": "Inclua um ou mais arquivos PNG para um estudo comparativo.",
        "step_4": "Acesse um relatório abrangente detalhando todas as discrepâncias visuais."
      },
      "code": {
        "comments": {
          "comment_1": "Crie um relatório que documente as alterações entre imagens PNG.",
          "comment_2": "Inicialize o Comparador com o primeiro arquivo PNG a ser iniciado.",
          "comment_3": "Integre arquivos PNG adicionais para comparação detalhada.",
          "comment_4": "Armazene ou exiba o relatório refletindo todas as alterações identificadas."
        }
      }
    },
    "formats": {
      "title": "Compare imagens em formatos como PNG",
      "description": "Use {{ProdFullName}} para identificar diferenças entre imagens PNG, gerando relatórios detalhados para rastrear alterações significativas."
    }
  },
  "jpeg": {
    "head": {
      "title": "Automatize comparações de JPEG com a biblioteca {{Runtime}}",
      "description": "A API {{ProdFullName}} permite detectar e documentar facilmente diferenças em imagens JPEG."
    },
    "header": {
      "title": "Compare perfeitamente imagens JPEG com {{EnvName}}",
      "description": "Utilize os recursos do {{Runtime}} para monitorar alterações em imagens JPEG integradas em seus aplicativos {{ProgLang}}. Gere relatórios informativos que melhoram a tomada de decisões."
    },
    "about": {
      "title": "Desbloquear recursos de {{ProdFullName}}",
      "content": "Utilize a API {{ProdFullName}} para analisar alterações em imagens JPEG com precisão. Extraia insights de maneira conveniente usando seu ambiente {{ProgLang}}, simplificando os processos de negócios com o mínimo de esforço."
    },
    "steps": {
      "title": "Etapas para comparar imagens JPEG em {{ProgLang}}",
      "content": {
        "title": "Empregue [{{ProdShortName}}]({{ProductUrl}}) para discernir e gerenciar discrepâncias de JPEG.",
        "step_1": "Instale {{ProdShortName}} por meio de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Inicie uma instância de comparação com o caminho para o seu arquivo JPEG.",
        "step_3": "Incorpore outro arquivo JPEG para avaliação.",
        "step_4": "Crie um relatório abrangente descrevendo as comparações em formato JPEG."
      },
      "code": {
        "comments": {
          "comment_1": "Gere um relatório detalhado destacando as diferenças de JPEG.",
          "comment_2": "Crie uma instância do Comparer inicializada com a primeira imagem JPEG.",
          "comment_3": "Inclua quaisquer imagens JPEG adicionais para avaliação.",
          "comment_4": "Compile um relatório que articule as diversas diferenças observadas."
        }
      }
    },
    "formats": {
      "title": "Comparações JPEG eficientes usando {{ProgLang}}",
      "description": "A API {{ProdFullName}} permite gerar relatórios detalhados descrevendo variações em arquivos JPEG, simplificando o monitoramento de alterações críticas em imagens comerciais."
    }
  },
  "jpg": {
    "head": {
      "title": "Comparação dinâmica de imagens JPG com biblioteca {{Runtime}}",
      "description": "Utilize a API {{ProdFullName}} para identificar e catalogar diferenças em imagens JPG com facilidade."
    },
    "header": {
      "title": "Gere insights a partir de diferenças de JPG em {{EnvName}}",
      "description": "Maximize o potencial do {{Runtime}} para discernir alterações em imagens JPG em suas soluções {{ProgLang}}. Relatórios abrangentes fornecem informações vitais para suas operações estratégicas."
    },
    "about": {
      "title": "Explore os recursos da API {{ProdFullName}}",
      "content": "Mantenha-se informado sobre alterações em imagens JPG usando {{ProdFullName}}. Analise relatórios abrangentes em seus aplicativos {{ProgLang}}, melhorando a eficiência do fluxo de trabalho sem exigir codificação extensa."
    },
    "steps": {
      "title": "Análise comparativa de arquivos JPG em {{ProgLang}}",
      "content": {
        "title": "Utilize [{{ProdShortName}}]({{ProductUrl}}) para avaliar comparações de imagens JPG.",
        "step_1": "Instale {{ProdShortName}} de [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Crie um objeto Comparer com o caminho para seu primeiro arquivo JPG.",
        "step_3": "Adicione arquivos JPG adicionais para análise completa.",
        "step_4": "Compile um relatório detalhando as diferenças comparativas."
      },
      "code": {
        "comments": {
          "comment_1": "Conduza uma geração de relatório para diferenças de imagens JPG.",
          "comment_2": "Inicialize o Comparer com a imagem JPG primária.",
          "comment_3": "Incorpore outros arquivos JPG para uma avaliação completa.",
          "comment_4": "Documente diferenças detalhadas em um relatório."
        }
      }
    },
    "formats": {
      "title": "Comparações simplificadas de JPG com {{ProgLang}}",
      "description": "Aproveite a biblioteca {{ProdFullName}} para diferenciar rapidamente imagens JPG. Relatórios abrangentes permitem o rastreamento eficiente de mudanças em ativos comerciais essenciais."
    }
  },
  "xlsx": {
    "head": {
      "title": "Analise as diferenças de conteúdo XLSX usando a API {{Runtime}}",
      "description": "Avalie facilmente as distinções em planilhas do Excel utilizando a API {{Runtime}}, que fornece relatórios completos sobre todas as diferenças encontradas."
    },
    "header": {
      "title": "Análise de planilha XLSX em {{EnvName}}",
      "description": "Incorpore a biblioteca de processamento de documentos {{Runtime}} para identificar e destacar alterações em planilhas XLSX integradas às soluções de software {{EnvName}}."
    },
    "about": {
      "title": "Experimente as vantagens de {{ProdShortName}}",
      "content": "Gere relatórios detalhados que encapsulam alterações em várias versões XLSX usando {{ProdShortName}}. Incorpore facilmente a API em seus aplicativos {{EnvName}} com esforços mínimos de codificação, analisando diferenças em planilhas, textos e muito mais. Aprimore seus fluxos de trabalho de negócios com nossas soluções avançadas."
    },
    "steps": {
      "title": "Compare arquivos XLSX com eficiência em {{ProgLang}}",
      "content": {
        "title": "Aproveite [{{ProdShortName}}]({{ProductUrl}}) e {{EnvName}} para comparações robustas de XLSX",
        "step_1": "Obtenha {{ProdShortName}} para {{EnvName}} em [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Crie um objeto Comparer e insira o caminho para o documento XLSX inicial.",
        "step_3": "Adicione mais arquivos XLSX para comparações abrangentes.",
        "step_4": "Prepare, revise e documente os resultados de suas comparações."
      },
      "code": {
        "comments": {
          "comment_1": "Extraia relatórios que interpretam alterações encontradas em documentos XLSX.",
          "comment_2": "Estabeleça uma nova instância do Comparer com o arquivo XLSX inicial.",
          "comment_3": "Inclua arquivos XLSX suplementares para fins comparativos.",
          "comment_4": "Salve localmente os relatórios resultantes com segurança."
        }
      }
    },
    "formats": {
      "title": "Compare arquivos XLSX de maneira eficiente com {{ProgLang}}",
      "description": "Destaque facilmente as principais diferenças em documentos MS Excel XLSX usando a API {{ProdFullName}}, fornecendo insights valiosos sobre seus dados organizacionais."
    }
  },
  "pptx": {
    "head": {
      "title": "Avalie as diferenças PPTX usando {{EnvName}} com {{ProdFullName}}",
      "description": "Examine as alterações nas apresentações PPTX com facilidade, gerando relatórios precisos que refletem as variações de conteúdo."
    },
    "header": {
      "title": "Comparação eficiente de apresentações PPTX em {{EnvName}}",
      "description": "Utilize os recursos de processamento de documentos do {{Runtime}} para identificar e relatar variações nas apresentações PPTX em seus aplicativos {{EnvName}}, otimizando seu fluxo de trabalho."
    },
    "about": {
      "title": "Descubra as principais funcionalidades do {{ProdFullName}}",
      "content": "Crie relatórios abrangentes que detalham as alterações em várias versões do PPTX com {{ProdShortName}}. Implemente perfeitamente esta solução em seus aplicativos {{EnvName}} e analise diferenças em slides, textos e formatos. Mescle variações em arquivos PPTX consolidados para aprimorar seus esforços de negócios."
    },
    "steps": {
      "title": "Documentando diferenças PPTX em {{ProgLang}}",
      "content": {
        "title": "Aplique [{{ProdShortName}}]({{ProductUrl}}) para comparar apresentações PPTX",
        "step_1": "Adquira {{ProdShortName}} por meio de [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Construa uma instância do Comparer para a primeira apresentação PPTX.",
        "step_3": "Adicione mais arquivos PPTX para comparações completas.",
        "step_4": "Compile as descobertas e revise o relatório gerado."
      },
      "code": {
        "comments": {
          "comment_1": "Reúna dados sobre alterações encontradas em apresentações PPTX.",
          "comment_2": "Inicialize o Comparer com a primeira entrada do arquivo PPTX.",
          "comment_3": "Incorpore outros arquivos PPTX para comparação robusta.",
          "comment_4": "Documente os resultados gerados com segurança."
        }
      }
    },
    "formats": {
      "title": "Facilite a comparação PPTX usando {{ProgLang}}",
      "description": "Gerencie e compare facilmente apresentações PPTX do MS PowerPoint com {{ProdFullName}} para gerar relatórios esclarecedores que refletem as mudanças nas principais apresentações de negócios."
    }
  }
}