{
  "common": {
    "head": {
      "title": "Эффективное сравнение {{FileFormatUp}} с использованием библиотеки {{ProgLang}}",
      "description": "С помощью {{ProdFullName}} создавайте подробные отчеты сравнения, адаптированные для приложений {{Runtime}}."
    },
    "header": {
      "title": "Анализ различий {{FileFormatUp}} в {{Runtime}}",
      "description": "{{ProdShortName}} — это библиотека, разработанная для {{Runtime}}, которая упрощает процесс сравнения и выделения несоответствий в файлах {{FileFormatUp}}. Расширьте свои возможности обработки документов с помощью этого инновационного решения.",
      "subtitle": "Расширенный инструмент сравнения файлов",
      "action_title": "Получите бесплатную загрузку из {{PackageStoreName}}."
    },
    "about": {
      "title": "Изучите возможности {{ProdFullName}}",
      "content": "{{ProdFullName}} — API, специально созданный для сравнения документов и изображений в различных форматах. Он определяет изменения в словах, абзацах, символах, фигурах и элементах стиля между документами. Вы можете удобно объединить эти изменения и сохранить их как единый итоговый документ. Он поддерживает широкий спектр форматов, включая PDF-файлы, документы Word, таблицы Excel, презентации PowerPoint, Visio, HTML-файлы, изображения и многое другое — и все это достигается без сторонних инструментов."
    },
    "steps": {
      "title": "Как эффективно сравнивать {{FileFormatUp}} с помощью {{Runtime}}",
      "content": {
        "title": "Используйте [{{ProdShortName}}]({{ProductUrl}}) для детального сравнения файлов {{FileFormatUp}}.",
        "step_1": "Начните с установки {{ProdFullName}} через [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Создайте экземпляр объекта Comparer с исходным файлом {{FileFormatUp}}.",
        "step_3": "Интегрируйте второй файл {{FileFormatUp}} в средство сравнения.",
        "step_4": "Составьте подробный отчет с указанием всех выявленных несоответствий."
      },
      "code": {
        "comments": {
          "comment_1": "Сравните несколько файлов, чтобы увидеть сходства и различия.",
          "comment_2": "Инициализируйте Comparer и загрузите первый файл.",
          "comment_3": "Добавьте дополнительные файлы для сравнения.",
          "comment_4": "Получите окончательный отчет о сравнении."
        }
      }
    },
    "formats": {
      "title": "Легко сравнивайте различные форматы файлов с помощью {{ProgLang}}",
      "description": "Наш API {{Runtime}} позволяет легко сравнивать различные форматы документов, упрощая отслеживание изменений в документах."
    }
  },
  "pdf": {
    "head": {
      "title": "Оптимизируйте сравнение PDF-файлов с помощью библиотеки {{ProgLang}}",
      "description": "Программное обеспечение {{ProdShortName}} для {{Runtime}} создает подробные отчеты, в которых подчеркиваются различия в документах PDF."
    },
    "header": {
      "title": "Сравнение PDF-файлов стало проще для {{EnvName}}",
      "description": "Используйте наш API сравнения PDF-файлов в {{Runtime}}, чтобы легко и эффективно выявлять и представлять расхождения в файлах PDF. Получите быстрый доступ к подробной отчетности без лишних сложностей."
    },
    "about": {
      "title": "Раскрытие ключевых функций библиотеки {{ProdFullName}}",
      "content": "Создавайте подробные отчеты с указанием различий, обнаруженных в PDF-документах, прямо из приложений {{ProgLang}}. Используя минимальный код, используйте {{ProdFullName}} без необходимости использования дополнительного программного обеспечения. Отслеживайте изменения в абзацах, словах, форматах, формах и стилях ваших PDF-файлов. Кроме того, объединяйте изменения из нескольких версий в единый результат. Обрабатывайте PDF-файлы быстро и легко."
    },
    "steps": {
      "title": "Создавайте отчеты о различиях в формате PDF с помощью {{ProgLang}}",
      "content": {
        "title": "Отслеживайте изменения в документах PDF с помощью отчетов, созданных [{{ProdShortName}}]({{ProductUrl}}).",
        "step_1": "Установите {{ProdShortName}} для {{EnvName}}, используя [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Создайте экземпляр Comparer и введите путь к первому PDF-файлу.",
        "step_3": "Представьте второй PDF-файл, предназначенный для сравнения.",
        "step_4": "Извлеките окончательный отчет, в котором поясняются различия между файлами."
      },
      "code": {
        "comments": {
          "comment_1": "Создайте подробный отчет, чтобы продемонстрировать варианты PDF-файлов.",
          "comment_2": "Создайте объект Comparer с путем к первому PDF-документу.",
          "comment_3": "Включите второй файл или несколько для эффективного сравнения.",
          "comment_4": "Сохраните созданный отчет в указанном вами каталоге."
        }
      }
    },
    "formats": {
      "title": "Сравните распространенные типы файлов, такие как PDF, с помощью {{ProgLang}}.",
      "description": "Наш API {{Runtime}} позволяет быстро и точно сравнивать PDF-файлы. Легко отслеживать изменения с помощью подробных сравнительных отчетов."
    }
  },
  "docx": {
    "head": {
      "title": "Легко сравнивайте файлы DOCX с помощью API {{Runtime}}",
      "description": "Отслеживайте и анализируйте различия в документах MS Word DOCX с помощью API {{ProdShortName}} для {{Runtime}}, создавая подробные отчеты с описанием изменений."
    },
    "header": {
      "title": "Сравнение DOCX для {{EnvName}}",
      "description": "Используйте наш API обработки документов в {{Runtime}}, чтобы быстро идентифицировать и суммировать изменения в файлах MS Word DOCX. Наслаждайтесь плавным созданием отчетов в своих приложениях."
    },
    "about": {
      "title": "Изучите возможности {{ProdFullName}}",
      "content": "{{ProdShortName}} предоставляет обширную информацию об изменениях в различных версиях документов DOCX. С помощью нескольких строк кода вы можете интегрировать {{EnvName}} и наш API в свой рабочий процесс без дополнительных библиотек. Определите изменения в содержимом, стилях текста и макетах в документах Word. Вы даже можете объединить варианты для создания обновленного файла DOCX. Улучшите процессы управления документами с помощью нашего надежного API."
    },
    "steps": {
      "title": "Создавайте сравнительные отчеты DOCX с помощью {{ProgLang}}",
      "content": {
        "title": "Используйте [{{ProdShortName}}]({{ProductUrl}}) вместе с {{EnvName}} для оценки различий в файлах DOCX.",
        "step_1": "Получите {{ProdShortName}} для {{EnvName}} через [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Настройте экземпляр Comparer и укажите путь к исходному файлу DOCX.",
        "step_3": "При необходимости добавьте дополнительные файлы DOCX для сравнительного анализа.",
        "step_4": "Оцените созданный отчет и просмотрите полученные результаты."
      },
      "code": {
        "comments": {
          "comment_1": "Получите подробную информацию об изменениях, внесенных в файлы DOCX.",
          "comment_2": "Инициализируйте программу сравнения, используя для справки первый файл DOCX.",
          "comment_3": "Включите дополнительные файлы DOCX для тщательного сравнения.",
          "comment_4": "При необходимости заархивируйте отчет о сравнении."
        }
      }
    },
    "formats": {
      "title": "Сравните любые документы DOCX с {{ProgLang}}",
      "description": "Используйте {{ProdFullName}} для анализа любого файла MS Word DOCX, получая ценные знания о версиях документов."
    }
  },
  "png": {
    "head": {
      "title": "Сравнение изображений PNG с помощью API {{ProgLang}}",
      "description": "Библиотека {{ProdFullName}} создает подробные отчеты, раскрывающие различия между файлами изображений PNG."
    },
    "header": {
      "title": "Анализ изображений PNG в {{Runtime}}",
      "description": "Воспользуйтесь преимуществами API {{Runtime}}, чтобы легко выявлять несоответствия в файлах PNG в ваших приложениях {{ProgLang}}. Получайте подробные отчеты без особых усилий."
    },
    "about": {
      "title": "Изучите возможности API {{ProdFullName}}.",
      "content": "Создавайте подробные отчеты с подробным описанием расхождений между версиями изображений PNG непосредственно в приложениях {{ProgLang}}, не полагаясь на дополнительное программное обеспечение. Будьте в курсе всех изменений, связанных с вашими изображениями PNG."
    },
    "steps": {
      "title": "Создание отчетов о сравнении изображений PNG с помощью {{ProgLang}}",
      "content": {
        "title": "Отслеживайте изменения в файлах PNG с помощью [{{ProdShortName}}]({{ProductUrl}}) и легко создавайте отчеты.",
        "step_1": "Получите пакет {{ProdShortName}} через [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Создайте экземпляр Comparer и введите путь к первому изображению PNG.",
        "step_3": "Включите один или несколько файлов PNG для сравнительного исследования.",
        "step_4": "Получите доступ к подробному отчету с подробным описанием всех визуальных несоответствий."
      },
      "code": {
        "comments": {
          "comment_1": "Создайте отчет, документирующий изменения между изображениями PNG.",
          "comment_2": "Инициализируйте программу сравнения с первым запускаемым файлом PNG.",
          "comment_3": "Интегрируйте дополнительные файлы PNG для углубленного сравнения.",
          "comment_4": "Сохраните или отобразите отчет, отражающий все выявленные изменения."
        }
      }
    },
    "formats": {
      "title": "Сравнивайте изображения в таких форматах, как PNG",
      "description": "Используйте {{ProdFullName}}, чтобы определить различия между изображениями PNG и создавать подробные отчеты для отслеживания значительных изменений."
    }
  },
  "jpeg": {
    "head": {
      "title": "Автоматизируйте сравнения JPEG с помощью библиотеки {{Runtime}}",
      "description": "API {{ProdFullName}} позволяет вам легко обнаруживать и документировать различия в изображениях JPEG."
    },
    "header": {
      "title": "Легко сравнивайте изображения JPEG с {{EnvName}}",
      "description": "Используйте возможности {{Runtime}} для отслеживания изменений в изображениях JPEG, интегрированных в ваши приложения {{ProgLang}}. Создавайте информативные отчеты, которые ускоряют процесс принятия решений."
    },
    "about": {
      "title": "Разблокируйте возможности {{ProdFullName}}",
      "content": "Используйте API {{ProdFullName}} для точного анализа изменений в изображениях JPEG. Удобно извлекайте ценную информацию с помощью среды {{ProgLang}}, оптимизируя бизнес-процессы с минимальными усилиями."
    },
    "steps": {
      "title": "Действия по сравнению изображений JPEG в {{ProgLang}}",
      "content": {
        "title": "Используйте [{{ProdShortName}}]({{ProductUrl}}), чтобы выявлять несоответствия JPEG и управлять ими.",
        "step_1": "Установите {{ProdShortName}} через [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Запустите экземпляр компаратора, указав путь к вашему файлу JPEG.",
        "step_3": "Добавьте еще один файл JPEG для оценки.",
        "step_4": "Создайте подробный отчет с описанием сравнений в формате JPEG."
      },
      "code": {
        "comments": {
          "comment_1": "Создайте подробный отчет с указанием различий в формате JPEG.",
          "comment_2": "Создайте экземпляр Comparer, инициализированный первым изображением JPEG.",
          "comment_3": "Включите любые дополнительные изображения JPEG для оценки.",
          "comment_4": "Составьте отчет, в котором будут отражены различные наблюдаемые различия."
        }
      }
    },
    "formats": {
      "title": "Эффективное сравнение JPEG с использованием {{ProgLang}}",
      "description": "API {{ProdFullName}} позволяет создавать подробные отчеты с описанием отклонений в файлах JPEG, что упрощает мониторинг критических изменений в бизнес-изображениях."
    }
  },
  "jpg": {
    "head": {
      "title": "Динамическое сравнение изображений JPG с помощью библиотеки {{Runtime}}",
      "description": "Используйте API {{ProdFullName}}, чтобы с легкостью выявлять и каталогизировать различия в изображениях JPG."
    },
    "header": {
      "title": "Генерируйте информацию на основе различий JPG в {{EnvName}}",
      "description": "Максимизируйте потенциал {{Runtime}}, чтобы обнаружить изменения в изображениях JPG в ваших решениях {{ProgLang}}. Комплексные отчеты предоставляют важную информацию для ваших стратегических операций."
    },
    "about": {
      "title": "Изучите возможности API {{ProdFullName}}",
      "content": "Будьте в курсе изменений изображений JPG с помощью {{ProdFullName}}. Анализируйте подробные отчеты в своих приложениях {{ProgLang}}, повышая эффективность рабочего процесса без необходимости тщательного написания кода."
    },
    "steps": {
      "title": "Сравнительный анализ файлов JPG в {{ProgLang}}",
      "content": {
        "title": "Используйте [{{ProdShortName}}]({{ProductUrl}}) для сравнения изображений JPG.",
        "step_1": "Установите {{ProdShortName}} из [{{PackageStoreName}}]({{PackageUrl}}).",
        "step_2": "Создайте объект Comparer с путем к вашему первому файлу JPG.",
        "step_3": "Добавьте дополнительные файлы JPG для тщательного анализа.",
        "step_4": "Составьте отчет с подробным описанием сравнительных различий."
      },
      "code": {
        "comments": {
          "comment_1": "Создайте отчет о различиях изображений в формате JPG.",
          "comment_2": "Инициализируйте Comparer с основным изображением JPG.",
          "comment_3": "Включите другие файлы JPG для тщательной оценки.",
          "comment_4": "Подробные различия задокументируйте в отчете."
        }
      }
    },
    "formats": {
      "title": "Оптимизированное сравнение JPG с помощью {{ProgLang}}",
      "description": "Используйте библиотеку {{ProdFullName}}, чтобы быстро различать изображения JPG. Комплексные отчеты позволяют эффективно отслеживать изменения в важнейших бизнес-активах."
    }
  },
  "xlsx": {
    "head": {
      "title": "Анализируйте различия в содержимом XLSX с помощью API {{Runtime}}",
      "description": "Легко оценивайте различия в таблицах Excel с помощью API {{Runtime}}, который предоставляет подробные отчеты обо всех обнаруженных различиях."
    },
    "header": {
      "title": "Анализ электронных таблиц XLSX в {{EnvName}}",
      "description": "Включите библиотеку обработки документов {{Runtime}}, чтобы идентифицировать и выделять изменения в электронных таблицах XLSX, интегрированных в программные решения {{EnvName}}."
    },
    "about": {
      "title": "Ощутите преимущества {{ProdShortName}}",
      "content": "Создавайте подробные отчеты, инкапсулирующие изменения в нескольких версиях XLSX, используя {{ProdShortName}}. Легко встраивайте API в свои приложения {{EnvName}} с минимальными усилиями по написанию кода, анализируя различия в таблицах, текстах и ​​многом другом. Улучшите рабочие процессы вашего бизнеса с помощью наших передовых решений."
    },
    "steps": {
      "title": "Эффективно сравнивайте файлы XLSX в {{ProgLang}}",
      "content": {
        "title": "Используйте [{{ProdShortName}}]({{ProductUrl}}) и {{EnvName}} для надежного сравнения XLSX.",
        "step_1": "Получите {{ProdShortName}} для {{EnvName}} из [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Создайте объект Comparer и введите путь к исходному документу XLSX.",
        "step_3": "Добавьте больше файлов XLSX для более детального сравнения.",
        "step_4": "Подготовьте, просмотрите и задокументируйте результаты ваших сравнений."
      },
      "code": {
        "comments": {
          "comment_1": "Извлекайте отчеты, которые интерпретируют изменения, обнаруженные в документах XLSX.",
          "comment_2": "Создайте новый экземпляр Comparer с исходным файлом XLSX.",
          "comment_3": "Включите дополнительные файлы XLSX для сравнения.",
          "comment_4": "Надежно сохраняйте полученные отчеты локально."
        }
      }
    },
    "formats": {
      "title": "Эффективно сравнивайте файлы XLSX с помощью {{ProgLang}}",
      "description": "Легко выделяйте ключевые различия в документах MS Excel XLSX с помощью API {{ProdFullName}}, предоставляя ценную информацию о данных вашей организации."
    }
  },
  "pptx": {
    "head": {
      "title": "Оцените различия PPTX, используя {{EnvName}} с {{ProdFullName}}",
      "description": "С легкостью изучайте изменения в презентациях PPTX, создавая точные отчеты, отражающие различия в контенте."
    },
    "header": {
      "title": "Эффективное сравнение презентаций PPTX в {{EnvName}}",
      "description": "Используйте возможности обработки документов {{Runtime}}, чтобы выявлять изменения в презентациях PPTX в ваших приложениях {{EnvName}} и сообщать о них, оптимизируя рабочий процесс."
    },
    "about": {
      "title": "Откройте для себя ключевые функции {{ProdFullName}}",
      "content": "Создавайте подробные отчеты с подробным описанием изменений в различных версиях PPTX с помощью {{ProdShortName}}. Легко внедрите это решение в свои приложения {{EnvName}} и анализируйте различия в слайдах, текстах и ​​форматах. Объедините варианты в консолидированные файлы PPTX, чтобы повысить эффективность вашего бизнеса."
    },
    "steps": {
      "title": "Документирование различий PPTX в {{ProgLang}}",
      "content": {
        "title": "Примените [{{ProdShortName}}]({{ProductUrl}}) для сравнения презентаций PPTX.",
        "step_1": "Получите {{ProdShortName}} через [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "Создайте экземпляр Comparer для первой презентации PPTX.",
        "step_3": "Добавьте дополнительные файлы PPTX для полного сравнения.",
        "step_4": "Обобщите результаты и просмотрите созданный отчет."
      },
      "code": {
        "comments": {
          "comment_1": "Соберите данные об изменениях, обнаруженных в презентациях PPTX.",
          "comment_2": "Инициализируйте Comparer с первым входным файлом PPTX.",
          "comment_3": "Включите другие файлы PPTX для надежного сравнения.",
          "comment_4": "Надежно документируйте полученные результаты."
        }
      }
    },
    "formats": {
      "title": "Упростите сравнение PPTX с помощью {{ProgLang}}",
      "description": "Легко управляйте презентациями MS PowerPoint PPTX и сравнивайте их с {{ProdFullName}}, чтобы создавать подробные отчеты, отражающие изменения в важнейших бизнес-презентациях."
    }
  }
}