{
  "common": {
    "head": {
      "title": "เปรียบเทียบ {{FileFormatUp}} อย่างมีประสิทธิภาพโดยใช้ไลบรารี {{ProgLang}}",
      "description": "ด้วย {{ProdFullName}} สร้างรายงานการเปรียบเทียบเชิงลึกที่ปรับแต่งสำหรับแอปพลิเคชัน {{Runtime}}"
    },
    "header": {
      "title": "วิเคราะห์ความแตกต่าง {{FileFormatUp}} ใน {{Runtime}}",
      "description": "{{ProdShortName}} เป็นไลบรารีที่ออกแบบมาสำหรับ {{Runtime}} ซึ่งช่วยให้กระบวนการเปรียบเทียบและเน้นความคลาดเคลื่อนในไฟล์ {{FileFormatUp}} ง่ายขึ้น เพิ่มความสามารถในการจัดการเอกสารของคุณด้วยโซลูชันที่เป็นนวัตกรรมนี้",
      "subtitle": "เครื่องมือเปรียบเทียบไฟล์ขั้นสูง",
      "action_title": "ดาวน์โหลดฟรีจาก {{PackageStoreName}}"
    },
    "about": {
      "title": "สำรวจความสามารถของ {{ProdFullName}}",
      "content": "{{ProdFullName}} ทำหน้าที่เป็น API ที่สร้างขึ้นโดยเฉพาะสำหรับการเปรียบเทียบเอกสารและรูปภาพในรูปแบบต่างๆ โดยระบุการเปลี่ยนแปลงของคำ ย่อหน้า อักขระ รูปร่าง และองค์ประกอบลักษณะระหว่างเอกสาร คุณสามารถรวมการแก้ไขเหล่านี้ได้อย่างสะดวกและบันทึกเป็นเอกสารขั้นสุดท้ายที่รวมเข้าด้วยกัน รองรับรูปแบบที่หลากหลาย รวมถึง PDF, เอกสาร Word, ชีต Excel, การนำเสนอ PowerPoint, Visio, ไฟล์ HTML, รูปภาพ และอื่นๆ อีกมากมาย ทั้งหมดนี้ทำได้โดยไม่ต้องใช้เครื่องมือจากบุคคลที่สาม"
    },
    "steps": {
      "title": "วิธีเปรียบเทียบ {{FileFormatUp}} อย่างมีประสิทธิภาพโดยใช้ {{Runtime}}",
      "content": {
        "title": "ใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อทำการเปรียบเทียบโดยละเอียดกับไฟล์ {{FileFormatUp}}",
        "step_1": "เริ่มต้นด้วยการติดตั้ง {{ProdFullName}} ถึง [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์ของออบเจ็กต์ Comparer ด้วยไฟล์ {{FileFormatUp}} เริ่มต้น",
        "step_3": "รวมไฟล์ {{FileFormatUp}} ไฟล์ที่สองลงใน Comparer",
        "step_4": "รวบรวมรายงานโดยละเอียดเพื่อแยกแยะความคลาดเคลื่อนที่ระบุทั้งหมด"
      },
      "code": {
        "comments": {
          "comment_1": "เปรียบเทียบหลายไฟล์เพื่อดูความเหมือนและความแตกต่าง",
          "comment_2": "เริ่มต้น Comparer และโหลดไฟล์แรก",
          "comment_3": "เพิ่มไฟล์เพิ่มเติมเพื่อการเปรียบเทียบ",
          "comment_4": "รับรายงานการเปรียบเทียบขั้นสุดท้าย"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบรูปแบบไฟล์ต่างๆ ได้อย่างราบรื่นโดยใช้ {{ProgLang}}",
      "description": "API {{Runtime}} ของเราช่วยให้สามารถเปรียบเทียบรูปแบบเอกสารที่หลากหลายได้อย่างง่ายดาย ทำให้การติดตามการเปลี่ยนแปลงในเอกสารตรงไปตรงมา"
    }
  },
  "pdf": {
    "head": {
      "title": "ปรับปรุงการเปรียบเทียบ PDF ด้วยไลบรารี {{ProgLang}}",
      "description": "ซอฟต์แวร์ {{ProdShortName}} สำหรับ {{Runtime}} สร้างรายงานอย่างละเอียดที่เน้นรูปแบบต่างๆ ในเอกสาร PDF"
    },
    "header": {
      "title": "การเปรียบเทียบ PDF เป็นเรื่องง่ายสำหรับ {{EnvName}}",
      "description": "ใช้ API การเปรียบเทียบ PDF ของเราภายใน {{Runtime}} เพื่อระบุและนำเสนอความคลาดเคลื่อนในไฟล์ PDF ได้อย่างมีประสิทธิภาพอย่างง่ายดาย เข้าถึงการรายงานโดยละเอียดได้อย่างรวดเร็วโดยไม่ซับซ้อนโดยไม่จำเป็น"
    },
    "about": {
      "title": "เผยคุณสมบัติที่สำคัญของไลบรารี {{ProdFullName}}",
      "content": "สร้างรายงานที่ครอบคลุมซึ่งระบุความแตกต่างที่พบในเอกสาร PDF โดยตรงจากแอปพลิเคชัน {{ProgLang}} ของคุณ ด้วยโค้ดขั้นต่ำ ใช้ประโยชน์จาก {{ProdFullName}} โดยไม่ต้องใช้ซอฟต์แวร์เพิ่มเติม ติดตามการเปลี่ยนแปลงของย่อหน้า คำ รูปแบบ รูปร่าง และสไตล์ใน PDF ของคุณ นอกจากนี้ ยังรวมการแก้ไขจากหลายเวอร์ชันให้เป็นผลลัพธ์แบบครบวงจร ประมวลผล PDF อย่างรวดเร็วและง่ายดาย"
    },
    "steps": {
      "title": "สร้างรายงานความแตกต่างในรูปแบบ PDF ด้วย {{ProgLang}}",
      "content": {
        "title": "ติดตามการเปลี่ยนแปลงในเอกสาร PDF โดยใช้รายงานที่สร้างโดย [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "ติดตั้ง {{ProdShortName}} สำหรับ {{EnvName}} โดยใช้ [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์ Comparer และป้อนเส้นทางสำหรับไฟล์ PDF ไฟล์แรก",
        "step_3": "แนะนำไฟล์ PDF ไฟล์ที่สองที่มีไว้เพื่อการเปรียบเทียบ",
        "step_4": "แยกรายงานขั้นสุดท้ายที่อธิบายความแตกต่างระหว่างไฟล์"
      },
      "code": {
        "comments": {
          "comment_1": "สร้างรายงานโดยละเอียดเพื่อแสดงรูปแบบต่างๆ ในไฟล์ PDF",
          "comment_2": "สร้างออบเจ็กต์ Comparer พร้อมเส้นทางไปยังเอกสาร PDF แรก",
          "comment_3": "รวมไฟล์ที่สองขึ้นไปเพื่อการเปรียบเทียบที่มีประสิทธิภาพ",
          "comment_4": "คงรายงานที่สร้างขึ้นไปยังไดเร็กทอรีที่คุณระบุ"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบประเภทไฟล์ทั่วไป เช่น PDF กับ {{ProgLang}}",
      "description": "API {{Runtime}} ของเราช่วยให้คุณเปรียบเทียบไฟล์ PDF ได้อย่างรวดเร็วและแม่นยำ ติดตามการเปลี่ยนแปลงได้อย่างง่ายดายผ่านรายงานการเปรียบเทียบโดยละเอียด"
    }
  },
  "docx": {
    "head": {
      "title": "เปรียบเทียบไฟล์ DOCX ได้อย่างง่ายดายโดยใช้ {{Runtime}} API",
      "description": "ติดตามและวิเคราะห์ความแตกต่างในเอกสาร MS Word DOCX ด้วย {{ProdShortName}} API สำหรับ {{Runtime}} ซึ่งสร้างรายงานที่ครอบคลุมซึ่งสรุปการเปลี่ยนแปลง"
    },
    "header": {
      "title": "การเปรียบเทียบ DOCX สำหรับ {{EnvName}}",
      "description": "ใช้ API การประมวลผลเอกสารของเราใน {{Runtime}} เพื่อระบุและสรุปการเปลี่ยนแปลงในไฟล์ MS Word DOCX อย่างรวดเร็ว เพลิดเพลินไปกับการสร้างรายงานที่ราบรื่นภายในแอปพลิเคชันของคุณ"
    },
    "about": {
      "title": "สำรวจคุณสมบัติของ {{ProdFullName}}",
      "content": "{{ProdShortName}} มอบข้อมูลเชิงลึกที่ครอบคลุมเกี่ยวกับการเปลี่ยนแปลงในเอกสาร DOCX เวอร์ชันต่างๆ ด้วยโค้ดไม่กี่บรรทัด คุณสามารถรวม {{EnvName}} และ API ของเราเข้ากับขั้นตอนการทำงานของคุณได้ โดยไม่จำเป็นต้องใช้ไลบรารีเพิ่มเติม กำหนดการเปลี่ยนแปลงในเนื้อหา สไตล์ข้อความ และเค้าโครงในเอกสาร Word คุณยังสามารถรวมรูปแบบต่างๆ เพื่อสร้างไฟล์ DOCX ที่อัปเดตได้ ยกระดับกระบวนการจัดการเอกสารของคุณด้วย API ที่แข็งแกร่งของเรา"
    },
    "steps": {
      "title": "สร้างรายงานการเปรียบเทียบ DOCX ด้วย {{ProgLang}}",
      "content": {
        "title": "ใช้ประโยชน์จาก [{{ProdShortName}}]({{ProductUrl}}) ร่วมกับ {{EnvName}} เพื่อประเมินความแตกต่างของไฟล์ DOCX",
        "step_1": "รับ {{ProdShortName}} สำหรับ {{EnvName}} ผ่านทาง [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "ตั้งค่าอินสแตนซ์ Comparer และกำหนดเส้นทางไปยังไฟล์ DOCX เริ่มต้น",
        "step_3": "เพิ่มไฟล์ DOCX เพิ่มเติมตามที่จำเป็นสำหรับการวิเคราะห์เชิงเปรียบเทียบ",
        "step_4": "ประเมินรายงานที่สร้างขึ้นและตรวจสอบสิ่งที่คุณค้นพบ"
      },
      "code": {
        "comments": {
          "comment_1": "รับข้อมูลเชิงลึกโดยละเอียดเกี่ยวกับการเปลี่ยนแปลงที่เกิดขึ้นกับไฟล์ DOCX",
          "comment_2": "เริ่มต้น Comparer โดยใช้ไฟล์ DOCX แรกสำหรับการอ้างอิง",
          "comment_3": "รวมไฟล์ DOCX เพิ่มเติมเพื่อการเปรียบเทียบอย่างละเอียด",
          "comment_4": "เก็บรายงานการเปรียบเทียบตามความจำเป็น"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบเอกสาร DOCX ใดๆ กับ {{ProgLang}}",
      "description": "ใช้ {{ProdFullName}} เพื่อวิเคราะห์ไฟล์ MS Word DOCX เพื่อรับความรู้อันมีค่าเกี่ยวกับการแก้ไขเอกสาร"
    }
  },
  "png": {
    "head": {
      "title": "เปรียบเทียบรูปภาพ PNG โดยใช้ {{ProgLang}} API",
      "description": "ไลบรารี {{ProdFullName}} สร้างรายงานโดยละเอียดที่แสดงความแตกต่างระหว่างไฟล์ภาพ PNG"
    },
    "header": {
      "title": "วิเคราะห์รูปภาพ PNG ใน {{Runtime}}",
      "description": "ใช้ประโยชน์จาก {{Runtime}} API เพื่อค้นหาความคลาดเคลื่อนในไฟล์ PNG ได้อย่างราบรื่นภายในแอปพลิเคชัน {{ProgLang}} ของคุณ รับรายงานที่ครอบคลุมได้อย่างง่ายดาย"
    },
    "about": {
      "title": "สำรวจฟีเจอร์ของ {{ProdFullName}} API",
      "content": "สร้างรายงานอย่างละเอียดโดยให้รายละเอียดความคลาดเคลื่อนระหว่างเวอร์ชันของรูปภาพ PNG โดยตรงภายในแอปพลิเคชัน {{ProgLang}} โดยไม่ต้องอาศัยซอฟต์แวร์เพิ่มเติม ติดตามการเปลี่ยนแปลงทั้งหมดที่เกี่ยวข้องกับภาพ PNG ของคุณ"
    },
    "steps": {
      "title": "สร้างรายงานการเปรียบเทียบสำหรับรูปภาพ PNG ด้วย {{ProgLang}}",
      "content": {
        "title": "ตรวจสอบการเปลี่ยนแปลงในไฟล์ PNG โดยใช้ [{{ProdShortName}}]({{ProductUrl}}) และสร้างรายงานได้อย่างง่ายดาย",
        "step_1": "รับแพ็คเกจ {{ProdShortName}} ผ่านทาง [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์ของเครื่องมือเปรียบเทียบและป้อนเส้นทางสำหรับรูปภาพ PNG ภาพแรก",
        "step_3": "รวมไฟล์ PNG หนึ่งไฟล์ขึ้นไปสำหรับการศึกษาเปรียบเทียบ",
        "step_4": "เข้าถึงรายงานที่ครอบคลุมซึ่งมีรายละเอียดความคลาดเคลื่อนทางภาพทั้งหมด"
      },
      "code": {
        "comments": {
          "comment_1": "สร้างรายงานที่บันทึกการเปลี่ยนแปลงระหว่างรูปภาพ PNG",
          "comment_2": "เริ่มต้น Comparer ด้วยไฟล์ PNG แรกที่จะเริ่ม",
          "comment_3": "รวมไฟล์ PNG เพิ่มเติมเพื่อการเปรียบเทียบเชิงลึก",
          "comment_4": "จัดเก็บหรือแสดงรายงานที่สะท้อนถึงการเปลี่ยนแปลงที่ระบุทั้งหมด"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบรูปภาพในรูปแบบเช่น PNG",
      "description": "ใช้ {{ProdFullName}} เพื่อระบุความแตกต่างระหว่างรูปภาพ PNG สร้างรายงานโดยละเอียดเพื่อติดตามการเปลี่ยนแปลงที่สำคัญ"
    }
  },
  "jpeg": {
    "head": {
      "title": "ทำการเปรียบเทียบ JPEG อัตโนมัติกับไลบรารี {{Runtime}}",
      "description": "{{ProdFullName}} API ช่วยให้คุณตรวจจับและบันทึกความแตกต่างในภาพ JPEG ได้อย่างง่ายดาย"
    },
    "header": {
      "title": "เปรียบเทียบรูปภาพ JPEG กับ {{EnvName}} ได้อย่างราบรื่น",
      "description": "ใช้ความสามารถของ {{Runtime}} เพื่อตรวจสอบการเปลี่ยนแปลงในภาพ JPEG ที่รวมอยู่ในแอปพลิเคชัน {{ProgLang}} ของคุณ สร้างรายงานข้อมูลที่ช่วยเพิ่มการตัดสินใจ"
    },
    "about": {
      "title": "ปลดล็อคความสามารถของ {{ProdFullName}}",
      "content": "ใช้ {{ProdFullName}} API เพื่อวิเคราะห์การเปลี่ยนแปลงในภาพ JPEG ได้อย่างแม่นยำ ดึงข้อมูลเชิงลึกได้อย่างสะดวกโดยใช้สภาพแวดล้อม {{ProgLang}} ของคุณ ทำให้กระบวนการทางธุรกิจคล่องตัวขึ้นโดยใช้ความพยายามเพียงเล็กน้อย"
    },
    "steps": {
      "title": "ขั้นตอนในการเปรียบเทียบภาพ JPEG ใน {{ProgLang}}",
      "content": {
        "title": "จ้าง [{{ProdShortName}}]({{ProductUrl}}) เพื่อแยกแยะและจัดการความคลาดเคลื่อนของ JPEG",
        "step_1": "ติดตั้ง {{ProdShortName}} ผ่าน [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "เริ่มต้นอินสแตนซ์เปรียบเทียบด้วยเส้นทางไปยังไฟล์ JPEG ของคุณ",
        "step_3": "รวมไฟล์ JPEG อื่นเพื่อการประเมินผล",
        "step_4": "สร้างรายงานที่ครอบคลุมโดยสรุปการเปรียบเทียบในรูปแบบ JPEG"
      },
      "code": {
        "comments": {
          "comment_1": "สร้างรายงานโดยละเอียดโดยเน้นความแตกต่างของ JPEG",
          "comment_2": "สร้างอินสแตนซ์ Comparer ที่เริ่มต้นด้วยอิมเมจ JPEG แรก",
          "comment_3": "รวมภาพ JPEG เพิ่มเติมเพื่อการประเมิน",
          "comment_4": "รวบรวมรายงานที่กล่าวถึงความแตกต่างต่างๆ ที่สังเกตได้"
        }
      }
    },
    "formats": {
      "title": "การเปรียบเทียบ JPEG ที่มีประสิทธิภาพโดยใช้ {{ProgLang}}",
      "description": "API {{ProdFullName}} ช่วยให้คุณสร้างรายงานโดยละเอียดโดยสรุปความแปรปรวนในไฟล์ JPEG ทำให้ง่ายต่อการตรวจสอบการเปลี่ยนแปลงที่สำคัญในภาพธุรกิจ"
    }
  },
  "jpg": {
    "head": {
      "title": "การเปรียบเทียบแบบไดนามิกของรูปภาพ JPG กับไลบรารี {{Runtime}}",
      "description": "ใช้ API ของ {{ProdFullName}} เพื่อระบุและจัดทำรายการความแตกต่างในภาพ JPG ได้อย่างง่ายดาย"
    },
    "header": {
      "title": "สร้างข้อมูลเชิงลึกจากความแตกต่างของ JPG ใน {{EnvName}}",
      "description": "เพิ่มศักยภาพสูงสุดของ {{Runtime}} เพื่อแยกแยะการเปลี่ยนแปลงในภาพ JPG ภายในโซลูชัน {{ProgLang}} ของคุณ รายงานที่ครอบคลุมให้ข้อมูลที่สำคัญสำหรับการปฏิบัติการเชิงกลยุทธ์ของคุณ"
    },
    "about": {
      "title": "สำรวจความสามารถของ API ของ {{ProdFullName}}",
      "content": "รับข่าวสารเกี่ยวกับการเปลี่ยนแปลงรูปภาพ JPG โดยใช้ {{ProdFullName}} วิเคราะห์รายงานที่ครอบคลุมภายในแอปพลิเคชัน {{ProgLang}} ของคุณ เพิ่มประสิทธิภาพเวิร์กโฟลว์โดยไม่ต้องเขียนโค้ดจำนวนมาก"
    },
    "steps": {
      "title": "การวิเคราะห์เปรียบเทียบไฟล์ JPG ใน {{ProgLang}}",
      "content": {
        "title": "ใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อประเมินการเปรียบเทียบรูปภาพ JPG",
        "step_1": "ติดตั้ง {{ProdShortName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างออบเจ็กต์ Comparer พร้อมเส้นทางไปยังไฟล์ JPG ไฟล์แรกของคุณ",
        "step_3": "เพิ่มไฟล์ JPG เพิ่มเติมเพื่อการวิเคราะห์อย่างละเอียด",
        "step_4": "รวบรวมรายงานที่มีรายละเอียดความแตกต่างเชิงเปรียบเทียบ"
      },
      "code": {
        "comments": {
          "comment_1": "ดำเนินการสร้างรายงานสำหรับความแตกต่างของภาพ JPG",
          "comment_2": "เริ่มต้นเครื่องมือเปรียบเทียบด้วยรูปภาพ JPG หลัก",
          "comment_3": "รวมไฟล์ JPG อื่นๆ เพื่อการประเมินอย่างละเอียด",
          "comment_4": "บันทึกความแตกต่างโดยละเอียดในรายงาน"
        }
      }
    },
    "formats": {
      "title": "การเปรียบเทียบ JPG ที่มีประสิทธิภาพยิ่งขึ้นด้วย {{ProgLang}}",
      "description": "ใช้ประโยชน์จากไลบรารี {{ProdFullName}} เพื่อแยกความแตกต่างระหว่างรูปภาพ JPG อย่างรวดเร็ว รายงานที่ครอบคลุมช่วยให้สามารถติดตามการเปลี่ยนแปลงในสินทรัพย์ทางธุรกิจที่จำเป็นได้อย่างมีประสิทธิภาพ"
    }
  },
  "xlsx": {
    "head": {
      "title": "วิเคราะห์ความแตกต่างของเนื้อหา XLSX โดยใช้ {{Runtime}} API",
      "description": "ประเมินความแตกต่างในสเปรดชีต Excel ได้อย่างง่ายดายโดยใช้ {{Runtime}} API ซึ่งจัดทำรายงานโดยละเอียดเกี่ยวกับความแตกต่างทั้งหมดที่พบ"
    },
    "header": {
      "title": "การวิเคราะห์สเปรดชีต XLSX ภายใน {{EnvName}}",
      "description": "รวมไลบรารีการประมวลผลเอกสาร {{Runtime}} เพื่อระบุและเน้นการเปลี่ยนแปลงในสเปรดชีต XLSX ที่รวมอยู่ในโซลูชันซอฟต์แวร์ {{EnvName}}"
    },
    "about": {
      "title": "สัมผัสประสบการณ์ข้อดีของ {{ProdShortName}}",
      "content": "สร้างรายงานเชิงลึกที่สรุปการเปลี่ยนแปลงใน XLSX หลายเวอร์ชันโดยใช้ {{ProdShortName}} ฝัง API ลงในแอปพลิเคชัน {{EnvName}} ของคุณได้อย่างง่ายดายโดยใช้ความพยายามในการเขียนโค้ดเพียงเล็กน้อย วิเคราะห์ความแตกต่างในชีต ข้อความ และอื่นๆ ปรับปรุงขั้นตอนการทำงานทางธุรกิจของคุณด้วยโซลูชั่นขั้นสูงของเรา"
    },
    "steps": {
      "title": "เปรียบเทียบไฟล์ XLSX อย่างมีประสิทธิภาพใน {{ProgLang}}",
      "content": {
        "title": "ใช้ประโยชน์จาก [{{ProdShortName}}]({{ProductUrl}}) และ {{EnvName}} เพื่อการเปรียบเทียบ XLSX ที่มีประสิทธิภาพ",
        "step_1": "รับ {{ProdShortName}} สำหรับ {{EnvName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างวัตถุ Comparer และป้อนเส้นทางสำหรับเอกสาร XLSX เริ่มต้น",
        "step_3": "เพิ่มไฟล์ XLSX เพิ่มเติมเพื่อการเปรียบเทียบที่ครอบคลุม",
        "step_4": "จัดเตรียม ทบทวน และบันทึกผลการเปรียบเทียบของคุณ"
      },
      "code": {
        "comments": {
          "comment_1": "แยกรายงานที่ตีความการเปลี่ยนแปลงที่พบในเอกสาร XLSX",
          "comment_2": "สร้างอินสแตนซ์ Comparer ใหม่ด้วยไฟล์ XLSX เริ่มต้น",
          "comment_3": "รวมไฟล์ XLSX เสริมเพื่อวัตถุประสงค์ในการเปรียบเทียบ",
          "comment_4": "บันทึกรายงานผลลัพธ์ไว้ในเครื่องอย่างปลอดภัย"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบไฟล์ XLSX อย่างมีประสิทธิภาพด้วย {{ProgLang}}",
      "description": "เน้นความแตกต่างที่สำคัญในเอกสาร MS Excel XLSX ได้อย่างง่ายดายโดยใช้ {{ProdFullName}} API ซึ่งให้ข้อมูลเชิงลึกอันมีค่าเกี่ยวกับข้อมูลองค์กรของคุณ"
    }
  },
  "pptx": {
    "head": {
      "title": "ประเมินความแตกต่างของ PPTX โดยใช้ {{EnvName}} กับ {{ProdFullName}}",
      "description": "กลั่นกรองการเปลี่ยนแปลงในการนำเสนอ PPTX ได้อย่างง่ายดาย สร้างรายงานที่แม่นยำซึ่งสะท้อนถึงความแปรปรวนของเนื้อหา"
    },
    "header": {
      "title": "การเปรียบเทียบการนำเสนอ PPTX อย่างมีประสิทธิภาพใน {{EnvName}}",
      "description": "ใช้ความสามารถในการประมวลผลเอกสารของ {{Runtime}} เพื่อระบุและรายงานรูปแบบต่างๆ ภายในการนำเสนอ PPTX ในแอปพลิเคชัน {{EnvName}} ของคุณ เพื่อเพิ่มประสิทธิภาพเวิร์กโฟลว์ของคุณ"
    },
    "about": {
      "title": "ค้นพบฟังก์ชันหลักๆ ของ {{ProdFullName}}",
      "content": "สร้างรายงานที่ครอบคลุมซึ่งมีรายละเอียดการเปลี่ยนแปลงใน PPTX เวอร์ชันต่างๆ ด้วย {{ProdShortName}} ใช้โซลูชันนี้กับแอปพลิเคชัน {{EnvName}} ของคุณได้อย่างราบรื่น และวิเคราะห์ความแตกต่างในสไลด์ ข้อความ และรูปแบบ รวมรูปแบบต่างๆ เข้ากับไฟล์ PPTX ที่รวมไว้เพื่อเพิ่มประสิทธิภาพทางธุรกิจของคุณ"
    },
    "steps": {
      "title": "บันทึกความแตกต่างของ PPTX ใน {{ProgLang}}",
      "content": {
        "title": "ใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อเปรียบเทียบงานนำเสนอ PPTX",
        "step_1": "รับ {{ProdShortName}} ผ่าน [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์ Comparer สำหรับการนำเสนอ PPTX แรก",
        "step_3": "เพิ่มไฟล์ PPTX เพิ่มเติมเพื่อการเปรียบเทียบที่สมบูรณ์",
        "step_4": "รวบรวมข้อค้นพบและทบทวนรายงานที่สร้างขึ้น"
      },
      "code": {
        "comments": {
          "comment_1": "รวบรวมข้อมูลเกี่ยวกับการเปลี่ยนแปลงที่พบในการนำเสนอ PPTX",
          "comment_2": "เริ่มต้น Comparer ด้วยอินพุตไฟล์ PPTX แรก",
          "comment_3": "รวมไฟล์ PPTX อื่นๆ เพื่อการเปรียบเทียบที่มีประสิทธิภาพ",
          "comment_4": "บันทึกผลลัพธ์ที่สร้างขึ้นอย่างปลอดภัย"
        }
      }
    },
    "formats": {
      "title": "อำนวยความสะดวกในการเปรียบเทียบ PPTX โดยใช้ {{ProgLang}}",
      "description": "จัดการและเปรียบเทียบงานนำเสนอ MS PowerPoint PPTX กับ {{ProdFullName}} ได้อย่างง่ายดาย เพื่อสร้างรายงานเชิงลึกที่สะท้อนถึงการเปลี่ยนแปลงภายในการนำเสนอทางธุรกิจที่สำคัญ"
    }
  }
}