{
  "common": {
    "head": {
      "title": "مقایسه فایل های {{FileFormatUp}} با نرم افزار مقایسه {{ProgLang}}",
      "description": "مقایسه و ادغام {{FileFormatUp}} فایل ها در {{ProgLang}} {{EnvName}} برنامه ها. خلاصه تفاوت ها را در محتوا، متن و سبک بازیابی کنید."
    },
    "header": {
      "title": "مقایسه {{FileFormatUp}} در {{ProgLang}} {{EnvName}}",
      "description": "{{EnvName}} API مقایسه اسناد را برای بررسی اختلافات بین دو نسخه از {{FileFormatUp}} فایل ها و صادرات به یک سند نهایی با خلاصه مفصلی از تفاوت بین اسناد مقایسه شده.",
      "subtitle": "راه حل مقایسه اسناد",
      "action_title": "دانلود رایگان {{PackageStoreName}}"
    },
    "about": {
      "title": "مزایای {{ProdFullName}} API را کشف کنید",
      "content": "{{ProdFullName}} یک API بومی {{EnvName}} است که برای مقایسه چندین تصویر و اسناد با همان فرمت طراحی شده است. به تشخیص تفاوت در پاراگراف ها، کلمات، کاراکترها، اشکال و حتی سبک های متن اسناد مقایسه شده کمک می کند. با توانایی ادغام این تغییرات و صادرات به یک سند نهایی، از مقایسه و ادغام PDF s، Word سند، Excel صفحه گسترده، PowerPoint ارائه، Visio نمودار، Outlook ایمیل، HTML، نقشه ها و قالب های مختلف فایل تصویری پشتیبانی می کند - همه بدون نیاز به کتابخانه های خارجی."
    },
    "steps": {
      "title": "نحوه مقایسه چندین فایل {{FileFormatUp}} با استفاده از {{ProgLang}}",
      "content": {
        "title": "امکان استفاده از [{{ProdShortName}}]({{ProductUrl}}) برای دریافت گزارش در مورد تفاوت در بسیاری از فایل های {{FileFormatUp}} وجود دارد.",
        "step_1": "{{ProdFullName}} را از [{{PackageStoreName}}]({{PackageUrl}}) با استفاده از مدیر بسته مورد علاقه خود نصب کنید",
        "step_2": "یک نمونه از کلاس Comparer را با مسیر کامل به فایل اولیه {{FileFormatUp}} ارائه دهید",
        "step_3": "حداقل یک {{FileFormatUp}} دیگر را به مقایسه اضافه کنید",
        "step_4": "یک گزارش نهایی با تفاوت های دقیق توصیف شده دریافت کنید"
      },
      "code": {
        "comments": {
          "comment_1": "مقایسه چندین اسناد از دیسک محلی",
          "comment_2": "Comparer Instantiate که اولین فایل را ارائه می دهد",
          "comment_3": "اضافه کردن فایل های دیگر",
          "comment_4": "دریافت فایل نتیجه با نام مشخص شده"
        }
      }
    },
    "formats": {
      "title": "مقایسه فرمت های محبوب فایل با استفاده از {{ProgLang}}",
      "description": "{{EnvName}} API برای مقایسه فرمت های سند. در مورد تغییرات در مدارک خود بدون تلاش اضافی در مورد پردازش آنها مطلع باشید."
    }
  },
  "pdf": {
    "head": {
      "title": "بررسی PDF اسناد مختلف در {{ProgLang}} {{EnvName}}",
      "description": "مقایسه و ادغام بیش از دو فایل PDF در {{ProgLang}} {{EnvName}} برنامه ها. خلاصه تفاوت ها را در محتوا، متن و سبک PDF فایل بازیابی کنید."
    },
    "header": {
      "title": "مقایسه PDF اسناد در {{ProgLang}} {{EnvName}} برنامه",
      "description": "{{EnvName}} API مقایسه اسناد برای شناسایی و نمایش تفاوت در PDF s در برنامه های کاربردی مبتنی بر {{ProgLang}}، ASP .NET، VB .NET و .NET Core. بدون زحمت گزارش های دقیق را برای یک تجربه یکپارچه دریافت کنید."
    },
    "about": {
      "title": "کشف {{ProdFullName}} ویژگی های API",
      "content": "گزارش های دقیق در مورد تفاوت ها را در PDF اسناد در {{EnvName}} برنامه های خود دریافت کنید. PDF متمایز را با یک فایل جدید با همان فرمت ادغام کنید. از {{ProdFullName}} API ها با اضافه کردن چند خط کد استفاده کنید. پردازش PDF s و سایر فرمت ها بدون نرم افزار شخص ثالث."
    },
    "steps": {
      "title": "نحوه مقایسه PDF s با استفاده از {{ProgLang}}",
      "content": {
        "title": "دریافت گزارش در مورد تفاوت در بسیاری از فایل های PDF با استفاده از [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "{{ProdFullName}} را از [{{PackageStoreName}}]({{PackageUrl}}) دریافت کنید و آن را نصب کنید",
        "step_2": "ایجاد نمونه Comparer کاملاً جدید با مسیر فایل PDF",
        "step_3": "افزودن دیگر PDF به مقایسه",
        "step_4": "نتیجه شامل گزارشی در مورد تمایز در هر دو PDF s"
      },
      "code": {
        "comments": {
          "comment_1": "تهیه گزارش تمایز PDF",
          "comment_2": "مقایسه نمونه‌ای با مسیر به یک فایل اول",
          "comment_3": "یک یا چند PDF s را به مقایسه اضافه کنید",
          "comment_4": "گزارش نتایج مورد تجزیه و تحلیل"
        }
      }
    },
    "formats": {
      "title": "PDF s را با استفاده از {{ProgLang}} مقایسه کنید و گزارش کامل دریافت کنید",
      "description": "{{EnvName}} {{ProgLang}} نرم افزار برای مقایسه PDF اسناد. در مورد هرگونه تغییر در اسناد خود به راحتی مطلع باشید."
    }
  },
  "docx": {
    "head": {
      "title": "مقایسه MS Word DOCX از طریق {{ProgLang}} و {{EnvName}}",
      "description": "DOCX مقایسه با {{ProdFullName}}. گزارش دقیق با تغییرات برجسته بین DOCX اسناد. از API ما همراه با {{ProgLang}} استفاده کنید."
    },
    "header": {
      "title": "MS Word DOCX مقایسه با {{ProgLang}} {{EnvName}} برنامه های کاربردی",
      "description": "{{EnvName}} API طراحی شده برای مقایسه اسناد هر گونه تفاوت در MS Word فایل ها را پیدا می کند و گزارش می دهد. برنامه های کاربردی را بر اساس {{ProgLang}}، ASP .NET، VB .NET یا .NET Core بسازید تا از مزایا استفاده کنید. گزارش های دقیق را با اضافه کردن چند خط کد دریافت کنید."
    },
    "about": {
      "title": "بررسی ویژگی های {{ProdFullName}} API",
      "content": "تغییرات در DOCX اسناد خود را با گزارش مناسب در {{EnvName}} پروژه خود نشان دهید. علاوه بر این، اطلاعاتی در مورد سبک ها، اشکال و سایر مطالب دریافت کنید و DOCX فایل را با فایل جدید ادغام کنید. مزایای {{ProdFullName}} API می تواند تنها با چند خط کد به پروژه های شما منتقل شود. از نرم افزار ما بدون توسعه دهندگان شخص ثالث استفاده کنید."
    },
    "steps": {
      "title": "MS Word DOCX گزارش های مقایسه از طریق {{EnvName}} و {{ProgLang}}",
      "content": {
        "title": "گزارش تمایز برای فایل های DOCX با استفاده از [{{ProdShortName}}]({{ProductUrl}}) تهیه کنید",
        "step_1": "بسته {{ProdFullName}} را از [{{PackageStoreName}}]({{PackageUrl}}) دانلود کنید و آن را نصب کنید",
        "step_2": "مسیر عبور شیء Comparer Instantiate به DOCX",
        "step_3": "افزودن DOCX فایل به مقایسه",
        "step_4": "دریافت گزارش با اطلاعات تمایز"
      },
      "code": {
        "comments": {
          "comment_1": "گزارش تغییرات فایل DOCX",
          "comment_2": "مقایسه نمونه‌ای برای پردازش اسناد",
          "comment_3": "حداقل یک فایل برای مقایسه اضافه کنید",
          "comment_4": "تجزیه و تحلیل نتیجه"
        }
      }
    },
    "formats": {
      "title": "مقایسه DOCX توسط {{ProgLang}} برنامه ها",
      "description": "{{ProdFullName}} مزایا برای نسخه های کنترل فرمت های فایل های محبوب. جمع آوری MS Word اطلاعات اسناد به سرعت و به راحتی."
    }
  },
  "png": {
    "head": {
      "title": "PNG بررسی تفاوت ها توسط {{ProdFullName}}",
      "description": "{{ProdFullName}} اجازه می دهد تا گزارش هایی درباره تمایز در PNG تصاویر برای برنامه های کاربردی بر اساس {{ProgLang}} و {{EnvName}} تولید کنید"
    },
    "header": {
      "title": "مقایسه PNG تصاویر از طریق {{ProgLang}} {{EnvName}} برنامه های کاربردی",
      "description": "{{ProdFullName}} API هر گونه تفاوت بین PNG فایل ها را به سرعت و به راحتی جستجو می کند. برای به دست آوردن گزارش های مقایسه، برنامه های کاربردی {{ProgLang}}، ASP .NET، VB .NET و .NET را بهبود ببخشید."
    },
    "about": {
      "title": "کشف {{ProdFullName}} ویژگی های API",
      "content": "{{ProdFullName}} API برای مقایسه چندین PNG تصویر و تهیه گزارش های پیچیده در مورد هر گونه تمایز در چنین تصاویری طراحی شده است. ممکن است بدون نصب نرم افزار شخص ثالث در {{EnvName}} برنامه های شما استفاده شود. از {{ProdFullName}} با اضافه کردن چند خط کد با بسیاری از ویژگی های مفید خارج از جعبه استفاده کنید."
    },
    "steps": {
      "title": "نحوه مقایسه PNG تصاویر توسط {{ProgLang}}",
      "content": {
        "title": "گزارش ساخت تفاوت ها را در PNG تصاویر توسط [{{ProdShortName}}]({{ProductUrl}}) توصیف می کند",
        "step_1": "دانلود و نصب {{ProdFullName}} از [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "شیء Comparer Instantiate که مسیر را به تصویر PNG ارائه می دهد",
        "step_3": "PNG فایل های دیگر را برای مقایسه درگیر کنید",
        "step_4": "دریافت گزارش نهایی که تغییرات تصاویر را نشان می دهد"
      },
      "code": {
        "comments": {
          "comment_1": "ایجاد گزارش در مورد تغییرات در PNG تصاویر",
          "comment_2": "Create Comparer با اشاره به اولین فایل",
          "comment_3": "تصاویر دیگر را در فرآیند مقایسه درگیر کنید",
          "comment_4": "از گزارش حاصل لذت ببرید"
        }
      }
    },
    "formats": {
      "title": "مقایسه PNG تصاویر توسط {{ProgLang}} و {{EnvName}}",
      "description": "{{EnvName}} API برای مقایسه تصاویر PNG. اطلاعات مربوط به هرگونه تغییر در فایل ها را بدون تلاش اضافی دریافت کنید."
    }
  },
  "jpeg": {
    "head": {
      "title": "{{ProdFullName}} API برای JPEG مقایسه",
      "description": "{{ProdFullName}} نشان دهنده API قدرتمند برای جمع آوری داده ها در مورد تمایز در JPEG تصاویر برای {{ProgLang}} و {{EnvName}} است"
    },
    "header": {
      "title": "مقایسه تغییرات در JPEG تصاویر با {{EnvName}} تکنولوژی",
      "description": "جمع آوری و نمایش داده ها به عنوان یک گزارش در مورد تغییرات در JPEG فایل های ارائه شده توسط {{ProdFullName}} API به سرعت و به راحتی. راه حل های تجاری مبتنی بر {{ProgLang}}، ASP .NET، VB .NET و .NET Core می توانند با نرم افزار ما برای به دست آوردن داده های مفید قدرتمند شوند."
    },
    "about": {
      "title": "بررسی ویژگی های {{ProdFullName}} API",
      "content": "{{ProdFullName}} API قابلیت های غنی را در مقایسه تصاویر JPEG فراهم می کند. گزارش های حاصل حاوی داده هایی در مورد هر گونه تمایز در تصاویر انتخاب شده است. استفاده از نرم افزار ما در پروژه های {{ProgLang}} شما هیچ کتابخانه دیگری را درخواست نمی کند. فقط چند خط کد اضافه کنید و ابزار قدرتمندی برای دستیابی به اهداف خود دریافت کنید."
    },
    "steps": {
      "title": "نحوه مقایسه JPEG تصاویر توسط {{ProgLang}}",
      "content": {
        "title": "کنترل محتوای فایل های JPEG با [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "{{ProdFullName}} را از [{{PackageStoreName}}]({{PackageUrl}}) دریافت کنید و به پروژه خود اضافه کنید",
        "step_2": "از سازنده شی Comparer برای تنظیم مسیر به تصویر JPEG استفاده کنید",
        "step_3": "تصاویر JPEG دیگری را برای تجزیه و تحلیل درگیر کنید",
        "step_4": "بررسی گزارش ذخیره شده در دیسک محلی"
      },
      "code": {
        "comments": {
          "comment_1": "گزارش درباره تفاوت ها در JPEG تصاویر تهیه کنید",
          "comment_2": "مسیر فایل اصلی را به سازنده Comparer منتقل کنید",
          "comment_3": "مسیرهایی را برای تصاویر JPEG دیگر ارائه دهید",
          "comment_4": "گزارش حاصل را در فایل ذخیره کنید"
        }
      }
    },
    "formats": {
      "title": "مقایسه تصاویر JPEG با {{ProgLang}} {{EnvName}}",
      "description": "اطلاعات مربوط به هرگونه تغییر در فایل های JPEG را به راحتی با استفاده از محصول {{ProdFullName}} تجزیه و تحلیل کنید."
    }
  },
  "jpg": {
    "head": {
      "title": "{{ProdFullName}} API برای مقایسه JPG",
      "description": "API {{ProdFullName}} امکان جمع آوری داده ها در مورد تمایز در JPG تصاویر و ادغام آن در {{ProgLang}} {{EnvName}} برنامه ها را فراهم می کند."
    },
    "header": {
      "title": "مقایسه تغییرات در JPG تصاویر با {{EnvName}} تکنولوژی",
      "description": "به سرعت و به راحتی داده ها را در مورد تغییرات در JPG فایل ها با استفاده از {{ProdFullName}} API جمع آوری و گزارش دهید. راه حل های اصلی کسب و کار {{ProgLang}}، ASP .NET، VB .NET و .NET را با نرم افزار ما برای به دست آوردن بینش ارزشمند بهبود ببخشید."
    },
    "about": {
      "title": "کاوش در ویژگی های {{ProdFullName}} API",
      "content": "API {{ProdFullName}} قابلیت های گسترده ای را برای مقایسه JPG تصاویر ارائه می دهد و گزارش هایی حاوی تمایز در تصاویر انتخاب شده را تولید می کند. نرم افزار ما بدون نیاز به کتابخانه های اضافی به طور یکپارچه در {{ProgLang}} پروژه ادغام می شود و به شما امکان می دهد با کمترین کد به اهداف خود برسید."
    },
    "steps": {
      "title": "مقایسه JPG تصاویر با استفاده از {{ProgLang}}",
      "content": {
        "title": "مدیریت محتوای فایل JPG با [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "{{ProdFullName}} را از [{{PackageStoreName}}]({{PackageUrl}}) بدست آورید و آن را در پروژه خود ادغام کنید",
        "step_2": "شیء Comparer را نمونه سازی کنید و مسیر تصویر JPG را مشخص کنید",
        "step_3": "تصویر JPG دیگری را برای تجزیه و تحلیل اضافه کنید",
        "step_4": "گزارش ذخیره شده در دیسک محلی را مرور کنید"
      },
      "code": {
        "comments": {
          "comment_1": "یک گزارش با جزئیات تفاوت در JPG تصاویر ایجاد کنید",
          "comment_2": "مسیر اصلی فایل را به سازنده Comparer ارائه دهید",
          "comment_3": "مسیرها را برای تصاویر اضافی JPG مشخص کنید",
          "comment_4": "گزارش حاصل را در یک فایل ذخیره کنید"
        }
      }
    },
    "formats": {
      "title": "JPG مقایسه تصویر با {{EnvName}}",
      "description": "به راحتی تغییرات در JPG فایل را با استفاده از راه حل {{ProdFullName}} تجزیه و تحلیل کنید."
    }
  },
  "xlsx": {
    "head": {
      "title": "MS Excel مقایسه صفحه گسترده",
      "description": "{{ProdFullName}} API چک کردن اختلافات و تجزیه و تحلیل XLSX صفحات گسترده را تسهیل می کند. {{ProgLang}} {{EnvName}} پشتیبانی می شود."
    },
    "header": {
      "title": "استفاده از تکنولوژی های {{ProgLang}} برای مقایسه صفحات گسترده XLSX",
      "description": "API {{EnvName}}، که برای مقایسه انواع مختلف سند ساخته شده است، تفاوت ها را در MS Excel فایل شناسایی و گزارش می دهد. برنامه های کاربردی را با استفاده از {{ProgLang}}، ASP .NET، VB .NET یا .NET Core بسازید تا از مزایای آن استفاده کنید. گزارش های دقیق را با حداقل پیاده سازی کد دریافت کنید."
    },
    "about": {
      "title": "ویژگی های API {{ProdFullName}} را کشف کنید",
      "content": "تغییرات در صفحات گسترده XLSX خود را با گزارش مناسب در {{EnvName}} پروژه های خود تشخیص دهید. علاوه بر این، اطلاعات مربوط به سبک ها، اشکال و سایر محتوا را بازیابی کنید و صفحات گسترده XSLX را در یک سند جدید ادغام کنید. {{ProdFullName}} API را فقط با چند خط کد در پروژه های خود ادغام کنید. از نرم افزار ما بدون نیاز به توسعه دهندگان شخص ثالث استفاده کنید."
    },
    "steps": {
      "title": "تولید MS Excel XLSX گزارش مقایسه با استفاده از {{ProgLang}}",
      "content": {
        "title": "یک گزارش تمایز برای فایل های XLSX با استفاده از [{{ProdShortName}}]({{ProductUrl}}) ایجاد کنید",
        "step_1": "بسته {{ProdFullName}} را از [{{PackageStoreName}}]({{PackageUrl}}) بارگیری و نصب کنید",
        "step_2": "با ارائه مسیر فایل XLSX، شیء Comparer را نمونه سازی کنید",
        "step_3": "شامل XLSX صفحات گسترده برای مقایسه",
        "step_4": "گزارش مقایسه حاوی اطلاعات تمایز را بازیابی کنید"
      },
      "code": {
        "comments": {
          "comment_1": "یک گزارش در مورد تغییرات در XLSX فایل ایجاد کنید",
          "comment_2": "نمونه سازی شی Comparer برای پردازش صفحات گسترده",
          "comment_3": "حداقل یک فایل را برای مقایسه قرار دهید",
          "comment_4": "نتیجه مقایسه را تجزیه و تحلیل کنید"
        }
      }
    },
    "formats": {
      "title": "مقایسه صفحات گسترده MS Excel برای {{ProgLang}} برنامه",
      "description": "مزایای {{ProdFullName}} را برای کنترل نسخه های XLSX اسناد بررسی کنید. به سرعت و به راحتی اطلاعات را از MS Excel صفحه گسترده برای تجزیه و تحلیل بیشتر جمع آوری کنید."
    }
  },
  "pptx": {
    "head": {
      "title": "مقایسه PPTX از طریق {{ProdFullName}}",
      "description": "{{ProdFullName}} طراحی شده برای انجام مقایسه و تجزیه و تحلیل PPTX ارائه. API ما می تواند با {{ProgLang}} راه حل استفاده شود."
    },
    "header": {
      "title": "تجزیه و تحلیل MS PowerPoint PPTX ارائه با {{EnvName}} فن آوری",
      "description": "THE {{ProdFullName}} برای مقایسه انواع مختلف سند، برای تجزیه و تحلیل تفاوت ها در فایل های Microsoft PowerPoint طراحی شده است. برنامه های کاربردی مبتنی بر {{ProgLang}}، ASP .NET، VB .NET یا .NET Core می توانند با راه حل های ما بهبود یابند. حداقل اجرای کد برای دریافت گزارش های دقیق در مورد تمایز در اسناد کسب و کار مورد نیاز است."
    },
    "about": {
      "title": "نحوه استفاده از {{ProdFullName}} را باز کنید",
      "content": "با ساخت گزارش های دقیق همراه با {{EnvName}} پروژه خود، PPTX ارائه خود را تجزیه و تحلیل کنید. نه تنها متن، بلکه سبک ها، اشکال و سایر محتوا پردازش می شوند. نسخه های مختلف ارائه PPTX را در یک سند نتیجه ادغام کنید. {{ProdFullName}} می تواند به راحتی با چند خط کد در پروژه های شما درگیر شود. API ما نیازی به هیچ نرم افزاری از توسعه دهندگان شخص ثالث ندارد."
    },
    "steps": {
      "title": "با استفاده از {{ProgLang}} و {{EnvName}} گزارش های مقایسه MS PowerPoint PPTX تهیه کنید",
      "content": {
        "title": "دریافت گزارش تغییرات در PPTX با [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "بسته {{ProdFullName}} را با استفاده از [{{PackageStoreName}}]({{PackageUrl}}) نصب کنید",
        "step_2": "دریافت شیء مقایسه کننده را با ارائه PPTX مسیر",
        "step_3": "اضافه کردن PPTX ارائه بیشتر برای مقایسه",
        "step_4": "تجزیه و تحلیل گزارش ذخیره شده در دیسک محلی"
      },
      "code": {
        "comments": {
          "comment_1": "ایجاد تغییرات برای ارائه",
          "comment_2": "Comparer Instantiate که مسیر اول پرونده را عبور می کند",
          "comment_3": "اضافه کردن فایل های بیشتری برای مقایسه",
          "comment_4": "نتیجه مقایسه را ذخیره کنید"
        }
      }
    },
    "formats": {
      "title": "مقایسه ارائه های مایکروسافت PPTX در {{ProgLang}} برنامه",
      "description": "در مورد مزایای {{ProdFullName}} برای تجزیه و تحلیل PPTX ارائه مطلع باشید. گزارش های آموزنده در مورد تفاوت ها در MS PowerPoint ارائه تولید کنید."
    }
  }
}