{
  "common": {
    "head": {
      "title": "เปรียบเทียบไฟล์ {{FileFormatUp}} กับ {{ProgLang}} ซอฟต์แวร์เปรียบเทียบ",
      "description": "เปรียบเทียบและผสานไฟล์ {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}} {{EnvName}}ดึงข้อมูลสรุปความแตกต่างในเนื้อหาข้อความ และสไตล์"
    },
    "header": {
      "title": "เปรียบเทียบ {{FileFormatUp}} ใน {{ProgLang}} {{EnvName}}",
      "description": "{{EnvName}} API เปรียบเทียบเอกสาร เพื่อตรวจสอบความแตกต่างระหว่างไฟล์ {{FileFormatUp}} สองเวอร์ชัน และส่งออกไปยังเอกสารสุดท้ายพร้อมสรุปโดยละเอียดของความแตกต่างระหว่างเอกสารที่เปรียบเทียบ",
      "subtitle": "โซลูชันเปรียบเทียบเอกสาร",
      "action_title": "ดาวน์โหลดฟรี {{PackageStoreName}}"
    },
    "about": {
      "title": "ค้นพบข้อดีของ API {{ProdFullName}}",
      "content": "{{ProdFullName}} เป็น {{EnvName}} API ดั้งเดิมที่ออกแบบมาสำหรับการเปรียบเทียบภาพและเอกสารหลายรูปภาพในรูปแบบเดียวกันช่วยในการตรวจจับความแตกต่างภายในย่อหน้าคำตัวอักษรรูปร่างและแม้แต่รูปแบบข้อความของเอกสารที่เปรียบเทียบด้วยความสามารถในการรวมการเปลี่ยนแปลงเหล่านี้และส่งออกไปยังเอกสารสุดท้าย จึงรองรับการเปรียบเทียบและการรวมเอกสาร PDF Word สเปรดชีต Excel งานนำเสนอ PowerPoint ไดอะแกรม Visio อีเมล Outlook HTML ภาพวาด และรูปแบบไฟล์รูปภาพต่างๆ ทั้งหมดนี้โดยไม่จำเป็นต้องใช้ไลบรารีภายนอก"
    },
    "steps": {
      "title": "วิธีเปรียบเทียบไฟล์ {{FileFormatUp}} หลายไฟล์โดยใช้ {{ProgLang}}",
      "content": {
        "title": "เป็นไปได้ที่จะใช้ [{{ProdShortName}}]({{ProductUrl}}) เพื่อรับรายงานเกี่ยวกับความแตกต่างในไฟล์ {{FileFormatUp}} จำนวนมาก",
        "step_1": "ติดตั้ง {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}}) โดยใช้โปรแกรมจัดการแพ็คเกจที่คุณชื่นชอบ",
        "step_2": "จัดเตรียมอินสแตนซ์ของคลาส Comparer ที่มีเส้นทางเต็มไปยังไฟล์ {{FileFormatUp}} เริ่มต้น",
        "step_3": "ใส่ {{FileFormatUp}} อื่นอย่างน้อยหนึ่งตัวลงใน Comparer",
        "step_4": "รับรายงานขั้นสุดท้ายพร้อมความแตกต่างที่อธิบายอย่างแม่นยำ"
      },
      "code": {
        "comments": {
          "comment_1": "เปรียบเทียบเอกสารหลายเอกสารจากดิสก์ท้องถิ่น",
          "comment_2": "Instantiate Comparer ให้ไฟล์แรก",
          "comment_3": "เพิ่มไฟล์อื่น ๆ",
          "comment_4": "รับไฟล์ผลลัพธ์ที่มีชื่อที่ระบุ"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบรูปแบบไฟล์ยอดนิยมโดยใช้ {{ProgLang}}",
      "description": "{{EnvName}} API สำหรับการเปรียบเทียบรูปแบบเอกสารรับทราบข้อมูลอย่างดีเกี่ยวกับการเปลี่ยนแปลงในการประมวลผลเอกสารของคุณโดยไม่ต้องใช้ความพยายามเป็นพิเศษ"
    }
  },
  "pdf": {
    "head": {
      "title": "ตรวจสอบความแตกต่างของเอกสาร PDF ใน {{ProgLang}} {{EnvName}}",
      "description": "เปรียบเทียบและรวมไฟล์ PDF มากกว่าสองไฟล์ในแอปพลิเคชัน {{ProgLang}} {{EnvName}}ดึงข้อมูลสรุปความแตกต่างในเนื้อหา ข้อความ และรูปแบบของไฟล์ PDF"
    },
    "header": {
      "title": "เปรียบเทียบเอกสาร PDF ใน {{ProgLang}} {{EnvName}} แอปพลิเคชัน",
      "description": "{{EnvName}} API เปรียบเทียบเอกสาร สำหรับการระบุและแสดงความแตกต่างใน PDF s ภายในแอปพลิเคชันตาม {{ProgLang}}, ASP .NET, VB .NET และ .NET Coreรับรายงานโดยละเอียดได้อย่างง่ายดายเพื่อประสบการณ์ที่ราบรื่น"
    },
    "about": {
      "title": "ค้นพบคุณสมบัติ API {{ProdFullName}}",
      "content": "รับรายงานโดยละเอียดเกี่ยวกับความแตกต่างที่เอกสาร PDF ที่แอปพลิเคชัน {{EnvName}} ของคุณผสาน PDF s ที่แตกต่างกันไปเป็นรูปแบบใหม่ที่มีรูปแบบเดียวกันใช้ {{ProdFullName}} API โดยการเพิ่มโค้ดสองบรรทัดประมวลผล PDF และรูปแบบอื่น ๆ โดยไม่ต้องใช้ซอฟต์แวร์ของบุคคลที่สาม"
    },
    "steps": {
      "title": "วิธีเปรียบเทียบ PDF โดยใช้ {{ProgLang}}",
      "content": {
        "title": "รับรายงานเกี่ยวกับความแตกต่างในไฟล์ PDF จำนวนมากโดยใช้ [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "รับ {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}}) และติดตั้ง",
        "step_2": "สร้างอินสแตนซ์ Comparer ใหม่พร้อมเส้นทางไปยังไฟล์ PDF",
        "step_3": "เพิ่ม PDF อื่น ๆ ในการเปรียบเทียบ",
        "step_4": "ผลลัพธ์ประกอบด้วยรายงานเกี่ยวกับความแตกต่างทั้งสอง PDF s"
      },
      "code": {
        "comments": {
          "comment_1": "จัดทำรายงานความแตกต่าง PDF",
          "comment_2": "Instantiate Comparer ด้วยเส้นทางไปยังไฟล์แรก",
          "comment_3": "ผนวก PDF วินาทีขึ้นไปในการเปรียบเทียบ",
          "comment_4": "รายงานผลลัพธ์ที่จะวิเคราะห์"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบ PDF โดยใช้ {{ProgLang}} และรับรายงานฉบับเต็ม",
      "description": "ซอฟต์แวร์ {{EnvName}} {{ProgLang}} สำหรับการเปรียบเทียบเอกสาร PDFแจ้งให้ทราบข้อมูลเกี่ยวกับการเปลี่ยนแปลงใด ๆ ในเอกสารของคุณได้อย่างง่ายดาย"
    }
  },
  "docx": {
    "head": {
      "title": "เปรียบเทียบ MS Word DOCX ผ่าน {{ProgLang}} และ {{EnvName}}",
      "description": "DOCX เปรียบเทียบโดย {{ProdFullName}}รายงานโดยละเอียดพร้อมการเปลี่ยนแปลงที่เน้นระหว่างเอกสาร DOCXใช้ API ของเราพร้อมกับ {{ProgLang}}"
    },
    "header": {
      "title": "MS Word DOCX เปรียบเทียบกับ {{ProgLang}} {{EnvName}} แอปพลิเคชัน",
      "description": "{{EnvName}} API ที่ออกแบบมาสำหรับการเปรียบเทียบเอกสาร ค้นหาและรายงานความแตกต่างใด ๆ ในไฟล์ MS Wordสร้างแอปพลิเคชันตาม {{ProgLang}}, ASP .NET, VB .NET หรือ .NET Core เพื่อรับข้อได้เปรียบรับรายงานโดยละเอียดโดยเพิ่มบรรทัดรหัสสองสามบรรทัด"
    },
    "about": {
      "title": "ตรวจสอบคุณสมบัติ API {{ProdFullName}}",
      "content": "เปิดเผยการเปลี่ยนแปลงในเอกสาร DOCX ของคุณด้วยรายงานที่สะดวกในโครงการ {{EnvName}} ของคุณนอกจากนี้ รับข้อมูลเกี่ยวกับรูปแบบ รูปร่าง และเนื้อหาอื่น ๆ และรวมไฟล์ DOCX เข้ากับไฟล์ใหม่ข้อดีของ {{ProdFullName}} API สามารถนำไปยังโครงการของคุณได้โดยใช้โค้ดเพียงสองบรรทัดเท่านั้นใช้ซอฟต์แวร์ของเราโดยไม่มีนักพัฒนาบุคคลที่สาม"
    },
    "steps": {
      "title": "MS Word DOCX รายงานการเปรียบเทียบผ่าน {{EnvName}} และ {{ProgLang}}",
      "content": {
        "title": "เขียนรายงานความแตกต่างสำหรับไฟล์ DOCX โดยใช้ [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "ดาวน์โหลดแพคเกจ {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}}) และติดตั้ง",
        "step_2": "แสดงวัตถุตัวเปรียบเทียบอินสแตนซ์ที่ผ่านเส้นทางไปยัง DOCX",
        "step_3": "เพิ่มไฟล์ DOCX เพื่อเปรียบเทียบ",
        "step_4": "รับรายงานพร้อมข้อมูลความแตกต่าง"
      },
      "code": {
        "comments": {
          "comment_1": "รายงานการเปลี่ยนแปลงไฟล์ DOCX",
          "comment_2": "Instantiate Comparer สำหรับการประมวลผลเอกสาร",
          "comment_3": "เพิ่มไฟล์อย่างน้อยหนึ่งไฟล์สำหรับการเปรียบเทียบ",
          "comment_4": "วิเคราะห์ผลลัพธ์"
        }
      }
    },
    "formats": {
      "title": "การเปรียบเทียบ DOCX โดย {{ProgLang}} แอปพลิเคชัน",
      "description": "ข้อดี {{ProdFullName}} สำหรับการควบคุมเวอร์ชันของรูปแบบไฟล์ยอดนิยมรวบรวมข้อมูลเอกสาร MS Word ได้อย่างรวดเร็วและง่ายดาย"
    }
  },
  "png": {
    "head": {
      "title": "PNG ตรวจสอบความแตกต่างโดย {{ProdFullName}}",
      "description": "{{ProdFullName}} ช่วยให้สามารถสร้างรายงานเกี่ยวกับความแตกต่างที่ PNG รูปภาพสำหรับแอปพลิเคชันตาม {{ProgLang}} & {{EnvName}}"
    },
    "header": {
      "title": "เปรียบเทียบ PNG รูปภาพผ่านแอปพลิเคชัน {{ProgLang}} {{EnvName}}",
      "description": "{{ProdFullName}} API ค้นหาความแตกต่างระหว่างไฟล์ PNG ได้อย่างรวดเร็วและง่ายดายปรับปรุงแอปพลิเคชันหลัก {{ProgLang}}, ASP .NET, VB .NET และ .NET เพื่อรับรายงานการเปรียบเทียบ"
    },
    "about": {
      "title": "ค้นพบคุณสมบัติ API {{ProdFullName}}",
      "content": "{{ProdFullName}} API ออกแบบมาสำหรับการเปรียบเทียบ PNG ภาพหลายภาพ และจัดทำรายงานที่ซับซ้อนเกี่ยวกับความแตกต่างใด ๆ ในภาพดังกล่าวอาจใช้กับแอปพลิเคชัน {{EnvName}} ของคุณโดยไม่ต้องติดตั้งซอฟต์แวร์ของบุคคลที่สามใช้ {{ProdFullName}} โดยเพิ่มโค้ดสองบรรทัดพร้อมคุณสมบัติที่มีประโยชน์มากมายออกจากกล่อง"
    },
    "steps": {
      "title": "วิธีเปรียบเทียบรูปภาพ PNG โดย {{ProgLang}}",
      "content": {
        "title": "รายงานการสร้างอธิบายความแตกต่างในรูปภาพ PNG โดย [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "ดาวน์โหลดและติดตั้ง {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "แสดงวัตถุตัวเปรียบเทียบอินสแตนต์ที่ให้เส้นทางไปยังภาพ PNG",
        "step_3": "เกี่ยวข้องกับไฟล์ PNG อื่น ๆ ที่จะเปรียบเทียบ",
        "step_4": "รับรายงานขั้นสุดท้ายที่แสดงการเปลี่ยนแปลงรูปภาพ"
      },
      "code": {
        "comments": {
          "comment_1": "สร้างรายงานเกี่ยวกับการเปลี่ยนแปลงในรูปภาพ PNG",
          "comment_2": "สร้าง Comparer ชี้ไปที่ไฟล์แรก",
          "comment_3": "นำภาพอื่น ๆ มาใช้ในกระบวนการเปรียบเทียบ",
          "comment_4": "เพลิดเพลินกับรายงานผลลัพธ์"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบ PNG รูปภาพ โดย {{ProgLang}} และ {{EnvName}}",
      "description": "{{EnvName}} API สำหรับการเปรียบเทียบภาพ PNGรับข้อมูลเกี่ยวกับการเปลี่ยนแปลงใด ๆ ในไฟล์โดยไม่ต้องใช้ความพยายามพิเศษ"
    }
  },
  "jpeg": {
    "head": {
      "title": "{{ProdFullName}} API สำหรับ JPEG เปรียบเทียบ",
      "description": "{{ProdFullName}} แสดงถึง API ที่มีประสิทธิภาพสำหรับการรวบรวมข้อมูลเกี่ยวกับความแตกต่างใน JPEG ภาพที่จะเกี่ยวข้องกับ {{ProgLang}} & {{EnvName}}"
    },
    "header": {
      "title": "เปรียบเทียบการเปลี่ยนแปลงที่ภาพ JPEG ด้วยเทคโนโลยี {{EnvName}}",
      "description": "รวบรวมและแสดงเป็นรายงานข้อมูลเกี่ยวกับการเปลี่ยนแปลงในไฟล์ JPEG ที่จัดทำโดย {{ProdFullName}} API ได้อย่างรวดเร็วและง่ายดายโซลูชันทางธุรกิจที่ใช้ {{ProgLang}}, ASP .NET, VB .NET และ .NET Core สามารถเพิ่มประสิทธิภาพด้วยซอฟต์แวร์ของเราเพื่อรับข้อมูลที่เป็นประโยชน์"
    },
    "about": {
      "title": "ตรวจสอบคุณสมบัติ API {{ProdFullName}}",
      "content": "{{ProdFullName}} API ให้ฟังก์ชันการทำงานที่หลากหลายในการเปรียบเทียบ JPEG ภาพรายงานผลลัพธ์ประกอบด้วยข้อมูลเกี่ยวกับความแตกต่างใด ๆ ในภาพที่เลือกการใช้ซอฟต์แวร์ของเราในโครงการ {{ProgLang}} ของคุณไม่ต้องขอไลบรารีอื่นใดเพียงเพิ่มโค้ดบางบรรทัดและรับเครื่องมือที่มีประสิทธิภาพเพื่อให้บรรลุเป้าหมายของคุณ"
    },
    "steps": {
      "title": "วิธีเปรียบเทียบรูปภาพ JPEG โดย {{ProgLang}}",
      "content": {
        "title": "ควบคุมเนื้อหาของไฟล์ JPEG ด้วย [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "รับ {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}}) และเพิ่มลงในโครงการของคุณ",
        "step_2": "ใช้ตัวสร้างวัตถุ Comparer เพื่อตั้งค่าเส้นทางไปยังภาพ JPEG",
        "step_3": "เกี่ยวข้องกับภาพ JPEG อื่น ๆ ที่จะวิเคราะห์",
        "step_4": "ตรวจสอบรายงานที่บันทึกไว้ในแผ่นดิสก์ท้องถิ่น"
      },
      "code": {
        "comments": {
          "comment_1": "จัดทำรายงานเกี่ยวกับความแตกต่างใน JPEG ภาพ",
          "comment_2": "ส่งเส้นทางไฟล์หลักไปยังตัวสร้าง Comparer",
          "comment_3": "ระบุเส้นทางไปยังรูปภาพ JPEG อื่น ๆ",
          "comment_4": "บันทึกรายงานผลลัพธ์ลงในไฟล์"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบรูปภาพ JPEG กับ {{ProgLang}} {{EnvName}}",
      "description": "วิเคราะห์ข้อมูลเกี่ยวกับการเปลี่ยนแปลงใด ๆ ในไฟล์ JPEG ได้อย่างง่ายดายโดยใช้ผลิตภัณฑ์ {{ProdFullName}}"
    }
  },
  "jpg": {
    "head": {
      "title": "{{ProdFullName}} API สำหรับการเปรียบเทียบ JPG",
      "description": "API {{ProdFullName}} ช่วยให้สามารถรวบรวมข้อมูลเกี่ยวกับความแตกต่างภายในภาพ JPG และรวมเข้ากับแอปพลิเคชัน {{ProgLang}} {{EnvName}}"
    },
    "header": {
      "title": "เปรียบเทียบการเปลี่ยนแปลงในรูปภาพ JPG กับเทคโนโลยี {{EnvName}}",
      "description": "รวบรวมและรายงานข้อมูลเกี่ยวกับการเปลี่ยนแปลงในไฟล์ JPG ได้อย่างรวดเร็วและง่ายดายโดยใช้ {{ProdFullName}} APIปรับปรุงโซลูชันทางธุรกิจหลัก {{ProgLang}}, ASP .NET, VB .NET และ .NET ด้วยซอฟต์แวร์ของเราเพื่อให้ได้ข้อมูลเชิงลึกที่มีคุณค่า"
    },
    "about": {
      "title": "สำรวจคุณสมบัติ API {{ProdFullName}}",
      "content": "API {{ProdFullName}} นำเสนอฟังก์ชั่นที่กว้างขวางสำหรับการเปรียบเทียบภาพ JPG สร้างรายงานที่มีความแตกต่างภายในภาพที่เลือกซอฟต์แวร์ของเรารวมเข้ากับโครงการ {{ProgLang}} ได้อย่างราบรื่นโดยไม่ต้องใช้ไลบรารีเพิ่มเติม ช่วยให้คุณบรรลุวัตถุประสงค์ของคุณด้วยรหัสที่น้อยที่สุด"
    },
    "steps": {
      "title": "เปรียบเทียบรูปภาพ JPG โดยใช้ {{ProgLang}}",
      "content": {
        "title": "จัดการเนื้อหาแฟ้ม JPG ด้วย [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "รับ {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}}) และรวมเข้ากับโครงการของคุณ",
        "step_2": "สร้างอินสแตนซ์วัตถุ Comparer และระบุเส้นทางไปยังภาพ JPG",
        "step_3": "รวมภาพ JPG อื่นสำหรับการวิเคราะห์",
        "step_4": "ตรวจสอบรายงานที่บันทึกไว้ในดิสก์ท้องถิ่น"
      },
      "code": {
        "comments": {
          "comment_1": "สร้างรายงานโดยรายละเอียดความแตกต่างในรูปภาพ JPG",
          "comment_2": "ระบุเส้นทางไฟล์หลักไปยังตัวสร้าง Comparer",
          "comment_3": "ระบุเส้นทางไปยังรูปภาพเพิ่มเติม JPG",
          "comment_4": "บันทึกรายงานผลลัพธ์ลงในไฟล์"
        }
      }
    },
    "formats": {
      "title": "JPG เปรียบเทียบรูปภาพกับ {{EnvName}}",
      "description": "วิเคราะห์การเปลี่ยนแปลงในไฟล์ JPG ได้อย่างง่ายดายโดยใช้โซลูชัน {{ProdFullName}}"
    }
  },
  "xlsx": {
    "head": {
      "title": "MS Excel เปรียบเทียบสเปรดชีต",
      "description": "API {{ProdFullName}} อำนวยความสะดวกในการตรวจสอบความแตกต่างและการวิเคราะห์สเปรดชีต XLSX รองรับ {{ProgLang}} {{EnvName}}"
    },
    "header": {
      "title": "ใช้เทคโนโลยี {{ProgLang}} ในการเปรียบเทียบสเปรดชีต XLSX",
      "description": "API {{EnvName}} ที่ออกแบบมาสำหรับการเปรียบเทียบประเภทเอกสารต่างๆ ระบุและรายงานความแตกต่างภายในไฟล์ MS Excelสร้างแอปพลิเคชันโดยใช้ {{ProgLang}}, ASP .NET, VB .NET หรือ .NET Core เพื่อใช้ประโยชน์จากข้อดีของแอพพลิเคชั่นรับรายงานโดยละเอียดด้วยการใช้งานโค้ดน้อยที่สุด"
    },
    "about": {
      "title": "สำรวจคุณสมบัติของ {{ProdFullName}} API",
      "content": "ตรวจจับการเปลี่ยนแปลงในสเปรดชีต XLSX ของคุณด้วยการรายงานที่สะดวกในโครงการ {{EnvName}} ของคุณนอกจากนี้ ให้ดึงข้อมูลเกี่ยวกับสไตล์ รูปร่าง และเนื้อหาอื่น ๆ และรวมสเปรดชีต XSLX ลงในเอกสารใหม่รวม {{ProdFullName}} API เข้ากับโครงการของคุณด้วยโค้ดเพียงไม่กี่บรรทัดใช้ซอฟต์แวร์ของเราโดยไม่จำเป็นต้องมีนักพัฒนาบุคคลที่สาม"
    },
    "steps": {
      "title": "สร้างรายงานการเปรียบเทียบ MS Excel XLSX โดยใช้ {{ProgLang}}",
      "content": {
        "title": "สร้างรายงานความแตกต่างสำหรับไฟล์ XLSX โดยใช้ [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "ดาวน์โหลดและติดตั้งแพคเกจ {{ProdFullName}} จาก [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "สร้างอินสแตนซ์วัตถุ Comparer โดยระบุเส้นทางไฟล์ XLSX",
        "step_3": "รวมสเปรดชีต XLSX สำหรับการเปรียบเทียบ",
        "step_4": "ดึงรายงานการเปรียบเทียบที่มีข้อมูลความแตกต่าง"
      },
      "code": {
        "comments": {
          "comment_1": "สร้างรายงานการเปลี่ยนแปลงในไฟล์ XLSX",
          "comment_2": "สร้างอินสแตนซ์วัตถุ Comparer สำหรับการประมวลผลสเปรดชีต",
          "comment_3": "รวมไฟล์อย่างน้อยหนึ่งไฟล์สำหรับการเปรียบเทียบ",
          "comment_4": "วิเคราะห์ผลการเปรียบเทียบ"
        }
      }
    },
    "formats": {
      "title": "การเปรียบเทียบสเปรดชีต MS Excel สำหรับแอปพลิเคชัน {{ProgLang}}",
      "description": "สำรวจข้อดีของ {{ProdFullName}} สำหรับการควบคุมเอกสาร XLSX เวอร์ชันรวบรวมข้อมูลจากสเปรดชีต MS Excel ได้อย่างรวดเร็วและง่ายดายเพื่อการวิเคราะห์เพิ่มเติม"
    }
  },
  "pptx": {
    "head": {
      "title": "เปรียบเทียบ PPTX ผ่าน {{ProdFullName}}",
      "description": "{{ProdFullName}} ที่ออกแบบมาเพื่อทำการเปรียบเทียบและวิเคราะห์การนำเสนอ PPTXAPI ของเราสามารถใช้กับโซลูชัน {{ProgLang}}"
    },
    "header": {
      "title": "วิเคราะห์งานนำเสนอ MS PowerPoint PPTX ด้วยเทคโนโลยี {{EnvName}}",
      "description": "THE {{ProdFullName}} ได้รับการออกแบบมาสำหรับการเปรียบเทียบประเภทเอกสารต่างๆ เพื่อวิเคราะห์ความแตกต่างภายในไฟล์ Microsoft PowerPointแอปพลิเคชันที่ใช้ {{ProgLang}}, ASP .NET, VB .NET หรือ .NET Core สามารถปรับปรุงได้ด้วยโซลูชันของเราจำเป็นต้องใช้รหัสขั้นต่ำเพื่อรับรายงานโดยละเอียดเกี่ยวกับความแตกต่างในเอกสารทางธุรกิจ"
    },
    "about": {
      "title": "เปิดวิธีใช้ {{ProdFullName}}",
      "content": "วิเคราะห์งานนำเสนอ PPTX ของคุณโดยสร้างรายงานโดยละเอียดพร้อมกับโครงการ {{EnvName}} ของคุณไม่เพียง แต่ข้อความเท่านั้น แต่ยังมีการประมวลผลรูปแบบ รูปร่าง และเนื้อหาอื่น ๆผสานงานนำเสนอ PPTX เวอร์ชันต่างๆลงในเอกสารผลลัพธ์ {{ProdFullName}} สามารถเข้าร่วมกับโครงการของคุณได้อย่างง่ายดายด้วยโค้ดเพียงสองบรรทัดAPI ของเราไม่ต้องการซอฟต์แวร์ใด ๆ ของนักพัฒนาบุคคลที่สาม"
    },
    "steps": {
      "title": "เขียนรายงานการเปรียบเทียบ MS PowerPoint PPTX โดยใช้ {{ProgLang}} และ {{EnvName}}",
      "content": {
        "title": "รับรายงานเกี่ยวกับการเปลี่ยนแปลงใน PPTX ด้วย [{{ProdShortName}}]({{ProductUrl}})",
        "step_1": "ติดตั้งแพคเกจ {{ProdFullName}} โดยใช้ [{{PackageStoreName}}]({{PackageUrl}})",
        "step_2": "รับวัตถุ Comparer ที่ให้เส้นทาง PPTX",
        "step_3": "เพิ่มการนำเสนอ PPTX เพื่อเปรียบเทียบ",
        "step_4": "วิเคราะห์รายงานที่บันทึกไว้ในแผ่นดิสก์ท้องถิ่น"
      },
      "code": {
        "comments": {
          "comment_1": "เขียนการเปลี่ยนแปลงสำหรับการนำเสนอ",
          "comment_2": "Instantiate Comparer ผ่านเส้นทางไฟล์แรก",
          "comment_3": "รวมไฟล์เพิ่มเติมสำหรับการเปรียบเทียบ",
          "comment_4": "บันทึกผลการเปรียบเทียบ"
        }
      }
    },
    "formats": {
      "title": "เปรียบเทียบการนำเสนอของ Microsoft PPTX ในแอปพลิเคชัน {{ProgLang}}",
      "description": "รับทราบข้อดีของ {{ProdFullName}} สำหรับการวิเคราะห์งานนำเสนอ PPTXสร้างรายงานให้ข้อมูลเกี่ยวกับความแตกต่างในการนำเสนอ MS PowerPoint"
    }
  }
}